{
  "1": {
    "layer1": "In Surah Al-Asr, Allah begins with a profound oath: *\"Wal-’asr\"* (By time), drawing immediate attention to the sacred value of time itself. Classical Shia scholars like Allamah Tabatabai explain that *al-’asr* refers not only to chronological time but to its transformative essence—a force that shapes human destiny and tests our choices. The term’s root (*‘aṣara*) also implies \"pressing\" or \"extracting,\" symbolizing how time presses humanity to reveal their true spiritual state. Imam Ali (as) emphasized in Nahj al-Balagha that time is both a fleeting resource and a divine trust, urging believers to seize each moment for eternal good.  \n\nRevealed in Mecca during intense persecution, this verse reassured early Muslims that their struggles were temporary yet purposeful. The oath by time served as a reminder that hardship, like all moments, is transient and charged with divine wisdom. For Shia thought, *al-’asr* also evokes the \"era\" of divine guidance through the Ahlul Bayt (as), framing time as a continuum of spiritual opportunity under the Imams’ teachings.  \n\nToday, this verse calls Muslims to mindful stewardship of time. In an age of distraction, it challenges us to prioritize faith, justice, and community—aligning daily actions with Quranic values. Practically, this means balancing worldly duties with worship, seeking knowledge, and serving others, recognizing that every second is a chance to grow closer to Allah. By viewing time as a sacred gift, not a mundane measure, we transform routine into worship and fleeting moments into eternal rewards. Surah Al-Asr thus becomes a timeless compass, guiding believers toward purposeful living amid life’s chaos.",
    "layer2": "In classical Shia exegesis, the opening verse of Surah al-Asr, *\"By time\"* (wal-ʿaṣr), is interpreted as a profound divine oath invoking time itself as a witness to humanity’s existential purpose and accountability. Allama Tabatabai, in *Al-Mizan*, emphasizes that the term *ʿaṣr* (time) here symbolizes the totality of temporal existence as a manifestation of divine wisdom. He argues that time’s cyclical and linear dimensions—marked by creation, decay, and renewal—reflect Allah’s sovereignty over history and human destiny. This oath, according to Tabatabai, serves as a prelude to the surah’s central theme: the inevitability of human loss except for those grounded in faith, righteous action, and communal truth (Quran 103:2-3).  \n\nShaykh Tabrisi, in *Majma al-Bayan*, notes that classical commentators diverged on the precise meaning of *ʿaṣr*. Some identified it with specific periods, such as the \"era of the Prophet\" or the \"afternoon prayer\" (ṣalāt al-ʿaṣr), while others viewed it as a universal metaphor for the fleeting nature of worldly life. The Shia tradition, however, uniquely links this temporal framework to the theological concept of *walaya* (divinely ordained guardianship). Time’s passage is seen as a test of adherence to the guidance of the Ahl al-Bayt, whose teachings embody the \"truth\" (ḥaqq) and \"patience\" (ṣabr) mentioned in the surah.  \n\nImam Jafar al-Sadiq is reported to have interpreted *ʿaṣr* as an allusion to the reappearance of the Mahdi, the divinely guided savior whose advent will fulfill time’s purpose. This eschatological dimension underscores the Shia belief in the interconnectedness of temporal existence, divine justice, and the necessity of prophetic and Imamic guidance. Jurisprudentially, the verse reinforces the Shia ethical imperative to align one’s life with eternal principles—faith, moral action, and loyalty to truth—amidst time’s transient trials. Thus, the oath transcends mere chronology, inviting contemplation of humanity’s covenantal relationship with the Divine.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Asr’s opening verse—“By time”—resonates as a profound meditation on temporality, human purpose, and ethical urgency. Scholars like Ayatollah Nasir Makarim Shirazi emphasise that the oath by *al-Asr* (time) underscores its dual role as both a divine blessing and a moral test. Time, in this framework, is not merely a linear progression but a sacred trust requiring conscious stewardship—a concept amplified in our era of climate crises, where humanity’s misuse of time to address environmental degradation mirrors spiritual neglect.  \n\nModern thinkers, such as Dr. Mohammad Ali Shomali, link this verse to existential philosophy, noting that time’s fleeting nature compels humans to seek transcendent meaning. Scientific insights—like entropy in thermodynamics, which illustrates time’s irreversible flow—parallel theological notions of accountability. The verse’s brevity, says Shomali, mirrors the urgency of addressing contemporary issues: social inequality, technological alienation, and intergenerational justice.  \n\nSocially, the verse critiques today’s “hustle culture,” where time is commodified, urging instead a balance between material productivity and spiritual growth. Iranian philosopher Abdolkarim Soroush connects *al-Asr* to multicultural ethics, noting that shared human experiences of temporality—evident in Buddhist mindfulness or Abrahamic teachings on Sabbath—invite interfaith solidarity against collective crises like pandemics or war.  \n\nFor Shia communities, the verse also evokes Imam Ali’s counsel: “Opportunity passes like clouds,” urging proactive justice-seeking. In a globalised world, this translates to leveraging time for dialogue, sustainability, and uplifting marginalised voices—a timeless call made urgent by our present crossroads.",
    "layer4": "In the profound oath of Surah Al-Asr, \"By time,\" the Ahlul Bayt (peace be upon them) unveil layers of divine wisdom central to human salvation. Imam Jafar al-Sadiq (peace be upon him) taught that \"العصر\" refers not merely to chronological time, but to the era of divine guardianship (Wilayah) embodied in the Imams. He states: \"The 'Asr' is the Qa'im [Imam Mahdi], for he is the Time (al-Asr) through which people attain success or perish\" (Tafsir al-Qummi). This transforms our understanding of time from a passive measurement to an active spiritual reality tied to recognition of divine guidance.\n\nLady Fatimah (peace be upon her) emphasized in her Fadak sermon that true time-consciousness means aligning one's life with the \"axis of truth\" - the Imams who are the living interpreters of Quranic wisdom. The verse becomes a call to anchor oneself in the Ark of Salvation: clinging to the rope of Ahlul Bayt amidst life's tempests. Imam Ali (peace be upon him) taught that every moment carries two opportunities - \"a passing cloud and an approaching cloud\" (Nahj al-Balagha), urging believers to use time as a vessel for nurturing faith through remembrance (dhikr), service, and preparation for the Hereafter.\n\nPractically, this verse invites believers to:  \n1. Measure time through acts affirming Wilayah - daily recitation of Ziyarat Ashura, supporting the oppressed, and studying the Imams' teachings.  \n2. Recognize that wasted moments are squandered opportunities to strengthen connection with the Divine Proof (Hujjah).  \n3. View trials as \"divine timekeepers\" refining souls for eternal proximity to the Infallibles.  \n\nAs Imam Sadiq taught: \"The faithful are the companions of Time, for they ride upon it towards Truth\" (Bihar al-Anwar). True success lies in synchronizing our fleeting moments with the timeless guidance of Muhammad's purified progeny.",
    "layer1_urdu": "سورہ الثر میں ، اللہ ایک گہری حلف سے شروع ہوتا ہے: * \"وال-اسر\" * (وقت کے ساتھ) ، خود وقت کی مقدس قدر کی طرف فوری توجہ مبذول کرواتا ہے۔ الامہ تبتابائی جیسے کلاسیکی شیعہ اسکالرز نے وضاحت کی ہے کہ * ال ’اسر * سے نہ صرف تاریخی وقت بلکہ اس کے تغیراتی جوہر سے مراد ہے۔ یہ ایک ایسی قوت ہے جو انسانی تقدیر کی تشکیل کرتی ہے اور ہمارے انتخاب کی جانچ کرتی ہے۔ اصطلاح کی جڑ (*‘آرا*) کا مطلب یہ بھی ہے کہ\" دبانے \"یا\" نکالنے \"کی علامت ہے کہ کس طرح وقت انسانیت کو اپنی حقیقی روحانی حالت کو ظاہر کرنے کے لئے دباتا ہے۔ امام علی (ع) نے ناہج البالاگھا میں اس بات پر زور دیا کہ وقت ایک تیز رفتار وسائل اور خدائی اعتماد دونوں ہی ہے ، اور مومنین پر زور دیتا ہے کہ وہ ہر لمحے کو ابدی بھلائی کے لئے ضبط کریں۔  \n\nشدید ظلم و ستم کے دوران مکہ میں انکشاف کیا گیا ، اس آیت نے ابتدائی مسلمانوں کو یقین دلایا کہ ان کی جدوجہد عارضی اور بامقصد تھی۔ وقت کے ساتھ حلف نے ایک یاد دہانی کے طور پر کام کیا کہ تمام لمحوں کی طرح مشکلات بھی عارضی ہے اور اس پر خدائی حکمت کا الزام عائد کیا گیا ہے۔ شیعہ کے خیال کے لئے ، * الیسر * نے اہل بیت (ع) کے ذریعہ الہی رہنمائی کے \"دور\" کو بھی جنم دیا ہے ، اور وقت کو اماموں کی تعلیمات کے تحت روحانی مواقع کے تسلسل کے طور پر تیار کیا ہے۔  \n\nآج ، یہ آیت مسلمانوں کو وقت کی ذہن سازی کی ذمہ داری قرار دیتی ہے۔ خلفشار کے دور میں ، یہ ہمیں چیلنج کرتا ہے کہ وہ ایمان ، انصاف اور معاشرے کو ترجیح دے۔ عملی طور پر ، اس کا مطلب یہ ہے کہ دنیاوی فرائض کو عبادت کے ساتھ توازن بنانا ، علم کی تلاش ، اور دوسروں کی خدمت کرنا ، یہ تسلیم کرنا کہ ہر سیکنڈ اللہ کے قریب ہونے کا موقع ہے۔ وقت کو ایک مقدس تحفہ کے طور پر دیکھنے سے ، نہ کہ ایک دنیاوی اقدام ، ہم معمولات کو عبادت اور تیز لمحوں کو ابدی انعامات میں تبدیل کرتے ہیں۔ اس طرح سورہ الصار ایک لازوال کمپاس بن جاتا ہے ، اور مومنین کو زندگی کے انتشار کے درمیان بامقصد زندگی گزارنے کی طرف رہنمائی کرتا ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الصر کی ابتدائی آیت ، * \"وقت کے مطابق\" * (وال -ʿر) ، کو ایک گہری الہی حلف کے طور پر سمجھا جاتا ہے جو خود کو انسانیت کے وجودی مقصد اور احتساب کے گواہ کے طور پر پیش کرتا ہے۔ *المزان *میں ، علامہ تبتابائی ، اس بات پر زور دیتا ہے کہ یہاں کی اصطلاح *ʿar *(وقت) الہی حکمت کے مظہر کے طور پر عارضی وجود کی مکمل حیثیت کی علامت ہے۔ ان کا استدلال ہے کہ وقت کے چکرمک اور لکیری طول و عرض - تخلیق ، کشی اور تجدید کے ذریعہ نشان زد - تاریخ اور انسانی تقدیر پر اللہ کی خودمختاری کو تبدیل کرتے ہیں۔ تبتابائی کے مطابق ، یہ حلف سوراہ کے مرکزی موضوع کے پیش کش کا کام کرتا ہے: انسانی نقصان کی ناگزیریت کے علاوہ ان لوگوں کے علاوہ جو عقیدے ، نیک عمل اور فرقہ وارانہ سچائی کی بنیاد پر ہیں (قرآن 103: 2-3)۔  \n\nشیاک تبریسی ، *ماجما البیان *میں ، نوٹ کرتے ہیں کہ کلاسیکی مبصرین نے *ʿar *کے عین مطابق معنی پر موڑ لیا۔ کچھ لوگوں نے اس کی نشاندہی مخصوص ادوار کے ساتھ کی ، جیسے \"نبی of کا دور\" یا \"دوپہر کی دعا\" (الل ā ال العور) ، جبکہ دوسروں نے اسے دنیاوی زندگی کی کفایت شعاری نوعیت کے لئے ایک عالمگیر استعارہ کے طور پر دیکھا۔ شیعہ روایت ، تاہم ، اس دنیاوی فریم ورک کو انفرادی طور پر * والیا * (خدائی طور پر مقرر کردہ سرپرستی) کے مذہبی تصور سے جوڑتی ہے۔ وقت کی گزرنے کو اہل البائٹ کی رہنمائی پر عمل پیرا ہونے کے امتحان کے طور پر دیکھا جاتا ہے ، جس کی تعلیمات \"سچ\" (اقق) اور \"صبر) اور\" صبر \"(ایبر) کو سورت میں بیان کرتی ہیں۔  \n\nامام جعفر السادق نے * ʿar * کو مہدی کی ظاہری شکل کے اشارے کے طور پر تشریح کی ہے ، جو الہی رہنمائی نجات دہندہ ہے جس کی آمد وقت کے مقصد کو پورا کرے گی۔ یہ ایسکیٹولوجیکل جہت دنیاوی وجود ، خدائی انصاف ، اور پیشن گوئی اور امامک رہنمائی کی ضرورت کے باہم مربوط ہونے پر شیعہ کے عقیدے کی نشاندہی کرتی ہے۔ فقہی طور پر ، آیت شیعہ اخلاقی لازمی کو تقویت بخشتی ہے کہ کسی کی زندگی کو ابدی اصولوں کے ساتھ ہم آہنگ کیا جائے۔ اس طرح ، حلف محض تاریخ سے تجاوز کرتا ہے ، جو الہی کے ساتھ انسانیت کے عہد کے تعلقات کے بارے میں غور و فکر کرتا ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ السر کی افتتاحی آیت \"وقت کے ساتھ\"-دنیاوی ، انسانی مقصد اور اخلاقی عجلت پر گہری مراقبہ کے طور پر جنم دیتا ہے۔ آیت اللہ ناصر مکر شرازی جیسے اسکالرز نے اس بات پر زور دیا ہے کہ * الاسر * (وقت) کے ذریعہ حلف ایک الہی نعمت اور اخلاقی امتحان دونوں کے طور پر اس کے دوہری کردار کی نشاندہی کرتا ہے۔ وقت ، اس فریم ورک میں ، محض ایک لکیری پیشرفت نہیں ہے بلکہ ایک مقدس اعتماد ہے جس میں شعور کی ذمہ داری کی ضرورت ہوتی ہے۔ یہ ایک ایسا تصور ہے جو ہمارے آب و ہوا کے بحرانوں کے دور میں بڑھتا ہے ، جہاں ماحولیاتی انحطاط کو دور کرنے کے لئے انسانیت کا وقت کا غلط استعمال روحانی نظرانداز کرتا ہے۔  \n\nجدید مفکرین ، جیسے ڈاکٹر محمد علی شومالی ، اس آیت کو وجودی فلسفہ سے جوڑتے ہیں ، اور یہ کہتے ہوئے کہ اس وقت کی تیز رفتار فطرت انسانوں کو ماورائے معنی حاصل کرنے پر مجبور کرتی ہے۔ سائنسی بصیرت - جیسے تھرموڈینامکس میں اینٹروپی ، جو وقت کے ناقابل واپسی بہاؤ کی عکاسی کرتی ہے۔ شومالی کا کہنا ہے کہ آیت کی نسل کشی کا کہنا ہے کہ عصری مسائل کو حل کرنے کی اشد ضرورت ہے: معاشرتی عدم مساوات ، تکنیکی بیگانگی ، اور بین السطور انصاف۔  \n\nمعاشرتی طور پر ، آیت آج کی \"ہلچل ثقافت\" پر تنقید کرتی ہے ، جہاں وقت کا اجناس ہوتا ہے ، اور اس کے بجائے مادی پیداوری اور روحانی نشوونما کے مابین توازن پر زور دیتا ہے۔ ایرانی فلسفی عبدولکریم سورس نے * الاسر * کو کثیر الثقافتی اخلاقیات سے مربوط کیا ، جس میں یہ نوٹ کیا گیا ہے کہ دنیاوی کے مشترکہ تجربات-بدھ مت کی ذہنیت یا سبت کے بارے میں ابراہیمی تعلیمات میں واضح ہیں۔  \n\nشیعہ کمیونٹیز کے لئے ، آیت امام علی کے مشورے کو بھی بیان کرتی ہے: \"مواقع بادلوں کی طرح گزرتے ہیں ،\" فعال انصاف کے حصول پر زور دیتے ہیں۔ عالمگیریت کی دنیا میں ، اس کا ترجمہ مکالمے ، استحکام ، اور پسماندہ آوازوں کو بڑھانے کے لئے وقت کا فائدہ اٹھانے کا ہے۔",
    "layer4_urdu": "سورہ الصر کی گہری حلف میں ، \"وقت کے ساتھ ،\" اہل بیت (ان پر امن ہے) انسانی نجات کے مرکز الہی حکمت کی پرتوں کی نقاب کشائی کرتے ہیں۔ امام جعفر السادق (اس پر امن) نے سکھایا کہ \"العزر\" محض تاریخی وقت سے نہیں ، بلکہ الہٰی سرپرستی (ولیہ) کے دور سے مراد ہے جو اماموں میں شامل ہیں۔ وہ کہتے ہیں: \"'ASR' قیم [امام مہدی] ہے ، کیونکہ وہ وہ وقت (الاسر) ہے جس کے ذریعے لوگ کامیابی حاصل کرتے ہیں یا ہلاک ہوتے ہیں\" (طافسیر القومی)۔ یہ وقت کے بارے میں ہماری سمجھ کو غیر فعال پیمائش سے ایک فعال روحانی حقیقت میں بدل دیتا ہے جو خدائی رہنمائی کے اعتراف سے منسلک ہوتا ہے۔\n\nلیڈی فاطمہ (اس پر امن) نے اپنے فداک خطبے میں اس بات پر زور دیا کہ حقیقی وقت کے شعور کا مطلب ہے کسی کی زندگی کو \"سچائی کے محور\" کے ساتھ سیدھ میں رکھنا - وہ امام جو قرآنی حکمت کے زندہ ترجمان ہیں۔ یہ آیت نجات کے صندوق میں خود کو لنگر انداز کرنے کا مطالبہ بن جاتی ہے: زندگی کے طوفان کے درمیان اہل بیت کی رسی سے چمٹے ہوئے۔ امام علی (اس پر امن) نے یہ سکھایا کہ ہر لمحہ دو مواقع حاصل کرتا ہے۔\n\nعملی طور پر ، یہ آیت مومنوں کو دعوت دیتی ہے:  \n1. ویلیح کی تصدیق کرنے والے اعمال کے ذریعے وقت کی پیمائش کریں - زیارت آشورا کی روزانہ تلاوت ، مظلوموں کی حمایت کرنا ، اور اماموں کی تعلیمات کا مطالعہ کرنا۔  \n2. پہچانیں کہ ضائع ہونے والے لمحات خدائی ثبوت (ہجاہ) کے ساتھ رابطے کو مستحکم کرنے کے مواقع سے دوچار ہیں۔  \n3. ٹرائلز کو \"الہی ٹائم کیپرز\" کے طور پر دیکھیں ، انفلیبلز سے ابدی قربت کے لئے روحوں کو بہتر بناتے ہیں۔  \n\nجیسا کہ امام صادق نے سکھایا: \"وفادار وقت کے ساتھی ہیں ، کیونکہ وہ اس پر سچائی کی طرف سوار ہیں\" (بہار الانور)۔ حقیقی کامیابی محمد کی پاکیزہ اولاد کی لازوال رہنمائی کے ساتھ ہمارے تیز لمحوں کو ہم آہنگ کرنے میں مضمر ہے۔",
    "layer5": "The opening verse of Surah al-Asr, “By time,” has inspired rich exegetical discussions across Islamic traditions. Both Shia and Sunni scholars recognize the Qur’anic oath’s rhetorical power, with Tabari (Sunni) and Tabatabai (Shia) agreeing that swearing by time underscores humanity’s existential vulnerability and the imperative to pursue righteousness. Shared themes include time’s ephemerality, human accountability, and the necessity of faith (īmān) and righteous action (ʿamal ṣāliḥ) as antidotes to loss, as emphasized in Ibn Kathir’s tafsir and Majma al-Bayan by Tabrisi.  \n\nDivergences emerge in theological nuance. Sunni commentators like Qurtubi and Razi often interpret “al-ʿaṣr” temporally, referencing the afternoon prayer (ʿaṣr) or the Prophet’s era as a moral benchmark. Al-Razi’s Mafatih al-Ghayb philosophically frames time as a divine creation reflecting God’s wisdom. Shia exegetes, while acknowledging these layers, frequently emphasize walāyah (allegiance to divinely appointed leadership) as integral to fulfilling the verse’s call. Al-Mizan highlights Imam Ali’s narration that “time” symbolically alludes to the era of the Imams’ guidance, while Tusi’s Tibyan links the oath to humanity’s need for infallible stewardship to avoid spiritual decline.  \n\nThese differences stem from distinct theological frameworks: Sunni thought prioritizes individual and communal adherence to prophetic precedent, whereas Shia interpretations intertwine Qur’anic ethics with Imamah’s ontological necessity. Practically, Shia spirituality may accentuate emulating the Ahl al-Bayt within temporal struggles, while Sunni applications often stress personal accountability within communal orthopraxy. Such variations reflect historical developments in each tradition’s epistemological sources and spiritual priorities, yet both uphold the verse’s core ethical mandate—a convergence underscoring shared Islamic ethical concerns despite interpretive diversity.",
    "layer5_urdu": "\"وقت کے ساتھ\" سورہ الصر کی افتتاحی آیت نے اسلامی روایات میں بھرپور مستعدی مباحثوں کو متاثر کیا ہے۔ شیعہ اور سنی اسکالر دونوں قرآنی حلف کی بیان بازی کی طاقت کو تسلیم کرتے ہیں ، جس میں تباری (سنی) اور تبتابائی (شیعہ) اس بات پر متفق ہیں کہ وقت کی قسم کھا کر انسانیت کی وجودی کمزوری اور راستبازی کا پیچھا کرنے کے لئے لازمی خطرہ ہے۔ مشترکہ موضوعات میں وقت کی حقیقت پسندی ، انسانی احتساب ، اور ایمان کی ضرورت (امان) اور نیک عمل (عمال الی ḥ) کو نقصان کے اینٹی ڈوٹس کے طور پر شامل کیا گیا ہے ، جیسا کہ ابن کتھیر کے طافسیر اور مجرو البیان میں تبریسی کے ذریعہ زور دیا گیا ہے۔  \n\nمذہبی نوادرات میں تفریق پیدا ہوتی ہے۔ سنی مبصرین جیسے قربانی اور رازی اکثر \"العر\" کی عارضی طور پر تشریح کرتے ہیں ، اور دوپہر کی نماز (ʿar) یا نبی کے دور کو اخلاقی معیار کے طور پر حوالہ دیتے ہیں۔ العزار کی مافاتیہ الغیب فلسفیانہ طور پر وقت کو ایک الہی تخلیق کے طور پر تیار کرتا ہے جو خدا کی دانشمندی کی عکاسی کرتا ہے۔ شیعہ نے ان پرتوں کو تسلیم کرتے ہوئے ، اس آیت کی کال کو پورا کرنے کے لئے لازمی طور پر والیہ (الہٰی مقرر کردہ قیادت سے بیعت) پر کثرت سے زور دیا۔ المزان نے امام علی کے اس بیان کو اجاگر کیا کہ \"وقت\" علامتی طور پر اماموں کی رہنمائی کے دور کی طرف اشارہ کرتا ہے ، جبکہ توسی کا تبیان روحانی زوال سے بچنے کے لئے انفرادی ذمہ داری کی انسانیت کی ضرورت سے حلف کو جوڑتا ہے۔  \n\nیہ اختلافات الگ الگ مذہبی فریم ورک سے پیدا ہوتے ہیں: سنی سوچ انفرادی اور پیشن گوئی کی مثال کے ساتھ فرقہ واریت کو ترجیح دیتی ہے ، جبکہ شیعہ کی ترجمانی قرآنی اخلاقیات کو اممہ کی آنٹولوجیکل ضرورت کے ساتھ جوڑتی ہے۔ عملی طور پر ، شیعہ روحانیت دنیاوی جدوجہد کے اندر اے ایچ ایل البائت کی تقلید کرنے میں مدد فراہم کرسکتی ہے ، جبکہ سنی ایپلی کیشنز اکثر فرقہ وارانہ آرتھوپریکسی کے اندر ذاتی احتساب پر زور دیتے ہیں۔ اس طرح کے تغیرات ہر روایت کے علمی ذرائع اور روحانی ترجیحات میں تاریخی پیشرفت کی عکاسی کرتے ہیں ، پھر بھی دونوں آیت کے بنیادی اخلاقی مینڈیٹ کو برقرار رکھتے ہیں۔ یہ تعبیر تنوع کے باوجود مشترکہ اسلامی اخلاقی خدشات کی نشاندہی کرتا ہے۔",
    "layer2short": "In classical Shia exegesis, the opening verse of Surah al-Asr, *\"By time\"* (wal-ʿaṣr), is interpreted as a profound divine oath invoking time itself as a witness to humanity’s existential purpose and accountability. Allama Tabatabai, in *Al-Mizan*, emphasizes that the term *ʿaṣr* (time) here symbolizes the totality of temporal existence as a manifestation of divine wisdom. He argues that time’s cyclical and linear dimensions—marked by creation, decay, and renewal—reflect Allah’s sovereignty over history and human destiny. This oath, according to Tabatabai, serves as a prelude to the surah’s central theme: the inevitability of human loss except for those grounded in faith, righteous action, and communal truth (Quran 103:2-3).  ",
    "layer2short_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الصر کی ابتدائی آیت ، * \"وقت کے مطابق\" * (وال -ʿر) ، کو ایک گہری الہی حلف کے طور پر سمجھا جاتا ہے جو خود کو انسانیت کے وجودی مقصد اور احتساب کے گواہ کے طور پر پیش کرتا ہے۔ *المزان *میں ، علامہ تبتابائی ، اس بات پر زور دیتا ہے کہ یہاں کی اصطلاح *ʿar *(وقت) الہی حکمت کے مظہر کے طور پر عارضی وجود کی مکمل حیثیت کی علامت ہے۔ ان کا استدلال ہے کہ وقت کے چکرمک اور لکیری طول و عرض - تخلیق ، کشی اور تجدید کے ذریعہ نشان زد - تاریخ اور انسانی تقدیر پر اللہ کی خودمختاری کو تبدیل کرتے ہیں۔ تبتابائی کے مطابق ، یہ حلف سوراہ کے مرکزی موضوع کے پیش کش کا کام کرتا ہے: انسانی نقصان کی ناگزیریت کے علاوہ ان لوگوں کے علاوہ جو عقیدے ، نیک عمل اور فرقہ وارانہ سچائی کی بنیاد پر ہیں (قرآن 103: 2-3)۔  "
  },
  "2": {
    "layer1": "Surah Al-Asr, a short but profound Meccan chapter, delivers a universal truth about the human condition. The second verse, *إِنَّ ٱلْإِنسَٰنَ لَفِى خُسْرٍ* (\"Indeed, mankind is in loss\"), uses the word *insan* (humanity) to emphasize our shared vulnerability. The term *khusr* signifies a deep, irreversible loss—not merely financial or temporary, but a spiritual bankruptcy threatening our eternal destiny. Classical Shia commentaries, such as those by Allama Tabatabai in *Al-Mizan*, explain that this \"loss\" stems from humanity’s tendency to prioritize transient worldly pursuits over lasting spiritual growth, leaving souls adrift without divine guidance.\n\nRevealed during the early Meccan period, this verse resonated with a society immersed in materialism, tribalism, and moral decay. The Prophet Muhammad (peace be upon him) faced intense rejection as he called people to abandon idolatry and greed. By declaring all humanity \"in loss,\" the verse dismantles arrogance and urges self-reflection—a theme echoed in Imam Ali’s teachings in *Nahj al-Balagha*, where he warns that worldly distractions can blind us to our true purpose: preparing for the hereafter.\n\nThe verse’s power lies in its universality: no one is exempt except those described in the next verse (103:3) who embrace faith, righteous deeds, truth, and patience. Shia tradition emphasizes that \"truth\" (*haqq*) includes loyalty to the Ahlul Bayt, whose teachings illuminate the path away from loss. Today, this verse challenges Muslims to audit their lives: Are we investing in actions that outlast us, like serving others, seeking knowledge, and nurturing faith? In an age of consumerism and instant gratification, it calls us to prioritize spiritual wealth—kindness, integrity, and remembrance of God—over fleeting gains. By anchoring ourselves in divine guidance and the examples of the Imams, we transform this warning into a roadmap for salvation.",
    "layer2": "In classical Shia exegesis, Surah al-Asr’s declaration that \"mankind is in loss\" (103:2) is understood as a profound ontological diagnosis of the human condition, contingent upon humanity’s alignment with divine guidance. Allama Tabatabai in *Al-Mizan* elucidates that \"khusr\" (loss) here denotes the squandering of human potential when life is spent pursuing transient worldly aims rather than eternal truths. This loss is existential, not merely economic or social, arising from failure to actualize the soul’s purpose: worship and proximity to Allah. Tabrisi’s *Majma al-Bayan* reinforces this, noting that the verse’s universality (\"all mankind\") underscores the inescapable reality that no soul is exempt from this peril except through the salvific criteria outlined in the subsequent verse (103:3). \n\nShia commentators uniquely emphasize that the \"excepted\" group in verse 3 — those who combine faith, righteous deeds, mutual exhortation to truth, and patience — implicitly necessitates adherence to the *Wilayah* (guardianship) of the Ahlul Bayt. As articulated by scholars like Sheikh Tusi, true faith (iman) is inseparable from recognition of the Imams’ divinely ordained authority, while \"truth\" (haqq) encompasses both theological correctness and allegiance to the Prophetic household. Patience (sabr) is further interpreted as steadfastness in facing temporal hardships and upholding justice, reflecting the Shia ethos of resistance to oppression. \n\nTheological discussions in *Bihar al-Anwar* link this loss to the squandering of the intellect’s capacity to recognize divine proofs (hujjah), a failure that severs the soul from its primordial covenant (mithaq). Thus, the verse serves as a jurisprudential foundation for the Shia understanding of moral and spiritual accountability, wherein salvation is contingent upon harmonizing belief, action, and loyalty to the Imamate — the ultimate safeguard against existential bankruptcy.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Asr’s declaration that “mankind is in loss” resonates as a profound critique of modern existential and societal crises. Ayatollah Nasir Makarem Shirazi, in his *Tafsir Nemuneh*, frames this “loss” as a spiritual bankruptcy arising from prioritizing materialism over transcendent purpose—a theme amplified by today’s consumerist cultures and mental health epidemics linked to meaninglessness. Scholars like Dr. Mohammad Ali Shomali connect the verse to the Quranic emphasis on *tawhid* (divine unity), arguing that disconnection from the sacred breeds alienation, ecological destruction, and social fragmentation.  \n\nModern neuroscience echoes this, revealing how chronic stress and isolation—hallmarks of hyper-individualistic societies—corrode human well-being, aligning with the verse’s warning. Philosophers like Abdolkarim Soroush contextualize the “loss” as a failure to cultivate ethical resilience amid systems that commodify human dignity, from exploitative capitalism to algorithmic dehumanization.  \n\nThe verse’s urgency intersects with global challenges: climate collapse reflects humanity’s “loss” in privileging short-term gain over stewardship, while interfaith dialogues (notably with Buddhist and Christian ethicists) find common ground in diagnosing greed and heedlessness as roots of suffering. Multicultural applications highlight how migrant communities or marginalized groups, despite material hardship, often embody the “exceptions” to loss through faith-driven solidarity and perseverance—mirroring the Surah’s closing call to “truth and patience.”  \n\nUltimately, contemporary Shia thought interprets this verse as both a warning and a roadmap: the “loss” is reversible through reorienting life toward communal justice, spiritual mindfulness, and active hope—principles championed by Imam Ali’s teachings on social equity and the transformative power of steadfast faith in turbulent times.",
    "layer4": "The profound declaration \"Indeed, mankind is in loss\" pierces the veil of worldly illusion, exposing the perilous state of those adrift from divine guidance. Imam Ali (as) taught that this verse is a mirror reflecting the eternal truth: *\"Every soul breathes the air of loss except those anchored in the four pillars of faith—belief in God, righteous deeds, mutual exhortation to truth, and patient perseverance.\"* (Tafsir al-Burhan). The Ahlul Bayt (as) illuminate these pillars as inseparable from their divine mission.  \n\nThe \"truth\" enjoined is none other than the Wilayah of the Imams (as), the luminous chain of guidance. Imam Sadiq (as) states: *\"The ‘truth’ in this verse is the Wilayah of Ali (as) and his successors; ‘patience’ is steadfastness in obeying them\"* (Tafsir al-Qummi). Without allegiance to the Imamah, deeds become hollow vessels—a theme echoed by Lady Fatimah (as), who warned that worldly pursuits devoid of divine guardianship are \"the loss of losses\" (Bihar al-Anwar).  \n\nThis verse’s wisdom lies in its call to transcend transactional worship. True salvation lies in immersing one’s soul in the ocean of the Ahlul Bayt’s teachings—where prayer becomes proximity, fasting becomes purification of the heart, and charity becomes a bridge of love. The practical path is clear: cling to the Thaqalayn (Quran and Ahlul Bayt) as twin lifelines. Recite Surah Al-Asr daily with the awareness that salvation lies in binding one’s life to the Imams’ footsteps—turning every action into an act of devotion, every trial into a test of loyalty.  \n\nLet the believer ask: Do my days accumulate the currency of divine nearness, or am I trading eternity for dust? As Imam Ali (as) taught: *\"The true loser is he who wastes his soul.\"* To escape this loss, one must anchor every breath in the love and obedience of those whom God appointed as guides—the Ark of Salvation in a stormy sea.",
    "layer1_urdu": "ایک مختصر لیکن گہرا میکان باب ، سورہ الاسر ، انسانی حالت کے بارے میں ایک آفاقی سچائی فراہم کرتا ہے۔ دوسری آیت ، * إِnafّ ٱlْإِinsinceanc َ خُsْrٍ * (\"واقعی ، انسانیت کو نقصان میں ہے\") ، ہمارے مشترکہ کمزوری پر زور دینے کے لئے لفظ * انسان * (انسانیت) کا استعمال کرتا ہے۔ اصطلاح * خسر * ایک گہرے ، ناقابل واپسی نقصان کی نشاندہی کرتی ہے - نہ صرف مالی یا عارضی ، بلکہ ایک روحانی دیوالیہ پن جو ہماری ابدی تقدیر کو خطرہ بناتا ہے۔ کلاسیکی شیعہ کی تفسیر ، جیسے *المزان *میں علامہ تبتابائی کے ذریعہ ، وضاحت کرتے ہیں کہ یہ \"نقصان\" انسانیت کے رجحان سے پیدا ہوتا ہے تاکہ پائیدار روحانی نشوونما کے دوران عارضی دنیاوی حصول کو ترجیح دی جاسکے ، اور روحوں کو بغیر کسی رہنمائی کے رہ جاتا ہے۔\n\nابتدائی مکہ کے دور کے دوران انکشاف ہوا ، یہ آیت مادیت ، قبائلی ازم اور اخلاقی کشی میں ڈوبی معاشرے سے گونج اٹھی۔ حضرت محمد صلی اللہ علیہ وآلہ وسلم کو شدید مسترد کرنے کا سامنا کرنا پڑا جب اس نے لوگوں کو بت پرستی اور لالچ کو ترک کرنے کے لئے کہا۔ تمام انسانیت کو \"نقصان میں\" قرار دے کر ، آیت تکبر کو ختم کرتی ہے اور خود عکاسی پر زور دیتی ہے۔ یہ ایک موضوع *ناہج البالاگھا *میں امام علی کی تعلیمات میں گونجتا ہے ، جہاں وہ متنبہ کرتا ہے کہ دنیاوی خلفشار ہمیں اپنے اصل مقصد سے اندھا کر سکتا ہے: اس کے بعد کی تیاری۔\n\nآیت کی طاقت اس کی عالمگیریت میں ہے: اگلی آیت (103: 3) میں بیان کردہ ان کے علاوہ کسی کو بھی مستثنیٰ نہیں ہے جو ایمان ، نیک اعمال ، سچائی اور صبر کو قبول کرتے ہیں۔ شیعہ روایت پر زور دیا گیا ہے کہ \"سچائی\" (*حق*) میں اہل بیت کے ساتھ وفاداری بھی شامل ہے ، جس کی تعلیمات نقصان سے دور راستے کو روشن کرتی ہیں۔ آج ، یہ آیت مسلمانوں کو اپنی زندگی کا آڈٹ کرنے کے ل challenges چیلنج کرتی ہے: کیا ہم ان اقدامات میں سرمایہ کاری کر رہے ہیں جو ہمیں سب سے آگے بڑھاتے ہیں ، جیسے دوسروں کی خدمت کرنا ، علم کی تلاش ، اور ایمان کی پرورش؟ صارفیت اور فوری تسکین کے دور میں ، یہ ہمیں روحانی دولت - شفقت ، سالمیت اور خدا کی یاد کو ترجیح دینے کا مطالبہ کرتا ہے۔ خود کو الہی رہنمائی اور اماموں کی مثالوں میں لنگر انداز کرکے ، ہم اس انتباہ کو نجات کے لئے روڈ میپ میں تبدیل کردیتے ہیں۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ السر کا یہ اعلان کہ \"بنی نوع انسان نقصان میں ہے\" (103: 2) کو انسانی حالت کی گہری اونٹولوجیکل تشخیص کے طور پر سمجھا جاتا ہے ، انسانیت کی الہی رہنمائی کے ساتھ صف بندی کے مطابق۔ * المزان * میں الامہ تبتابائی نے یہ واضح کیا کہ یہاں \"خسر\" (نقصان) انسانی صلاحیتوں کو بھڑکانے کی نشاندہی کرتا ہے جب زندگی ابدی سچائیوں کے بجائے عارضی دنیاوی مقاصد کے تعاقب میں صرف ہوتی ہے۔ یہ نقصان وجودی ہے ، محض معاشی یا معاشرتی نہیں ، روح کے مقصد کو حقیقت میں سمجھنے میں ناکامی سے پیدا ہوتا ہے: اللہ کی عبادت اور قربت۔ تبریسی کی * مجس البیان * اس کو تقویت ملی ہے ، یہ نوٹ کرتے ہوئے کہ آیت کی عالمگیریت (\"تمام انسانیت\") ناگزیر حقیقت کی نشاندہی کرتی ہے کہ کسی بھی روح کو اس خطرے سے مستثنیٰ نہیں ہے سوائے اس کے کہ بعد کی آیت (103: 3) میں بیان کردہ نجات کے معیار کے ذریعے۔ \n\nشیعہ مبصرین نے انفرادی طور پر اس بات پر زور دیا ہے کہ آیت 3 میں \"مستثنیٰ\" گروہ - جو لوگ عقیدہ ، نیک اعمال ، سچائی کے ساتھ باہمی نصیحت اور صبر کو یکجا کرتے ہیں۔ جیسا کہ شیخ توسی جیسے اسکالرز کے ذریعہ بیان کیا گیا ہے ، سچے عقیدے (ایمان) کو اماموں کے ’خدائی طور پر مقرر کردہ اختیار کے اعتراف سے لازم و ملزوم ہے ، جبکہ\" سچائی \"(حق) پیشن گوئی گھریلو سے مذہبی درستگی اور بیعت دونوں پر مشتمل ہے۔ صبر (ایس اے بی آر) کو مزید وقتی مشکلات کا سامنا کرنے اور انصاف کی حمایت میں ثابت قدمی کے طور پر سمجھا جاتا ہے ، جو ظلم کے خلاف مزاحمت کے شیعہ اخلاق کی عکاسی کرتا ہے۔ \n\n* بہار الانور * میں مذہبی مباحثے اس نقصان کو الہی ثبوتوں (ہجاہ) کو پہچاننے کے لئے عقل کی صلاحیت کو ختم کرنے سے جوڑتے ہیں ، یہ ایک ناکامی ہے جو روح کو اس کے ابتدائی عہد (میتھاق) سے دور کرتی ہے۔ اس طرح ، یہ آیت اخلاقی اور روحانی احتساب کے بارے میں شیعہ تفہیم کے لئے فقہ کی بنیاد کے طور پر کام کرتی ہے ، جس میں نجات امامیٹ کے ساتھ اعتقاد ، عمل اور وفاداری کو ہم آہنگ کرنے پر مستقل ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ السر کا یہ اعلان کہ \"بنی نوع انسان کے نقصان میں ہے\" جدید وجودی اور معاشرتی بحرانوں کی گہری تنقید کے طور پر گونجتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں ، اس \"نقصان\" کو ایک روحانی دیوالیہ پن کے طور پر پیش کیا ہے جو ماورائی مقصد سے زیادہ مادیت کو ترجیح دینے سے پیدا ہوتا ہے۔ یہ ایک موضوع آج کی صارفیت کی ثقافتوں اور ذہنی صحت کی وبائی امراض نے بے معنی سے منسلک کیا ہے۔ ڈاکٹر محمد علی شومالی جیسے اسکالرز آیت کو * تاؤہد * (الہی اتحاد) پر قرآنی زور سے مربوط کرتے ہیں ، اور یہ استدلال کرتے ہیں کہ مقدس نسلوں سے الگ ہونے ، ماحولیاتی تباہی اور معاشرتی ٹکڑے سے منقطع ہونا۔  \n\nجدید نیورو سائنس اس کی بازگشت کرتے ہیں ، جس سے یہ ظاہر ہوتا ہے کہ کس طرح دائمی تناؤ اور تنہائی-ہائپر انفرادیت پسند معاشروں کے ہال مارکس-آیت کی انتباہ کے ساتھ صف بندی کرتے ہوئے ، انسانی فلاح و بہبود کا مقابلہ کرتے ہیں۔ عبدولکریم جیسے فلسفی \"نقصان\" کو سیاق و سباق سے متصادم کرتے ہیں جس میں اخلاقی لچک کو فروغ دینے میں ناکامی کے طور پر انسانی وقار کو فائدہ اٹھانے والے نظاموں کے درمیان ، استحصالی سرمایہ داری سے لے کر الگورتھم ڈیہومنائزیشن تک۔  \n\nآیت کی عجلت عالمی چیلنجوں کے ساتھ ملتی ہے: آب و ہوا کے خاتمے سے انسانیت کے \"نقصان\" کی عکاسی ہوتی ہے جس سے وہ اسٹیورشپ کے مقابلے میں قلیل مدتی فائدہ کو استحقاق دیتے ہیں ، جبکہ بین المذاہب مکالمے (خاص طور پر بدھ مت اور عیسائی اخلاقیات کے ساتھ) لالچ کی تشخیص میں مشترکہ بنیاد اور مبتلا کی جڑوں کی جڑوں کی طرح مشترکہ بنیاد پاتے ہیں۔ کثیر الثقافتی ایپلی کیشنز اس بات پر روشنی ڈالتے ہیں کہ کس طرح مہاجر برادریوں یا پسماندہ گروہوں کو ، مادی مشکلات کے باوجود ، اکثر عقیدے سے چلنے والی یکجہتی اور استقامت کے ذریعہ کھو جانے والے \"استثناء\" کو مجسم بناتے ہیں۔  \n\nبالآخر ، عصری شیعہ نے اس آیت کو ایک انتباہ اور روڈ میپ دونوں کی ترجمانی کی ہے: \"نقصان\" فرقہ وارانہ انصاف ، روحانی ذہنیت ، اور فعال امید کی طرف ازسر نو زندگی کی بحالی کے قابل ہے۔",
    "layer4_urdu": "گہرا اعلان \"واقعی ، بنی نوع انسان کو نقصان میں ہے\" دنیاوی وہم کے پردے کو چھید دیتا ہے ، اور ان لوگوں کی خطرناک حالت کو بے نقاب کرتا ہے جو خدائی رہنمائی سے باز آتے ہیں۔ امام علی (ع) نے سکھایا کہ یہ آیت ایک آئینہ ہے جو ابدی سچائی کی عکاسی کرتی ہے: * \"ہر روح خدا کے اعتبار سے عقیدے کے چار ستونوں میں لنگر انداز ہونے والے افراد کے علاوہ نقصان کی ہوا کا سانس لیتی ہے۔ اہل بائٹ (ع) ان ستونوں کو اپنے الہی مشن سے لازم و ملزوم کے طور پر روشن کرتے ہیں۔  \n\n\"سچائی\" کا حکم نامہ کوئی اور نہیں ہے ، امام (ع) کے ولیہ ، جو رہنمائی کا برائٹ سلسلہ ہے۔ امام صادق (ع) نے کہا ہے: * اس آیت میں \"سچائی 'علی (ع) کی ولایہ ہے اور اس کے جانشینوں ؛‘ صبر ’ان کی تعمیل کرنے میں ثابت قدمی ہے\" * (طافسیر الکوومی)۔ امامہ سے بیعت کے بغیر ، اعمال کھوکھلی برتن بن جاتے ہیں۔ یہ ایک موضوع لیڈی فاطمہ (ع) نے بازیافت کیا ، جس نے متنبہ کیا کہ خدائی سرپرستی سے خالی دنیاوی تعاقب \"نقصانات کا نقصان\" ہے (بہار الانور)۔  \n\nاس آیت کی دانشمندی ٹرانزیکشنل عبادت کو عبور کرنے کے لئے اس کی کال میں ہے۔ حقیقی نجات ایک کی روح کو اہل بیت کی تعلیمات کے سمندر میں غرق کرنے میں مضمر ہے۔ جہاں دعا قربت بن جاتی ہے ، روزہ دل کی تطہیر ہوجاتا ہے ، اور خیرات محبت کا ایک پل بن جاتی ہے۔ عملی راستہ واضح ہے: جڑواں لائف لائنز کے طور پر تھاقالین (قرآن اور اہل بیت) سے چمٹے ہوئے۔ روزانہ اس شعور کے ساتھ سورہ الاسر کی تلاوت کریں کہ نجات کسی کی زندگی کو اماموں کے نقش قدم پر پابند کرنے میں مضمر ہے۔  \n\nمومن سے پوچھیں: کیا میرے دن خدائی قربت کی کرنسی جمع کرتے ہیں ، یا میں دھول کے لئے ابدیت کا کاروبار کر رہا ہوں؟ جیسا کہ امام علی (ع) نے سکھایا: * \"حقیقی ہارے ہوئے وہ ہے جو اپنی جان کو ضائع کرتا ہے۔\" * اس نقصان سے بچنے کے ل one ، کسی کو ان لوگوں کی محبت اور اطاعت میں ہر سانس کو لنگر انداز کرنا ہوگا جن کو خدا نے ہدایت نامے کے طور پر مقرر کیا تھا - ایک طوفانی سمندر میں نجات کا صندوق۔",
    "layer5": "The verse’s stark declaration of universal human loss has drawn rich exegetical engagement across traditions. Both Shia and Sunni scholars broadly concur that the verse establishes a spiritual ultimatum: humanity’s existential peril can only be averted through divine guidance. Tabatabai (Al-Mizan) and Ibn Kathir (Tafsir) alike emphasize that the “loss” here transcends material failure, denoting eternal ruin for those neglecting faith (īmān) and righteous action. This aligns with classical interpretations linking the verse to the surah’s subsequent verses, which prescribe “faith, good deeds, mutual exhortation to truth, and patience” (103:3) as salvific remedies—a framework affirmed by Tabrisi (Majma al-Bayan) and Qurtubi (Al-Jami).  \n\nDivergences emerge in defining the “truth” (ḥaqq) to be enjoined. Shia commentaries, particularly Tusi (At-Tibyan) and Qummi (Tafsir al-Qummi), contextualize this within the theological necessity of *walāyah* (allegiance to the Ahl al-Bayt), viewing recognition of Imam Ali’s leadership as integral to fulfilling the verse’s mandate. Tabatabai frames ḥaqq as encompassing both divine unity and the Imams’ divinely ordained authority. In contrast, Sunni exegetes like Tabari (Jami al-Bayan) and Razi (Mafatih al-Ghayb) interpret ḥaqq more expansively as adherence to Quranic principles and Prophetic Sunnah, without explicit reference to leadership disputes.  \n\nThese distinctions reflect broader theological paradigms: Shia tafsir often embeds verses within narratives of divinely guided succession, while Sunni works prioritize communal consensus (ijmāʿ) and the Sahaba’s collective legacy. Practically, this influences devotional emphasis—Shia tradition may stress adherence to Imams as embodiments of truth, whereas Sunni interpretations reinforce communal solidarity and ethical reciprocity. Historically, these trajectories stem from early debates over religious authority post-Prophet Muhammad, with Shia hermeneutics preserving a distinct epistemological reliance on the Ahl al-Bayt’s teachings. Both traditions, however, unite in viewing the verse as a call to transcend temporal pursuits through spiritually transformative action.",
    "layer5_urdu": "آیت کی آیت کے عالمی سطح پر انسانی نقصان کی سخت اعلان نے روایات میں بھرپور مستعدی مشغولیت پیدا کردی ہے۔ شیعہ اور سنی اسکالرز دونوں بڑے پیمانے پر اس بات پر متفق ہیں کہ آیت ایک روحانی الٹی میٹم کو قائم کرتی ہے: انسانیت کا وجودی خطرہ صرف الہی رہنمائی کے ذریعے ہی ٹالا جاسکتا ہے۔ تبتابائی (العزان) اور ابن کتھیر (طافسیر) ایک جیسے ہی اس بات پر زور دیتے ہیں کہ یہاں کا \"نقصان\" مادی ناکامی سے بالاتر ہے ، اور ان لوگوں کو نظرانداز کرنے والے عقیدے (īman) اور راستباز کارروائیوں کے لئے ابدی بربادی کی نشاندہی کرتا ہے۔ یہ طبقاتی تشریحات کے ساتھ سیدھے ہیں جو آیت کو سورہ کی اس کے بعد کی آیات سے جوڑتے ہیں ، جو \"ایمان ، نیک اعمال ، سچائی کے لئے باہمی نصیحت ، اور صبر\" لکھتے ہیں۔  \n\n\"سچائی\" (اقق) کی وضاحت کرنے میں تفریق ابھرتی ہے۔ شیعہ کی تفسیر ، خاص طور پر توسی (اتبیان) اور قمی (طافسیر القومی) ، اس کو * والیہ * (اے ایچ ایل ال بیت کی بیعت) کی مذہبی ضرورت کے اندر سیاق و سباق بنائیں ، اور اس کو آیت کے مینڈیٹ کو پورا کرنے کے لئے انضمام کے طور پر امام علی کی قیادت کو تسلیم کرتے ہوئے دیکھیں۔ تبتابائی فریم نے الہی اتحاد اور اماموں کے خدائی طور پر مقرر کردہ اختیار کو شامل کیا ہے۔ اس کے برعکس ، سنی کی توثیقوں جیسے تباری (جامی البیان) اور ریزی (مافاتیہ الغیب) اعق کو قیادت کے تنازعات کے واضح حوالہ کے بغیر قرآنی اصولوں اور پیشن گوئی سنت کی پابندی کے طور پر زیادہ تر وسعت کی ترجمانی کرتے ہیں۔  \n\nیہ امتیازات وسیع تر مذہبی نمونوں کی عکاسی کرتے ہیں: شیعہ طافسر اکثر الہامی رہنمائی کی جانشینی کے داستانوں میں آیات کو سرایت کرتا ہے ، جبکہ سنی کام فرقہ وارانہ اتفاق رائے (Ijmāʿ) اور سہبا کی اجتماعی میراث کو ترجیح دیتے ہیں۔ عملی طور پر ، اس سے عقیدت مندانہ زور کو متاثر کیا جاتا ہے - شیا روایت حقیقت کے مجسموں کے طور پر اماموں پر عمل پیرا ہونے پر زور دے سکتی ہے ، جبکہ سنی تشریحات فرقہ وارانہ یکجہتی اور اخلاقی باہمی استحکام کو تقویت دیتے ہیں۔ تاریخی طور پر ، یہ چالیں مذہبی اتھارٹی کے بعد کے حامی محمد کے بارے میں ابتدائی مباحثوں سے پیدا ہوتی ہیں ، شیعہ ہرمینیٹکس نے اے ایچ ایل البیٹ کی تعلیمات پر ایک الگ علمی انحصار کا تحفظ کیا ہے۔ تاہم ، دونوں روایات روحانی طور پر تبدیلی کے عمل کے ذریعہ دنیاوی تعاقب کو عبور کرنے کی کال کے طور پر آیت کو دیکھنے میں متحد ہوجاتی ہیں۔",
    "layer2short": "In classical Shia exegesis, Surah al-Asr’s declaration that \"mankind is in loss\" (103:2) is understood as a profound ontological diagnosis of the human condition, contingent upon humanity’s alignment with divine guidance. Allama Tabatabai in *Al-Mizan* elucidates that \"khusr\" (loss) here denotes the squandering of human potential when life is spent pursuing transient worldly aims rather than eternal truths. This loss is existential, not merely economic or social, arising from failure to actualize the soul’s purpose: worship and proximity to Allah. Tabrisi’s *Majma al-Bayan* reinforces this, noting that the verse’s universality (\"all mankind\") underscores the inescapable reality that no soul is exempt from this peril except through the salvific criteria outlined in the subsequent verse (103:3). ",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ السر کا یہ اعلان کہ \"بنی نوع انسان نقصان میں ہے\" (103: 2) کو انسانی حالت کی گہری اونٹولوجیکل تشخیص کے طور پر سمجھا جاتا ہے ، انسانیت کی الہی رہنمائی کے ساتھ صف بندی کے مطابق۔ * المزان * میں الامہ تبتابائی نے یہ واضح کیا کہ یہاں \"خسر\" (نقصان) انسانی صلاحیتوں کو بھڑکانے کی نشاندہی کرتا ہے جب زندگی ابدی سچائیوں کے بجائے عارضی دنیاوی مقاصد کے تعاقب میں صرف ہوتی ہے۔ یہ نقصان وجودی ہے ، محض معاشی یا معاشرتی نہیں ، روح کے مقصد کو حقیقت میں سمجھنے میں ناکامی سے پیدا ہوتا ہے: اللہ کی عبادت اور قربت۔ تبریسی کی * مجس البیان * اس کو تقویت ملی ہے ، یہ نوٹ کرتے ہوئے کہ آیت کی عالمگیریت (\"تمام انسانیت\") ناگزیر حقیقت کی نشاندہی کرتی ہے کہ کسی بھی روح کو اس خطرے سے مستثنیٰ نہیں ہے سوائے اس کے کہ بعد کی آیت (103: 3) میں بیان کردہ نجات کے معیار کے ذریعے۔ "
  },
  "3": {
    "layer1": "Surah Al-Asr, a concise Meccan revelation, delivers a universal truth: all humanity faces spiritual loss except those who embody four interconnected qualities—*iman* (faith), righteous action, mutual encouragement toward *al-haqq* (truth), and perseverance through *sabr* (patience). Verse 3 outlines this divine exception, emphasizing that salvation lies not in isolated piety but in a collective commitment to truth and resilience. Early Muslims, facing persecution in Mecca, found in these words a roadmap for survival: faith fortified by action, communal solidarity, and unyielding patience amid trials.  \n\nThe term *tawasaw* (mutual exhortation) is pivotal here, reflecting Islam’s emphasis on collective responsibility. Shia commentaries, such as those by Allamah Tabatabai, stress that *al-haqq* encompasses both divine truth—rooted in the Quran and the teachings of the Ahlul Bayt—and justice, while *sabr* signifies steadfastness in adhering to these principles despite hardship. Imam Ali’s teachings often linked *sabr* to active endurance, not passive acceptance, urging believers to \"bind the heart to truth\" even in adversity.  \n\nIn modern contexts, this verse calls Muslims to nurture communities where faith translates into ethical action, where individuals actively support one another in upholding justice, and where patience is practiced as a dynamic resistance to oppression, apathy, or moral compromise. For Shia Muslims, this resonates deeply with the ethos of Ashura—honoring Imam Hussain’s stand for truth amid tyranny. Practically, it means fostering environments where religious education, social justice initiatives, and emotional resilience are communal priorities. Whether through advocating for equity, supporting those facing hardship, or maintaining integrity in personal conduct, Surah Al-Asr reminds believers that spiritual success is a shared journey, anchored in truth and collective perseverance.",
    "layer2": "In Surah Al-Asr verse 3, the Qur’an delineates the sole path to salvation from universal human loss through four interconnected conditions: faith (iman), righteous action (amal salih), mutual exhortation to truth (tawasau bil-haqq), and mutual exhortation to patience (tawasau bis-sabr). Classical Shia exegetes emphasize these elements as both individual obligations and collective imperatives rooted in the ontological necessity of divine guidance. \n\nTabatabai’s *Al-Mizan* interprets the verse’s exception clause as a covenant binding the faithful to dynamic spiritual and social responsibilities. He posits that \"truth\" (al-haqq) here encompasses both doctrinal adherence to the Wilayah of the Ahl al-Bayt and active participation in establishing divine justice, noting that true faith cannot exist without recognition of the Imams’ ontological role as channels of grace (tawassul). The mutual exhortation to truth thus becomes a communal safeguard against deviation, intrinsically tied to the Imam’s living guidance. \n\nTabrisi’s *Majma al-Bayan* expands on \"patience\" (sabr) as fortitude in adhering to truth amid tribulation, a virtue repeatedly exemplified by the Ahl al-Bayt and their followers. He underscores that sabr in Shia theology is not passive endurance but active resistance to oppression (zulm), aligning with the Qur’anic command to \"enjoin good and forbid evil\" (3:104). This dual tawasau (exhortation) reflects the inseparable link between doctrinal truth and ethical steadfastness in Shia thought. \n\nBoth commentators stress that these conditions are interdependent: faith necessitates embodiment through deeds, which in turn require communal reinforcement. The verse’s structure thus mirrors the Shia understanding of religion as a holistic system (din) encompassing belief, practice, and social order under the Imam’s guardianship. Jurisprudentially, this informs the Shia emphasis on collective responsibility (fard kifaya) in upholding truth and justice, rooted in the Prophetic mandate preserved through the Imamate.",
    "layer3": "In Surah Al-Asr’s profound third verse, contemporary Shia scholars like Ayatollah Naser Makarim Shirazi emphasize its blueprint for holistic salvation: faith, action, communal truth-seeking, and collective resilience. This verse, often recited in Shia gatherings, transcends individual piety, framing spiritual success as a social project. Shirazi links *tawasaw bil-haqq* (urging one another toward truth) to resisting modern forms of oppression—a nod to the Shia legacy of confronting injustice, from Karbala to today’s struggles against authoritarianism and systemic inequality.  \n\nModern thinkers like Dr. Mohammad Ali Shomali connect the call to *sabr* (patience) with psychological resilience, citing studies on grit and post-traumatic growth. In an age of instant gratification and digital distraction, patience becomes revolutionary—a disciplined commitment to long-term justice, climate action, or ethical AI development. The verse’s emphasis on mutual exhortation (*tawasaw*) resonates with today’s crises: combating misinformation requires communities to anchor discourse in *haqq* (truth), while global challenges like pandemics demand solidarity across borders.  \n\nPhilosophically, the verse’s temporal urgency (“By Time!”) aligns with existential debates about human purpose. Neuroscientist Malik Badri’s work on Islamic psychology frames this *sabr*-truth dynamic as a buffer against nihilism, offering meaning through shared struggle. Interfaith parallels emerge: Buddhist “right effort,” Jewish *tikkun olam* (repairing the world), and Christian perseverance echo this ethos, inviting collaborative activism.  \n\nIn multicultural societies, the verse’s call becomes a bridge—urging diverse communities to unite around universal truths like human dignity and ecological stewardship. As cyber-capitalism erodes social bonds, Surah Al-Asr’s vision of interconnected moral agency offers a timeless yet urgently modern antidote.",
    "layer4": "In Surah Al-Asr, Allah swears by Time to reveal humanity’s universal loss, except those who embody four qualities: faith, righteous deeds, mutual counsel in truth, and mutual counsel in patience. The Ahlul Bayt (as) illuminate this verse as a roadmap for salvation through unwavering connection to Divine guidance. Imam Sadiq (as) states, *\"The ‘truth’ in this verse is Wilayah – love and loyalty to the Imams of guidance. The ‘patience’ is steadfastness in their obedience\"* (Tafsir al-Qummi). Here, belief is not abstract, but rooted in recognizing the Imamah as the manifest truth, while righteous deeds flow from this recognition.\n\nLady Fatimah (as) taught that true faith is a tree whose roots are the love of Ali (as) and whose branches are submission to Allah’s commands. To \"advise one another in truth\" thus becomes a communal duty to uphold the Wilayah of the Ahlul Bayt, as Imam Ali (as) declared, *\"We are the truth’s pillars and its decisive proof\"* (Nahjul Balagha). Mutual counsel in patience reflects the Shia ethos of enduring trials through remembrance of the sufferings of Hussain (as) and his companions, transforming hardship into a means of nearness to Allah.\n\nPractically, this verse calls believers to anchor their lives in the Imams’ teachings, fostering communities where reminders of truth and patience are shared. Imam Zainul Abideen (as) writes in Sahifa Sajjadiya, *\"Make my tongue a guide to Your path and my advice a mercy to Your servants,\"* teaching that spiritual growth occurs by embodying and propagating divine truths. To internalize this surah is to live as a witness of the Ahlul Bayt’s mission, turning every moment into an opportunity to affirm truth and embrace patience as acts of devotion.",
    "layer1_urdu": "ایک جامع میکن وحی ، سورہ الاسر ، ایک آفاقی سچائی فراہم کرتی ہے: تمام انسانیت کو روحانی نقصان کا سامنا کرنا پڑتا ہے سوائے ان لوگوں کے جو چار باہم وابستہ خصوصیات کو ظاہر کرتے ہیں۔ آیت 3 اس خدائی استثناء کی خاکہ پیش کرتا ہے ، اس بات پر زور دیتے ہوئے کہ نجات الگ تھلگ تقویٰ میں نہیں بلکہ سچائی اور لچک کے اجتماعی عزم میں ہے۔ ابتدائی مسلمان ، مکہ میں ظلم و ستم کا سامنا کرتے ہوئے ، ان الفاظ میں بقا کے لئے ایک روڈ میپ پایا: عقیدہ عمل ، فرقہ وارانہ یکجہتی ، اور آزمائشوں کے درمیان صبر کے ذریعہ مضبوط ہے۔  \n\nاصطلاح * تاواساؤ * (باہمی نصیحت) یہاں اہم ہے ، جو اجتماعی ذمہ داری پر اسلام کے زور کی عکاسی کرتی ہے۔ شیعہ تبصرے ، جیسے الامہ تبتابائی کے ذریعہ ، اس بات پر زور دیا گیا ہے کہ * الحق * دونوں الہی سچائیوں پر مشتمل ہے-جو قرآن مجید اور احل بیت and اور انصاف کی تعلیمات میں جڑا ہوا ہے ، جبکہ * سبر * مشکلات کے باوجود ان اصولوں پر عمل پیرا ہونے میں ثابت قدمی کی نشاندہی کرتا ہے۔ امام علی کی تعلیمات اکثر * صابر * کو فعال برداشت سے منسلک کرتی ہیں ، غیر فعال قبولیت نہیں ، مومنوں سے گزارش کرتی ہیں کہ وہ مشکلات میں بھی \"دل کو سچائی سے باندھ دیں\"۔  \n\nجدید سیاق و سباق میں ، یہ آیت مسلمانوں کو ان برادریوں کی پرورش کے لئے مطالبہ کرتی ہے جہاں ایمان اخلاقی عمل میں ترجمہ کرتا ہے ، جہاں افراد انصاف کو برقرار رکھنے میں ایک دوسرے کی سرگرمی سے حمایت کرتے ہیں ، اور جہاں صبر کو ظلم ، بے حسی یا اخلاقی سمجھوتہ کے خلاف متحرک مزاحمت کے طور پر استعمال کیا جاتا ہے۔ شیعہ مسلمانوں کے لئے ، یہ اشورہ کے اخلاق کے ساتھ گہرائی سے گونجتا ہے۔ عملی طور پر ، اس کا مطلب ماحولیات کو فروغ دینا ہے جہاں مذہبی تعلیم ، معاشرتی انصاف کے اقدامات ، اور جذباتی لچک فرقہ وارانہ ترجیحات ہیں۔ چاہے ایکویٹی کی وکالت کریں ، مشکلات کا سامنا کرنے والوں کی حمایت کریں ، یا ذاتی طرز عمل میں سالمیت کو برقرار رکھیں ، سورہ الاسر مومنوں کو یاد دلاتے ہیں کہ روحانی کامیابی ایک مشترکہ سفر ہے ، جو سچائی اور اجتماعی استقامت میں لنگر انداز ہے۔",
    "layer2_urdu": "سورہ الصر آیت 3 میں ، قرآن نے چار باہم مربوط شرائط کے ذریعہ عالمگیر انسانی نقصان سے نجات کے لئے واحد راستہ بیان کیا ہے: ایمان (ایمان) ، راستباز عمل (امل سالہ) ، سچائی کی باہمی نصیحت (تواساؤ بل-ہقق) ، اور صبر کی تزئین کی باہمی نصیحت۔ کلاسیکی شیعہ استثنیٰ ان عناصر پر زور دیتے ہیں کیونکہ انفرادی ذمہ داریوں اور اجتماعی لاتعلقی دونوں کو الہی رہنمائی کی آنٹولوجیکل ضرورت میں جڑا ہوا ہے۔ \n\nتبتابائی کا * المزان * آیت کی استثناء کی شق کی ترجمانی ایک عہد کے طور پر کرتا ہے جو وفاداروں کو متحرک روحانی اور معاشرتی ذمہ داریوں کا پابند کرتا ہے۔ انہوں نے کہا کہ یہاں \"سچائی\" (الحق) نے اے ایچ ایل ال بیت کے ولیاہ کی نظریاتی پابندی اور الہی انصاف کے قیام میں فعال شرکت پر محیط ہے ، یہ نوٹ کرتے ہوئے کہ حقیقی عقیدہ فضل کے چینلز (تواسول) کی حیثیت سے ائماموں کے اونٹولوجیکل کردار کی پہچان کے بغیر موجود نہیں ہوسکتا ہے۔ اس طرح سچائی کے ساتھ باہمی نصیحت انحراف کے خلاف فرقہ وارانہ حفاظت بن جاتی ہے ، جو امام کی رہنمائی سے منسلک ہے۔ \n\nتبریسی کا * مجاہ البیان * \"صبر\" (صابر) پر پھیلا ہوا ہے جس میں فتنہ کے درمیان سچائی پر عمل پیرا ہونے میں صبر کے طور پر ، اے ایچ ایل ال بیت اور ان کے پیروکاروں کی طرف سے بار بار مثال دی گئی ہے۔ انہوں نے اس بات کی نشاندہی کی کہ شیعہ الہیات میں صابر غیر فعال برداشت نہیں بلکہ جبر (زولم) کے خلاف فعال مزاحمت ہے ، جو قرآنی حکم کے ساتھ \"اچھ good ی اور برائی کو روکنے\" کے لئے صف بندی کرتا ہے (3: 104)۔ یہ دوہری تواساؤ (نصیحت) شیعہ سوچ میں نظریاتی سچائی اور اخلاقی ثابت قدمی کے مابین لازم و ملزوم روابط کی عکاسی کرتی ہے۔ \n\nدونوں مبصرین نے زور دے کر کہا کہ یہ حالات ایک دوسرے پر منحصر ہیں: عقیدے کو اعمال کے ذریعہ مجسمہ کی ضرورت ہوتی ہے ، جس کے نتیجے میں فرقہ وارانہ کمک کی ضرورت ہوتی ہے۔ اس طرح آیت کا ڈھانچہ مذہب کی شیعہ کو ایک جامع نظام (DIN) کے طور پر سمجھنے کی آئینہ دار ہے جس میں امام کی سرپرستی کے تحت عقیدہ ، عمل اور معاشرتی نظام شامل ہیں۔ فقہی طور پر ، اس سے شیعہ پر زور دیا گیا ہے کہ وہ حقیقت اور انصاف کو برقرار رکھنے میں اجتماعی ذمہ داری (فارڈ کیفیا) پر زور دیتے ہیں ، جس کی جڑ امامیٹ کے ذریعہ محفوظ پیشن گوئی کے مینڈیٹ میں ہے۔",
    "layer3_urdu": "سورہ السر کی گہری تیسری آیت میں ، آیت اللہ ناسر مکارم شیرازی جیسے ہم عصر شیعہ اسکالرز جامع نجات کے لئے اپنے نقشے پر زور دیتے ہیں: ایمان ، عمل ، فرقہ وارانہ سچائی کی تلاش ، اور اجتماعی لچک۔ یہ آیت ، جو اکثر شیعہ کے اجتماعات میں پڑھا جاتا ہے ، انفرادی تقویٰ سے ماورا ہوتا ہے ، جو روحانی کامیابی کو ایک معاشرتی منصوبے کے طور پر تیار کرتا ہے۔ شیرازی لنکس * تاواسو بل حقام * (ایک دوسرے کو سچائی کی طرف زور دینے) پر ظلم کی جدید شکلوں کا مقابلہ کرنے کے لئے۔-کربلا سے لے کر آج کی جدوجہد کے خلاف آج کی جدوجہد اور نظامی عدم مساوات کے خلاف ناانصافی کا سامنا کرنے کی شیعہ میراث کی منظوری ہے۔  \n\nڈاکٹر محمد علی شومالی جیسے جدید مفکرین * صابر * (صبر) کو نفسیاتی لچک کے ساتھ مربوط کرتے ہیں ، اور اس کے بعد کے تکلیف دہ نمو کے بارے میں مطالعات کا حوالہ دیتے ہیں۔ فوری تسکین اور ڈیجیٹل خلفشار کے دور میں ، صبر انقلابی بن جاتا ہے۔ باہمی نصیحت (*تاواساؤ*) پر آیت کا زور آج کے بحرانوں کے ساتھ گونجتا ہے: غلط معلومات کا مقابلہ کرنے کے لئے برادریوں کو*حق*(سچ) میں گفتگو کو لنگر انداز کرنے کی ضرورت ہوتی ہے ، جبکہ عالمی چیلنج جیسے وبائی امراض سرحدوں میں یکجہتی کا مطالبہ کرتے ہیں۔  \n\nفلسفیانہ طور پر ، آیت کی عارضی عجلت (\"وقت کے مطابق!\") انسانی مقصد کے بارے میں وجودی مباحثوں کے ساتھ ہم آہنگ ہے۔ اسلامی نفسیات پر نیورو سائنسدان ملک بدری کا کام اس *صابر *-متنازعہ متحرک کے خلاف بفر کے طور پر متحرک ، مشترکہ جدوجہد کے ذریعہ معنی پیش کرتا ہے۔ بین المذاہب متوازی ابھرتے ہیں: بدھ مت کی \"صحیح کوشش ،\" یہودی * ٹِکون اولم * (دنیا کی مرمت) ، اور عیسائی استقامت اس اخلاقیات کی بازگشت کرتے ہوئے باہمی تعاون کی سرگرمی کو مدعو کرتے ہیں۔  \n\nکثیر الثقافتی معاشروں میں ، آیت کی کال ایک پُل بن جاتی ہے - جس میں مختلف برادریوں کو انسانی وقار اور ماحولیاتی نگرانی جیسے عالمگیر سچائیوں کے گرد متحد کرنے کا موقع ملتا ہے۔ چونکہ سائبر کیپیٹل ازم معاشرتی بندھنوں کو ختم کرتا ہے ، باہم مربوط اخلاقی ایجنسی کے بارے میں سورہ الاسر کا وژن ایک لازوال لیکن فوری طور پر جدید تریاق پیش کرتا ہے۔",
    "layer4_urdu": "سورہ الاسر میں ، اللہ انسانیت کے عالمی نقصان کو ظاہر کرنے کے لئے وقت کے ساتھ قسم کھاتا ہے ، سوائے ان لوگوں کے جو چار خصوصیات کو مجسم بناتے ہیں: عقیدہ ، نیک اعمال ، حق میں باہمی مشورے ، اور صبر میں باہمی مشورے۔ اہل بیت (ع) الہی رہنمائی سے اٹل رابطے کے ذریعہ نجات کے لئے روڈ میپ کے طور پر اس آیت کو روشن کرتا ہے۔ امام صادق (ع) نے کہا ہے ، * اس آیت میں \"سچائی\" ولایہ ہے-رہنمائی کے اماموں سے محبت اور وفاداری۔ ’صبر‘ ان کی اطاعت میں ثابت قدمی ہے \" * (طافسیر القومی)۔ یہاں ، عقیدہ خلاصہ نہیں ہے ، بلکہ امامہ کو ظاہر سچائی کے طور پر پہچاننے میں جڑا ہوا ہے ، جبکہ نیک اعمال اس پہچان سے بہتے ہیں۔\n\nلیڈی فاطمہ (ع) نے سکھایا کہ سچا عقیدہ ایک درخت ہے جس کی جڑیں علی (ع) کی محبت ہیں اور جن کی شاخیں اللہ کے احکامات کے تابع ہیں۔ \"ایک دوسرے کو سچائی سے مشورہ دینا\" اس طرح اہل بیت کے ولیہ کو برقرار رکھنے کے لئے فرقہ وارانہ فرض بن جاتا ہے ، جیسا کہ امام علی (ع) نے اعلان کیا ، * \"ہم سچائی کے ستون اور اس کے فیصلہ کن ثبوت ہیں\" * (ناہجول بالاگھا)۔ صبر میں باہمی مشورے حسین (ع) اور اس کے ساتھیوں کی تکلیفوں کی یاد کے ذریعہ پائیدار آزمائشوں کے شیعہ اخلاق کی عکاسی کرتے ہیں ، اور مشکلات کو اللہ کے ساتھ قربت کے ایک ذریعہ میں تبدیل کرتے ہیں۔\n\nعملی طور پر ، یہ آیت مومنوں کو اماموں کی تعلیمات میں اپنی زندگیوں کو لنگر انداز کرنے کا مطالبہ کرتی ہے ، اور معاشروں کو فروغ دیتی ہے جہاں سچائی اور صبر کی یاد دہانیوں کا اشتراک کیا جاتا ہے۔ امام زینول ابیڈن (ع) ساہفا سججدیہ میں لکھتے ہیں ، * \"میری زبان کو اپنے راستے اور میرے مشوروں کو اپنے نوکروں کے لئے ایک رہنمائی بنائیں ،\" * یہ تعلیم دینا کہ روحانی نشوونما الہی سچائیوں کو مجسم اور پھیلانے سے ہوتی ہے۔ اس کو اندرونی بنانے کے لئے اہل بیت کے مشن کے گواہ کے طور پر زندگی گزارنا ہے ، اور ہر لمحے کو سچائی کی تصدیق کرنے اور صبر کو اپنانے کے عمل کے طور پر قبول کرنے کے موقع میں بدل جاتا ہے۔",
    "layer5": "Scholarly interpretations of Surah Al-Asr:3 across Shia and Sunni traditions converge on its universal ethical message while diverging in theological emphasis. Both schools agree the verse establishes four interconnected pillars for spiritual success: faith (īmān), righteous action (ʿamal ṣāliḥ), collective enjoining of truth (tawāṣū bi’l-ḥaqq), and mutual encouragement of patience (tawāṣū bi’l-ṣabr). Al-Tabari (Sunni) and Al-Tabrisi (Shia) both stress these elements as essential safeguards against humanity’s inherent loss, framing them as communal obligations transcending individual piety.  \n\nKey differences emerge in defining “truth” (ḥaqq) and the mechanisms for upholding it. Shia exegetes like Al-Tabātabāʾī in *Al-Mīzān* and Al-Qummī contextualize ḥaqq as adherence to divine guidance through the Imams, interpreting the verse as an implicit call to follow the Ahl al-Bayt’s teachings. Al-Ṭūsī’s *Al-Tibyān* links “advising to truth” to preserving the wilayah (guardianship) of the Imams. Sunni commentators, while affirming the necessity of truth, frame it more broadly. Al-Qurṭubī emphasizes adherence to Qur’an and Sunnah, while Al-Rāzī’s *Mafātīḥ al-Ghayb* associates ḥaqq with doctrinal and legal truths validated through communal consensus (ijmāʿ).  \n\nThese distinctions reflect deeper theological frameworks: Shia interpretations prioritize divinely ordained leadership, whereas Sunni readings emphasize collective scholarly and communal responsibility. Practically, this influences Shia emphasis on religious guidance through marjaʿiyya (scholarly authority) and Sunni focus on individual scholars within a broader ummatic framework.  \n\nHistorically, these divergences stem from early debates over religious authority post-Prophet Muhammad. Shia tafsir developed within a paradigm of inherited spiritual authority, while Sunni exegesis evolved alongside the consolidation of juristic schools and caliphal governance. Despite these differences, both traditions unite in viewing the verse as a timeless ethical mandate, underscoring the interdependence of faith, action, and communal solidarity.",
    "layer5_urdu": "سورت الاسر کی علمی تشریحات: 3 شیعہ اور سنی روایات میں 3 مذہبی زور سے ہٹتے ہوئے اس کے عالمگیر اخلاقی پیغام پر ایک دوسرے کے ساتھ مل جاتے ہیں۔ دونوں اسکول اس بات پر متفق ہیں کہ روحانی کامیابی کے لئے چار باہم مربوط ستونوں کو قائم کیا گیا ہے: ایمان (امان) ، راستباز عمل (عمال الی ḥ) ، سچائی کا اجتماعی انجویننگ (تاؤ ā ū bi bi’l-ḥaqq) ، اور ہم آہنگی کی باہمی حوصلہ افزائی (طوا ū بائیل-ṣabr)۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں ہی ان عناصر کو انسانیت کے موروثی نقصان کے خلاف ضروری حفاظتی اقدامات کے طور پر زور دیتے ہیں ، اور انفرادی تقویٰ کو عبور کرتے ہوئے فرقہ وارانہ ذمہ داریوں کے طور پر ان کو تشکیل دیتے ہیں۔  \n\nکلیدی اختلافات \"سچائی\" (اق کیو) کی وضاحت اور اس کو برقرار رکھنے کے طریقہ کار کی وضاحت میں ابھرتے ہیں۔ شیعہ * العمزان * اور القوم ī میں العبطاب ī ی کی طرح استقامت کو عق کو اماموں کے ذریعہ خدائی رہنمائی کی پابندی کے طور پر سیاق و سباق سے دوچار کرتے ہیں ، آیت کو AHL Albyt کی تعلیمات پر عمل کرنے کے لئے ایک مضمر کال کے طور پر تشریح کرتے ہیں۔ السیس کا * التبیان * اماموں کے ولیہ (سرپرستی) کو محفوظ رکھنے کے لئے \"سچائی کو مشورہ دینے\" کے لن کرتا ہے۔ سنی مبصرین ، سچائی کی ضرورت کی تصدیق کرتے ہوئے ، اسے زیادہ وسیع پیمانے پر مرتب کرتے ہیں۔ القوروب ī نے قرآن اور سنت کی پابندی پر زور دیا ہے ، جبکہ الریز کا * مافت الغیب * اعق کو نظریاتی اور قانونی سچائیوں کے ساتھ وابستہ کرتا ہے جو فرقہ وارانہ اتفاق رائے (IJMāʿ) کے ذریعے توثیق کیا جاتا ہے۔  \n\nیہ امتیازات گہرے مذہبی فریم ورک کی عکاسی کرتے ہیں: شیعہ تشریحات الہی مقررہ قیادت کو ترجیح دیتے ہیں ، جبکہ سنی ریڈنگ اجتماعی علمی اور فرقہ وارانہ ذمہ داری پر زور دیتے ہیں۔ عملی طور پر ، اس سے مارجیہ (علمی اتھارٹی) کے ذریعہ مذہبی رہنمائی پر شیعہ پر زور دینے اور سنی ایک وسیع تر عمومیٹک فریم ورک کے اندر انفرادی اسکالرز پر توجہ مرکوز کرتے ہیں۔  \n\nتاریخی طور پر ، یہ فرق مذہبی اتھارٹی کے بعد کے پروفیٹ محمد کے بارے میں ابتدائی مباحثوں سے ہوتا ہے۔ شیعہ طفس نے وراثت میں روحانی اتھارٹی کے ایک نمونہ میں ترقی کی ، جبکہ فقیہ اسکولوں اور خلافت گورننس کے استحکام کے ساتھ ساتھ سنی کی منظوری بھی تیار ہوئی۔ ان اختلافات کے باوجود ، دونوں روایات آیت کو ایک لازوال اخلاقی مینڈیٹ کے طور پر دیکھنے میں متحد ہوجاتی ہیں ، اور ایمان ، عمل اور فرقہ وارانہ یکجہتی کے باہمی انحصار کی نشاندہی کرتی ہیں۔",
    "layer2short": "In Surah Al-Asr verse 3, the Qur’an delineates the sole path to salvation from universal human loss through four interconnected conditions: faith (iman), righteous action (amal salih), mutual exhortation to truth (tawasau bil-haqq), and mutual exhortation to patience (tawasau bis-sabr). Classical Shia exegetes emphasize these elements as both individual obligations and collective imperatives rooted in the ontological necessity of divine guidance. ",
    "layer2short_urdu": "سورہ الصر آیت 3 میں ، قرآن نے چار باہم مربوط شرائط کے ذریعہ عالمگیر انسانی نقصان سے نجات کے لئے واحد راستہ بیان کیا ہے: ایمان (ایمان) ، راستباز عمل (امل سالہ) ، سچائی کی باہمی نصیحت (تواساؤ بل-ہقق) ، اور صبر کی تزئین کی باہمی نصیحت۔ کلاسیکی شیعہ استثنیٰ ان عناصر پر زور دیتے ہیں کیونکہ انفرادی ذمہ داریوں اور اجتماعی لاتعلقی دونوں کو الہی رہنمائی کی آنٹولوجیکل ضرورت میں جڑا ہوا ہے۔ "
  }
}