{
  "1": {
    "layer1": "The opening verse of Surah An-Naas, *“Qul a’udhu bi rabbin nas”* (Say, “I seek refuge in the Lord of mankind”), establishes a profound connection between the believer and Allah’s all-encompassing protection. The command to “say” emphasizes active declaration, urging Muslims to vocalize their reliance on Allah as the ultimate sustainer (*Rabb*) of humanity. The term *Rabb* signifies not just creation but ongoing care, sovereignty, and nurturing—a theme central to Shia thought, which highlights Allah’s intimate involvement in human affairs. *Nas* (mankind) underscores universality, affirming that Allah’s lordship transcends all boundaries, uniting humanity under His mercy.  \n\nHistorical accounts, including those narrated by Imam Jafar al-Sadiq, link this surah’s revelation to the Prophet Muhammad’s experience with harmful magic, illustrating its role in seeking divine refuge from both visible and hidden harms. The verse, revealed alongside Surah al-Falaq, became a spiritual shield against evil forces, reflecting the Quran’s holistic approach to safeguarding believers’ physical and spiritual well-being.  \n\nIn contemporary life, this verse invites Muslims to consciously turn to Allah amid modern challenges—be it moral corruption, anxiety, or societal pressures. Reciting it daily, as taught by the Ahlul Bayt, reinforces *tawakkul* (trust in Allah) and serves as a reminder that true security lies in divine guardianship, not material means. By internalizing *“a’udhu bi rabbin nas,”* believers cultivate resilience, recognizing that Allah’s protection extends to all aspects of life, from personal struggles to global crises. It is a timeless call to anchor one’s heart in the Rabb who nurtures, guides, and shields His creation with unwavering compassion.",
    "layer2": "In classical Shia exegesis, Surah An-Naas 1 (\"Say, I seek refuge in the Lord of mankind\") is understood as a profound affirmation of *tawhid al-rububiyya* (Oneness of Divine Lordship) and a rejection of all false sources of protection. Tabatabai in *Al-Mizan* emphasizes that the term *Rabb al-Nas* (Lord of mankind) establishes Allah’s absolute sovereignty over human affairs, negating any independent power attributed to created beings or forces. The imperative \"Say\" (Qul) directs believers to vocalize this reliance, reinforcing the Prophet’s role as the conduit of divine guidance and the necessity of actively seeking Allah’s guardianship against both manifest and hidden harms.\n\nTabrisi’s *Majma al-Bayan* highlights the layered meaning of *isti'adha* (seeking refuge): it is both a spiritual shield against external evils and an internal purification from doubts and misguidance. Shia commentators often link this to the concept of *wilaya* (divinely ordained guardianship), arguing that true protection lies in aligning with the *Ahl al-Bayt*, the purified successors of the Prophet, who embody divine guidance. Imam Jafar al-Sadiq, as cited in classical sources, taught that reciting this surah dismantles the illusions of Satan by anchoring the heart in Allah’s lordship.\n\nTheologically, the verse underscores the Shia principle that human vulnerability necessitates dependence on Allah alone, rejecting intermediaries who claim autonomous power. Jurisprudentially, this aligns with the Shia emphasis on *niyya* (intention) in acts of worship: seeking refuge must be directed solely to Allah, void of shirk (associating partners with Him). The verse thus serves as both a doctrinal cornerstone and a practical invocation, integrating creed (*aqida*) and spiritual practice (*amal*) in the believer’s life.",
    "layer3": "In contemporary Shia scholarship, Surah An-Naas (114:1) is often interpreted as a profound call to recognize both the universality of divine protection and the shared vulnerability of humanity. Scholars like Ayatollah Nasir Makarem Shirazi emphasize that seeking refuge in *Rabb al-Nas* (Lord of Mankind) transcends sectarian or cultural boundaries, anchoring believers in a divine sovereignty that unites all people. This verse, he notes, challenges modern individualism by reframing security not as a product of material power but as a spiritual connection to a higher, inclusive authority.  \n\nModern thinkers, such as Dr. Liyakat Takim, link this verse to psychological resilience in an age of anxiety. Neuroscientific studies on prayer and meditation suggest that rituals of seeking refuge can reduce stress by fostering a sense of surrender to a transcendent \"secure base.\" Philosophically, the verse critiques systems of oppression—colonialism, racism, or economic exploitation—by affirming that true authority belongs only to the Creator, not to human hierarchies.  \n\nIn today’s polarized world, the verse’s emphasis on *al-Nas* (mankind) resonates with interfaith and multicultural solidarity. Scholars like Sayyid Ammar Nakshawani highlight its relevance to global crises—climate change, pandemics, and displacement—where collective human vulnerability demands cooperation beyond borders. The verse also subtly critiques nationalism, urging believers to see divine lordship as a unifying force against divisive ideologies.  \n\nBy framing divine refuge as both a spiritual practice and a social ethic, contemporary Shia scholarship bridges ancient wisdom with modern struggles, inviting humanity to seek solutions rooted in humility, unity, and transcendent purpose.",
    "layer4": "In the luminous verse *\"Say, I seek refuge in the Lord of mankind\"* (114:1), the Ahlul Bayt (as) unveil profound layers of spiritual protection and divine connection. Imam Ali (as) taught that *\"seeking refuge in Allah is the fortress of the mindful\"* (Ghurar al-Hikam), emphasizing that true sanctuary lies in recognizing Allah’s absolute sovereignty over all creation. The term *\"Rabb al-Nas\"* (Lord of mankind) is not merely a title but a call to awaken the heart to Allah’s all-encompassing guardianship, which transcends worldly dependencies.  \n\nImam Jafar al-Sadiq (as) explained that this verse is a weapon against the *\"hidden whisperer\"* (Satan), whose influence is weakened when one consciously affirms Allah’s Lordship. Lady Fatimah (as) exemplified this in her supplications, grounding her reliance solely in Allah’s mercy, stating, *\"My refuge is my Lord, my fortress, and my shield\"* (Bihar al-Anwar). The Shia tradition teaches that seeking refuge in Allah is inseparable from adherence to the *Wilayah* (divinely ordained authority) of the Ahlul Bayt (as), who are the living embodiment of Allah’s guidance. Their teachings act as a spiritual compass, shielding believers from misguidance.  \n\nPractically, this verse invites believers to internalize *tawakkul* (trust in Allah) by aligning their intentions and actions with divine will. Reciting this surah with awareness of its deeper meaning—affirming Allah’s Lordship while holding fast to the rope of the Ahlul Bayt (as)—purifies the soul from arrogance and worldly attachments. Imam Ali Zain al-Abidin (as) advised in the *Sahifa Sajjadiyya* to *\"seek refuge in Allah from the evils of the soul,\"* reminding us that spiritual protection begins with self-accountability and devotion to the path of the Ma’sumin (infallibles). Thus, this verse is both a shield and a roadmap to nearness to the Divine.",
    "layer1_urdu": "سورہ ان ناس کی افتتاحی آیت ، * \"Qul a’udhu bi رابن ناس\" * (کہتے ہیں ، \"میں بنی نوع انسان کے مالک میں پناہ مانگتا ہوں\") ، مومن اور اللہ کے تمام تحفظات کے مابین گہرا تعلق قائم کرتا ہے۔ \"کہنے\" کا حکم فعال اعلامیے پر زور دیتا ہے ، اور مسلمانوں پر زور دیتا ہے کہ وہ انسانیت کے حتمی استحکام (*رب*) کے طور پر اللہ پر انحصار کریں۔ اصطلاح * رب * نہ صرف تخلیق بلکہ جاری نگہداشت ، خودمختاری اور پرورش کی نشاندہی کرتی ہے۔ یہ ایک مرکزی خیال شیعہ سوچ کا مرکزی خیال ہے ، جو انسانی امور میں اللہ کی گہری شمولیت کو اجاگر کرتا ہے۔ * ناس* (بنی نوع انسان) عالمگیریت کی نشاندہی کرتے ہیں ، اور اس بات کی تصدیق کرتے ہیں کہ اللہ کی لارڈشپ تمام حدود سے بالاتر ہے ، اور انسانیت کو اپنے رحم و کرم کے تحت متحد کرتی ہے۔  \n\nتاریخی اکاؤنٹس ، بشمول امام جعفر السادق کے بیان کردہ ، اس سورہ کے انکشاف کو حضرت محمد کے تجربے سے نقصان دہ جادو کے ساتھ جوڑتے ہیں ، جس میں مرئی اور پوشیدہ دونوں نقصانات سے خدائی پناہ کے حصول میں اس کے کردار کی وضاحت کی گئی ہے۔ یہ آیت ، سورہ الفالق کے ساتھ سامنے آنے والی ، برائی قوتوں کے خلاف روحانی ڈھال بن گئی ، جو مومنوں کی جسمانی اور روحانی تندرستی کی حفاظت کے لئے قرآن مجید کے جامع نقطہ نظر کی عکاسی کرتی ہے۔  \n\nعصری زندگی میں ، یہ آیت مسلمانوں کو جدید چیلنجوں کے درمیان شعوری طور پر اللہ کی طرف رجوع کرنے کی دعوت دیتی ہے - یعنی یہ اخلاقی بدعنوانی ، اضطراب یا معاشرتی دباؤ۔ اس کو روزانہ تلاوت کرنا ، جیسا کہ اہل بیت نے سکھایا ہے ، * توکوکول * (اللہ پر اعتماد) کو تقویت بخشتا ہے اور ایک یاد دہانی کے طور پر کام کرتا ہے کہ حقیقی سلامتی الہی سرپرستی میں ہے ، مادی مطلب کا نہیں۔ * \"a’udhu bi رابن ناس\" کو اندرونی بنا کر ، مومنین لچک پیدا کرتے ہیں ، اور یہ تسلیم کرتے ہیں کہ اللہ کا تحفظ ذاتی جدوجہد سے لے کر عالمی بحرانوں تک زندگی کے تمام پہلوؤں تک پھیلا ہوا ہے۔ یہ رب میں کسی کے دل کو لنگر انداز کرنے کے لئے ایک بے وقت کال ہے جو اپنی تخلیق کو غیر متزلزل شفقت کے ساتھ پرورش ، رہنمائی اور ڈھال دیتا ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ ان ناس 1 (\"کہتے ہیں ، میں بنی نوع انسان میں پناہ مانگتا ہوں\") * توحید الربوبییا * (خدائی لارڈشپ کی وحدانیت) کی گہری تصدیق اور تحفظ کے تمام جھوٹے ذرائع کو مسترد کرنے کے طور پر سمجھا جاتا ہے۔ تبتابائی میں * العزان * نے اس بات پر زور دیا ہے کہ اصطلاح * رب النس * (بنی نوع انسان کے مالک) انسانی امور پر اللہ کی مطلق خودمختاری کو قائم کرتی ہے ، جس سے تخلیق شدہ مخلوقات یا قوتوں سے منسوب کسی بھی آزاد طاقت کی نفی ہوتی ہے۔ لازمی \"کہنا\" (QUL) مومنین کو ہدایت کرتا ہے کہ وہ اس انحصار کو آواز اٹھائے ، نبی کے کردار کو الہی رہنمائی کی حیثیت سے تقویت بخشتا ہے اور ظاہر اور پوشیدہ نقصانات دونوں کے خلاف اللہ کی سرپرستی کو فعال طور پر تلاش کرنے کی ضرورت ہے۔\n\nتبریسی کا * مجس البیان * * isti'adha * (پناہ کی تلاش میں) کے پرتوں کے معنی کو اجاگر کرتا ہے: یہ دونوں بیرونی برائیوں کے خلاف روحانی ڈھال ہے اور شکوک و شبہات اور غلط فہمیوں سے داخلی طہارت ہے۔ شیعہ مبصرین اکثر اس کو *ولیا *(خدائی طور پر مقرر کردہ سرپرستی) کے تصور سے جوڑتے ہیں ، اور یہ استدلال کرتے ہیں کہ حقیقی تحفظ نبی کے پاک جانشینوں ، جو الہی رہنمائی کو مجسم بناتا ہے ، کے پاکیزہ جانشین *Ahl Al Bayt *کے ساتھ صف بندی کرنے میں مضمر ہے۔ امام جعفر السادق ، جیسا کہ کلاسیکی ذرائع میں حوالہ دیا گیا ہے ، نے یہ سکھایا کہ اس سورہ کی تلاوت کرنے سے اللہ کے لارڈشپ میں دل کو لنگر انداز کرکے شیطان کے وہموں کو ختم کیا جاتا ہے۔\n\nمذہبی طور پر ، آیت شیعہ کے اصول کی نشاندہی کرتی ہے کہ انسانی کمزوری کو صرف اللہ پر انحصار کی ضرورت ہوتی ہے ، اور خود مختار طاقت کا دعوی کرنے والے بیچوانوں کو مسترد کرتے ہیں۔ فقہی طور پر ، یہ عبادت کے اعمال میں * نیایا * (ارادے) پر شیعہ زور دینے کے ساتھ ہم آہنگ ہے: پناہ کی تلاش کو مکمل طور پر اللہ کی طرف جانا چاہئے ، شرک (اس کے ساتھ شراکت داروں کو جوڑنے) کو باطل کرنا چاہئے۔ اس طرح یہ آیت مومن کی زندگی میں عقیدہ (*ایکیڈا*) اور روحانی مشق (*امل*) کو مربوط کرنے کے لئے ایک نظریاتی سنگ بنیاد اور عملی درخواست دونوں کے طور پر کام کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ ان ناس (114: 1) کو اکثر الہی تحفظ کی عالمگیریت اور انسانیت کی مشترکہ کمزوری دونوں کو تسلیم کرنے کے لئے گہری کال کے طور پر سمجھا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی جیسے اسکالرز اس بات پر زور دیتے ہیں کہ * رب النس * (انسانیت کے مالک) میں پناہ لینا فرقہ وارانہ یا ثقافتی حدود سے بالاتر ہے ، اور مومنین کو ایک الہی خودمختاری میں لنگر انداز کرتا ہے جو تمام لوگوں کو متحد کرتا ہے۔ اس آیت ، وہ نوٹ کرتا ہے ، سیکیورٹی کو مادی طاقت کی پیداوار کے طور پر نہیں بلکہ ایک اعلی ، جامع اتھارٹی سے روحانی تعلق کے طور پر سیکیورٹی کی بحالی کے ذریعہ جدید انفرادیت کو چیلنج کرتا ہے۔  \n\nجدید مفکرین ، جیسے ڈاکٹر لییاکات تکیم ، اس آیت کو اضطراب کے دور میں نفسیاتی لچک سے جوڑتے ہیں۔ نماز اور مراقبہ کے بارے میں اعصابی علمی مطالعات سے پتہ چلتا ہے کہ پناہ کی تلاش کی رسومات ایک ماورائی \"محفوظ اڈے\" کے حوالے کرنے کے احساس کو فروغ دے کر تناؤ کو کم کرسکتی ہیں۔ فلسفیانہ طور پر ، آیت میں ظلم و ستم ، نسل پرستی ، یا معاشی استحصال کے نظام پر تنقید کی گئی ہے - اس بات کی تصدیق کرتے ہوئے کہ حقیقی اتھارٹی صرف خالق سے ہے ، انسانی درجہ بندی سے نہیں۔  \n\nآج کی پولرائزڈ دنیا میں ، * الناس * (بنی نوع انسان) پر آیت کا زور بین المذاہب اور کثیر الثقافتی یکجہتی کے ساتھ گونجتا ہے۔ سید عمار نکشوانی جیسے اسکالرز عالمی بحرانوں سے اس کی مطابقت کو اجاگر کرتے ہیں۔ یہ آیت قوم پرستی پر بھی تنقید کرتی ہے ، اور مومنوں پر زور دیتی ہے کہ وہ الہی خداوند کو تفرقہ انگیز نظریات کے خلاف یکجہتی قوت کے طور پر دیکھیں۔  \n\nالہی پناہ گاہ کو روحانی رواج اور معاشرتی اخلاقیات دونوں کے طور پر تیار کرکے ، عصری شیعہ اسکالرشپ نے قدیم حکمت کے ساتھ قدیم حکمت کو پُر کیا ، انسانیت کو عاجزی ، اتحاد اور ماورائے مقصد سے جڑنے والے حل تلاش کرنے کی دعوت دی۔",
    "layer4_urdu": "برائٹ آیت * میں \"کہو ، میں بنی نوع انسان کے مالک میں پناہ مانگتا ہوں\" * (114: 1) ، اہل بیت (ع) روحانی تحفظ اور خدائی تعلق کی گہری پرتوں کی نقاب کشائی کرتا ہے۔ امام علی (ع) نے سکھایا کہ * \"اللہ میں پناہ لینا ذہن سازی کا قلعہ ہے\" * (گھورار الحکام) ، اس بات پر زور دیتے ہوئے کہ حقیقی حرمت تمام تخلیق پر اللہ کی مطلق خودمختاری کو تسلیم کرنے میں ہے۔ اصطلاح * \"رب النس\" * (انسانیت کا مالک) محض ایک لقب نہیں ہے بلکہ اللہ کی ہر طرف محیط سرپرستی کے لئے دل کو بیدار کرنے کی کال ہے ، جو دنیاوی انحصار سے بالاتر ہے۔  \n\nامام جعفر السادق (ع) نے وضاحت کی کہ یہ آیت * \"پوشیدہ سرگوشی\" * (شیطان) کے خلاف ایک ہتھیار ہے ، جس کا اثر و رسوخ کمزور ہوجاتا ہے جب کوئی شعوری طور پر اللہ کے لارڈشپ کی تصدیق کرتا ہے۔ لیڈی فاطمہ نے (ع) نے اپنی درخواستوں میں اس کی مثال دی ، اور صرف اللہ کی رحمت میں اس کی انحصار کو پیش کرتے ہوئے کہا ، \"میرا پناہ میرا رب ، میرا قلعہ ، اور میری ڈھال ہے\" * (بہار الانور)۔ شیعہ روایت یہ سکھاتی ہے کہ اللہ میں پناہ مانگنا اہل بیت (ع) کے * ولیہ * (خدائی طور پر مقرر اتھارٹی) پر عمل پیرا ہونے سے لازم و ملزوم ہے ، جو اللہ کی رہنمائی کا زندہ مجسمہ ہیں۔ ان کی تعلیمات روحانی کمپاس کی حیثیت سے کام کرتی ہیں ، مومنوں کو گمراہی سے بچاتی ہیں۔  \n\nعملی طور پر ، یہ آیت مومنین کو دعوت دیتی ہے کہ وہ اپنے ارادوں اور افعال کو الہی مرضی کے ساتھ سیدھ میں کرکے * توقکول * (اللہ پر اعتماد کریں) کو اندرونی بنائیں۔ اس سورہ کو اس کے گہرے معنی کے بارے میں شعور کے ساتھ تلاوت کرنا - اللہ کے لارڈشپ کی تصدیق کرتے ہوئے احلول بیت (ع) کی رسی کو تیز رفتار سے تھامتے ہوئے - تکبر اور دنیاوی منسلکات سے روح کی حمایت کرتا ہے۔ امام علی زین العبدین (ع) نے * ساہفا سججدیہ * میں * \"روح کی برائیوں سے اللہ کی پناہ لینے کا مشورہ دیا ،\" * ہمیں یاد دلاتے ہوئے کہ روحانی تحفظ خود محاسبیت اور عقیدت سے شروع ہوتا ہے جو میسومین (انفلیبلز) کی راہ پر گامزن ہوتا ہے۔ اس طرح ، یہ آیت ایک ڈھال اور الہی کے قریب ہونے کے لئے روڈ میپ دونوں ہے۔",
    "layer5": "In examining Surah An-Naas 114:1, both Shia and Sunni exegetical traditions converge on core theological principles while demonstrating nuanced interpretive emphases. All cited scholars—including Shia authorities like Tabatabai (Al-Mizan) and Sunni commentators such as Ibn Kathir—agree that the verse establishes Allah’s absolute sovereignty (rububiyyah) over humanity, necessitating reliance on Him for protection from spiritual and physical harm. Tabari (Jami al-Bayan) and Tabrisi (Majma al-Bayan) both contextualize the verse within the Quran’s broader theme of seeking divine refuge, particularly from hidden evils like Satanic whispers (waswas).  \n\nA key divergence emerges in metaphysical interpretations of divine guardianship. Shia scholars like Qummi (Tafsir al-Qummi) and Tabatabai emphasize the necessity of recognizing Allah’s lordship through the lens of wilayah (divine guardianship), implicitly connecting it to the spiritual authority of the Ahl al-Bayt as channels of divine protection. In contrast, Sunni exegetes such as Qurtubi (Al-Jami li-Ahkam) and Razi (Mafatih al-Ghayb) focus on Allah’s direct, unmediated relationship with creation, stressing His attributes of mercy (rahmaniyyah) and oneness (tawhid) without referencing intermediary spiritual hierarchies.  \n\nThese differences stem from distinct theological frameworks: Shia tafsir often integrates Imamah doctrines into Quranic hermeneutics, while Sunni interpretations prioritize Allah’s transcendence and accessibility to all believers. Practically, this influences devotional practices, with some Shia supplications incorporating appeals for intercession through the Prophet’s household, whereas Sunni traditions emphasize direct invocation. Historically, these variations reflect early Islamic debates over religious authority post-Prophet Muhammad, crystallized in later scholastic traditions without negating shared reverence for the verse’s core message. Both traditions ultimately affirm the verse’s universal call to divine reliance, demonstrating complementary approaches to Quranic exegesis.",
    "layer5_urdu": "سورہ ان ناس 114: 1 کی جانچ پڑتال کرتے ہوئے ، شیعہ اور سنی دونوں ہی روایات بنیادی مذہبی اصولوں پر ایک دوسرے کے ساتھ مل جاتی ہیں جبکہ متناسب تشریحی زوروں کا مظاہرہ کرتے ہیں۔ سبھی کے تمام اسکالرز ، بشمول شیعہ حکام جیسے تبتابائی (العزان) اور ابن کتر جیسے سنی مبصرین-یہ کہ اس آیت سے انسانیت کے بارے میں اللہ کی مطلق خودمختاری (روبیئیہ) کو قائم کیا جاتا ہے ، جس سے روحانی اور جسمانی نقصان سے تحفظ کے لئے اس پر انحصار ہوتا ہے۔ تباری (جمی البیان) اور تبریسی (مجس البییان) دونوں ہی الہی پناہ کے حصول کے قرآن مجید کے وسیع تر موضوع کے اندر موجود آیت کو سیاق و سباق دیتے ہیں ، خاص طور پر شیطانی وسوسوں جیسے پوشیدہ برائیوں سے۔  \n\nخدائی سرپرستی کی استعاریاتی تشریحات میں ایک اہم موڑ ابھرتا ہے۔ قمی (طافسیر القمی) اور تبتابائی جیسے شیعہ اسکالرز ولیہ (خدائی سرپرستی) کے عینک کے ذریعہ اللہ کے لارڈشپ کو تسلیم کرنے کی ضرورت پر زور دیتے ہیں ، اور اسے واضح طور پر اہل البیت کے روحانی اختیار سے الہی تحفظ کے چینلز کے طور پر جوڑتے ہیں۔ اس کے برعکس ، سنی کی منظوری جیسے قربانی (الجامی لی احکم) اور رازی (مافاتیہ الغیب) اللہ کے تخلیق کے ساتھ براہ راست ، غیر متزلزل تعلقات پر توجہ مرکوز کرتے ہیں ، جس میں ثالثی روحانیتوں کا ذکر کیے بغیر ان کی رحمت (رحمانیہ) اور وحدانیت (طولہد) پر زور دیتے ہیں۔  \n\nیہ اختلافات الگ الگ تھیلوجیکل فریم ورک سے پیدا ہوتے ہیں: شیعہ طافسر اکثر امامہ کے عقائد کو قرآنی ہرمینیٹکس میں ضم کرتا ہے ، جبکہ سنی تشریحات اللہ کی حد سے تجاوز اور تمام مومنین تک رسائ کو ترجیح دیتی ہیں۔ عملی طور پر ، اس سے عقیدت مندانہ طریقوں کو متاثر کیا جاتا ہے ، جس میں کچھ شیعہ کی فراہمی نبی کے گھر والے کے ذریعہ شفاعت کے لئے اپیلوں کو شامل کرتی ہے ، جبکہ سنی روایات براہ راست درخواست پر زور دیتے ہیں۔ تاریخی طور پر ، یہ تغیرات مذہبی اتھارٹی کے بعد کے پروفیٹ محمد کے بارے میں ابتدائی اسلامی مباحثوں کی عکاسی کرتے ہیں ، جو آیت کے بنیادی پیغام کے لئے مشترکہ عقیدت کی نفی کیے بغیر بعد کی تعلیمی روایات میں کرسٹل بنائے جاتے ہیں۔ دونوں روایات بالآخر الہی انحصار کے لئے آیت کی آفاقی کال کی تصدیق کرتی ہیں ، اور قرآنی استثنیٰ کے تکمیلی نقطہ نظر کا مظاہرہ کرتی ہیں۔",
    "layer2short": "In classical Shia exegesis, Surah An-Naas 1 (\"Say, I seek refuge in the Lord of mankind\") is understood as a profound affirmation of *tawhid al-rububiyya* (Oneness of Divine Lordship) and a rejection of all false sources of protection. Tabatabai in *Al-Mizan* emphasizes that the term *Rabb al-Nas* (Lord of mankind) establishes Allah’s absolute sovereignty over human affairs, negating any independent power attributed to created beings or forces. The imperative \"Say\" (Qul) directs believers to vocalize this reliance, reinforcing the Prophet’s role as the conduit of divine guidance and the necessity of actively seeking Allah’s guardianship against both manifest and hidden harms.",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ ان ناس 1 (\"کہتے ہیں ، میں بنی نوع انسان میں پناہ مانگتا ہوں\") * توحید الربوبییا * (خدائی لارڈشپ کی وحدانیت) کی گہری تصدیق اور تحفظ کے تمام جھوٹے ذرائع کو مسترد کرنے کے طور پر سمجھا جاتا ہے۔ تبتابائی میں * العزان * نے اس بات پر زور دیا ہے کہ اصطلاح * رب النس * (بنی نوع انسان کے مالک) انسانی امور پر اللہ کی مطلق خودمختاری کو قائم کرتی ہے ، جس سے تخلیق شدہ مخلوقات یا قوتوں سے منسوب کسی بھی آزاد طاقت کی نفی ہوتی ہے۔ لازمی \"کہنا\" (QUL) مومنین کو ہدایت کرتا ہے کہ وہ اس انحصار کو آواز اٹھائے ، نبی کے کردار کو الہی رہنمائی کی حیثیت سے تقویت بخشتا ہے اور ظاہر اور پوشیدہ نقصانات دونوں کے خلاف اللہ کی سرپرستی کو فعال طور پر تلاش کرنے کی ضرورت ہے۔"
  },
  "2": {
    "layer1": "In Surah An-Naas (114:2), Allah is described as *Malik al-Nas*—the Sovereign of mankind. This verse, revealed in Mecca, emphasizes Allah’s absolute authority over all creation, countering the polytheistic beliefs prevalent in pre-Islamic Arabia, where people worshipped false deities and tribal leaders. The term *Malik* (Sovereign) signifies complete ownership and mastery, distinguishing Allah’s eternal, unchanging kingship from the temporary power of worldly rulers. While some Quranic recitations use *Maalik* (Master), Shia tafsir scholars like Allamah Tabatabai highlight that both terms affirm Allah’s ultimate control over human affairs, transcending material or political dominance. The word *al-Nas* (mankind) universalizes this message, reminding believers that no individual or system holds true authority except Allah.  \n\nHistorically, this surah was revealed as a spiritual shield against *waswas* (evil whispers), urging reliance on Allah’s protection. The Ahlul Bayt, particularly Imam Ali, stressed that recognizing Allah’s sovereignty dismantles illusions of human or supernatural power, fostering *tawakkul* (trust in God). In modern contexts, this verse calls Muslims to resist attributing undue influence to leaders, ideologies, or societal pressures. It challenges us to seek refuge in Allah’s wisdom amid moral confusion, corruption, or oppression, and to align our actions with divine justice rather than worldly hierarchies. By internalizing *Malik al-Nas*, believers cultivate humility, resilience against manipulation, and a commitment to ethical accountability—knowing Allah’s authority is the ultimate refuge and guide in every struggle.",
    "layer2": "In classical Shia exegesis, the second verse of Surah al-Naas, *\"Maliki al-nas\"* (\"The Sovereign of mankind\"), is interpreted as a profound affirmation of Allah’s absolute authority over creation, emphasizing both His ontological lordship (*rububiyya*) and His exclusive right to govern human affairs. Scholars such as Tabrisi in *Majma al-Bayan* note the variant recitation of *\"Malik\"* (King) and *\"Malik\"* (Master), reconciling both by asserting that Allah’s sovereignty encompasses both ownership (*milk*) and kingship (*mulk*). This duality underscores His transcendence beyond temporal power structures, a theme central to Shia theology, which rejects any illegitimate earthly authority (*taghut*) contrary to divine will.  \n\nAllamah Tabatabai, in *Al-Mizan*, elaborates that the verse’s placement within a surah seeking refuge from evil highlights Allah’s sovereign role as humanity’s ultimate protector. True sovereignty, he argues, is inseparable from divine guardianship (*wilaya*), a concept intrinsically tied to the Shia doctrine of Imamah. The Ahl al-Bayt, as divinely appointed guides, are understood as manifestations of Allah’s authority on earth, channeling His mercy and justice. Thus, recognizing Allah as *\"Maliki al-nas\"* necessitates acknowledging the Imam’s role as the custodian of spiritual and moral order, a principle rooted in Hadiths from Imam Jafar al-Sadiq emphasizing that divine sovereignty invalidates all false claims to power.  \n\nThis verse also reinforces the Shia theological framework linking *tawhid* (oneness of God) to socio-political ethics. By declaring Allah’s exclusive sovereignty, it negates human submission to tyrannical forces, aligning with Shia jurisprudence that obligates resistance to oppression and allegiance to divinely sanctioned leadership. Classical commentators universally stress that Allah’s kingship is eternal and unconditional, contrasting with the transient dominion of worldly rulers. In this context, the verse becomes both a doctrinal cornerstone and a call to align human systems with divine justice, reflecting the Shia vision of cosmic and societal harmony under Allah’s unchanging authority.",
    "layer3": "In contemporary Shia scholarship, Surah An-Naas 114:2—\"The Sovereign of mankind\"—is often framed as a profound reminder of divine authority amid modern crises of power and identity. Scholars like Ayatollah Naser Makarem Shirazi emphasize that Allah’s sovereignty transcends all human hierarchies, challenging systems of oppression, corruption, and materialism. In an era marked by authoritarianism, economic inequality, and environmental exploitation, this verse calls believers to recognize that true justice and stewardship derive from submission to God’s universal governance, not transient human ideologies. \n\nModern thinkers, such as Dr. Mohammad Ali Shomali, connect this sovereignty to the concept of *tawhid* (oneness), arguing that it unites humanity under a shared ethical framework. Philosophically, this resonates with interdisciplinary discussions on human rights and global citizenship, where the verse’s emphasis on divine lordship over *all* people counters xenophobia and nationalism. Scientifically, neuroscientific studies on moral decision-making and free will—such as those cited by researchers like Dr. Abdallah Rothman—align with the idea that human agency, while real, is ultimately accountable to a higher moral order. \n\nSocially, the verse speaks to challenges like AI ethics and climate change: if humans are merely \"caretakers\" under God’s sovereignty, technological and ecological decisions must prioritize collective well-being over profit. Interfaith dialogues, particularly with Abrahamic traditions, find common ground here—Jewish and Christian mysticism similarly stress divine kingship as a call to humility and service. In a fractured world, this verse becomes a bridge, urging multicultural cooperation rooted in shared spiritual sovereignty.",
    "layer4": "In the luminous verse \"Maliki-nas\" (The Sovereign of mankind), the Qur'an directs us to recognize Allah’s absolute authority over creation. The Ahlul Bayt (peace be upon them) unveil profound layers of this sovereignty, teaching that true spiritual sovereignty manifests through divine guidance embodied in the *Wilayah* (guardianship) of the purified Imams. Imam Ali (peace be upon him) states, *\"Allah is the King of all realms, but His authority is established through His chosen representatives on earth\"* (Bihar al-Anwar). This verse thus points to the inseparable link between Allah’s lordship and the Imamah’s divine mandate to guide humanity.  \n\nThe Sixth Imam, Ja’far al-Sadiq (peace be upon him), explains that *\"the ‘King of mankind’ is He who holds the keys to hearts, liberating them from the tyranny of desires and the whispers of Satan\"* (Tafsir al-Qummi). Here, sovereignty transcends political power, becoming a spiritual reality: only by submitting to Allah’s designated guides can one attain true freedom from the illusions of worldly and inner enemies. Lady Fatimah (peace be upon her) echoes this in her sermon: *\"Allah made His obedience the fortress of hearts—those who enter it are protected by the rope of His guardianship\"* (Bihar al-Anwar).  \n\nPractically, this verse calls believers to internalize the Imamah’s authority as a means of spiritual protection. Reciting Surah An-Naas with awareness of the Ahlul Bayt’s role as Allah’s vicegerents strengthens one’s connection to divine sovereignty. The Imams teach that acknowledging their Wilayah dismantles arrogance and aligns the soul with the ultimate Source of power. Daily, one must seek refuge in Allah *through* devotion to His proofs (the Imams), for they are the \"face\" of His mercy and the gatekeepers of His kingdom. To truly recognize \"Maliki-nas\" is to anchor the heart in loyalty to the Ahlul Bayt, transforming ritual into a living covenant with the Divine.",
    "layer1_urdu": "سورہ ان ناس (114: 2) میں ، اللہ کو *ملک الناس *کے طور پر بیان کیا گیا ہے۔ مکہ میں انکشاف کردہ یہ آیت ، تمام تخلیق پر اللہ کے مطلق اختیار پر زور دیتی ہے ، اور اسلام سے قبل عرب میں پائے جانے والے متعدد عقائد کا مقابلہ کرتی ہے ، جہاں لوگ جھوٹے دیوتاؤں اور قبائلی رہنماؤں کی پوجا کرتے تھے۔ اصطلاح * ملک * (خودمختار) مکمل ملکیت اور مہارت کی نشاندہی کرتی ہے ، جو اللہ کی ابدی ، غیر منظم بادشاہت کو دنیاوی حکمرانوں کی عارضی طاقت سے ممتاز کرتی ہے۔ اگرچہ کچھ قرآنی تلاوت * مالیک * (ماسٹر) کا استعمال کرتے ہیں ، الامہ تبتابائی جیسے شیعہ طافسر اسکالرز نے اس بات پر روشنی ڈالی ہے کہ دونوں اصطلاحات اللہ کے انسانی امور پر اللہ کے حتمی کنٹرول کی تصدیق کرتے ہیں ، مادی یا سیاسی غلبہ سے بالاتر ہیں۔ لفظ * الناس * (بنی نوع انسان) اس پیغام کو عالمگیر بناتا ہے ، اور مومنوں کو یاد دلاتا ہے کہ اللہ کے سوا کوئی فرد یا نظام صحیح اختیار نہیں رکھتا ہے۔  \n\nتاریخی طور پر ، اس سورہ کو * واسواس * (بری وسوسوں) کے خلاف روحانی ڈھال کے طور پر انکشاف کیا گیا تھا ، اور اللہ کے تحفظ پر انحصار کرنے پر زور دیا گیا تھا۔ اہل بیت ، خاص طور پر امام علی ، نے زور دے کر کہا کہ اللہ کی خودمختاری کو تسلیم کرنے سے انسانی یا مافوق الفطرت طاقت کے وہموں کو ختم کیا جاتا ہے ، جس سے * توقکول * (خدا پر اعتماد) کو فروغ ملتا ہے۔ جدید سیاق و سباق میں ، یہ آیت مسلمانوں کو رہنماؤں ، نظریات ، یا معاشرتی دباؤ کے لئے غیر مناسب اثر و رسوخ کے خلاف مزاحمت کرنے کا مطالبہ کرتی ہے۔ یہ ہمیں چیلنج کرتا ہے کہ اخلاقی الجھن ، بدعنوانی ، یا جبر کے درمیان اللہ کی دانشمندی میں پناہ حاصل کی جائے ، اور دنیاوی درجہ بندی کے بجائے اپنے اعمال کو خدائی انصاف کے ساتھ ہم آہنگ کیا جائے۔ *ملک النس *کو اندرونی بنا کر ، مومنین عاجزی ، ہیرا پھیری کے خلاف لچک ، اور اخلاقی احتساب کے عزم-اللہ کے اختیار کو جاننا ہر جدوجہد میں حتمی پناہ اور رہنمائی ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الناس کی دوسری آیت ،*\"مالکی النس\"*(\"انسانیت کا خودمختار\") ، اللہ کی تخلیق پر مطلق اختیار کی گہری تصدیق کے طور پر بیان کی گئی ہے ، جس میں ان کے اونٹولوجیکل لارڈشپ (*روبییا*) اور ان کے انسانی امور پر حکمرانی کے خصوصی حق پر زور دیا گیا ہے۔ *ماجما البیان*میں تبریسی جیسے اسکالرز*\"ملک\"*(بادشاہ) اور*\"ملک\"*(ماسٹر) کی مختلف قسم کی تلاوت کو نوٹ کرتے ہیں ، اور یہ کہتے ہوئے دونوں میں صلح کرتے ہوئے کہ اللہ کی خودمختاری دونوں ملکیت (*دودھ*) اور کنگشپ (*ملک*) کو شامل کرتی ہے۔ یہ دوہری اس کے عارضی طاقت کے ڈھانچے سے بالاتر ہے ، جو شیعہ الہیات کا مرکزی خیال ہے ، جو الہی مرضی کے برخلاف کسی بھی ناجائز زمینی اتھارٹی (*ٹیگوت*) کو مسترد کرتا ہے۔  \n\n*المزان *میں ، الامہ تبتابائی نے وضاحت کی ہے کہ برائی سے پناہ لینے والی ایک سورہ کے اندر آیت کی جگہ انسانیت کے حتمی محافظ کی حیثیت سے اللہ کے خودمختار کردار کو نمایاں کرتی ہے۔ ان کا کہنا ہے کہ سچ خودمختاری ، الہی سرپرستی (*ولیا*) سے لازم و ملزوم ہے ، یہ ایک تصور ہے جو اممہ کے شیعہ نظریے سے منسلک ہے۔ اے ایچ ایل البائٹ ، جیسا کہ الہامی طور پر مقرر کردہ رہنما ہیں ، کو زمین پر اللہ کے اختیارات کے اظہار کے طور پر سمجھا جاتا ہے ، اور اس کی رحمت اور انصاف کا سلسلہ جاری ہے۔ اس طرح ، اللہ کو * \"مالکی النس\" کے طور پر تسلیم کرنا * روحانی اور اخلاقی نظم کے متولی کی حیثیت سے امام کے کردار کو تسلیم کرنے کی ضرورت ہے ، یہ ایک اصول جس میں امام جعفر السادق سے تعلق رکھنے والے حدیث میں جڑا ہوا ہے اس بات پر زور دیا گیا ہے کہ الہی خودمختاری اقتدار کے تمام جھوٹے دعووں کو باطل کرتی ہے۔  \n\nیہ آیت شیعہ تھیلوجیکل فریم ورک کو بھی تقویت بخشتی ہے جو * توہد * (خدا کی وحدانیت) کو سماجی و سیاسی اخلاقیات سے جوڑتی ہے۔ اللہ کی خصوصی خودمختاری کا اعلان کرتے ہوئے ، یہ ظالم قوتوں کے لئے انسانی پیش کرنے کی نفی کرتا ہے ، شیعہ فقہ کے ساتھ صف بندی کرتے ہوئے جو ظلم کے خلاف مزاحمت اور الہی منظور شدہ قیادت کی بیعت کا پابند ہے۔ کلاسیکی مبصرین عالمی سطح پر اس بات پر زور دیتے ہیں کہ اللہ کی بادشاہت ابدی اور غیر مشروط ہے ، جو دنیاوی حکمرانوں کے عارضی غلبے سے متصادم ہے۔ اس تناظر میں ، یہ آیت ایک نظریاتی سنگ بنیاد بن جاتی ہے اور الہام کے انصاف کے ساتھ انسانی نظاموں کو سیدھ میں لانے کے لئے ایک کال بن جاتی ہے ، جو اللہ کے غیر متزلزل اتھارٹی کے تحت کائناتی اور معاشرتی ہم آہنگی کے شیعہ وژن کی عکاسی کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ ان ناس 114: 2— \"انسانیت کا خودمختار\"-جو اکثر طاقت اور شناخت کے جدید بحرانوں کے درمیان الہی اتھارٹی کی گہری یاد دہانی کے طور پر تیار کیا جاتا ہے۔ آیت اللہ نصر مکارم شیرازی جیسے اسکالرز اس بات پر زور دیتے ہیں کہ اللہ کی خودمختاری تمام انسانی درجہ بندی سے بالاتر ہے ، جس میں ظلم و ستم ، بدعنوانی اور مادیت کے چیلنجنگ نظام ہیں۔ آمریت پسندی ، معاشی عدم مساوات ، اور ماحولیاتی استحصال کے نشان زدہ دور میں ، یہ آیت مومنوں کو یہ تسلیم کرنے کا مطالبہ کرتی ہے کہ وہ اس حقیقی انصاف اور ذمہ داری کو خدا کی آفاقی حکمرانی کے تابع ہونے سے حاصل کریں ، نہ کہ عارضی انسانی نظریات۔ \n\nجدید مفکرین ، جیسے ڈاکٹر محمد علی شومالی ، اس خودمختاری کو * توہد * (وحدانیت) کے تصور سے مربوط کرتے ہیں ، اور یہ استدلال کرتے ہیں کہ یہ مشترکہ اخلاقی فریم ورک کے تحت انسانیت کو متحد کرتا ہے۔ فلسفیانہ طور پر ، یہ انسانی حقوق اور عالمی شہریت کے بارے میں بین الضابطہ گفتگو کے ساتھ گونجتا ہے ، جہاں آیت پر * تمام * لوگ زینوفوبیا اور قوم پرستی کا مقابلہ کرتے ہیں۔ سائنسی طور پر ، اخلاقی فیصلہ سازی اور آزاد مرضی کے بارے میں اعصابی علوم مطالعات-جیسا کہ ڈاکٹر عبد اللہ روتھ مین جیسے محققین نے حوالہ دیا ہے-اس خیال سے وابستہ ہیں کہ انسانی ایجنسی ، جبکہ حقیقی ہے ، بالآخر ایک اعلی اخلاقی حکم کے لئے جوابدہ ہے۔ \n\nمعاشرتی طور پر ، آیت AI اخلاقیات اور آب و ہوا کی تبدیلی جیسے چیلنجوں کی بات کرتی ہے: اگر انسان محض خدا کی خودمختاری کے تحت \"نگراں\" ہیں تو ، تکنیکی اور ماحولیاتی فیصلوں کو منافع سے زیادہ اجتماعی بہبود کو ترجیح دینی ہوگی۔ بین المذاہب مکالمے ، خاص طور پر ابراہیمک روایات کے ساتھ ، یہاں مشترکہ گراؤنڈ تلاش کرتے ہیں۔ ایک فریکچرڈ دنیا میں ، یہ آیت ایک پل بن جاتی ہے ، جس میں کثیر الثقافتی تعاون پر زور دیا جاتا ہے جس کی جڑ مشترکہ روحانی خودمختاری ہے۔",
    "layer4_urdu": "برائٹ آیت \"مالکی ناس\" (بنی نوع انسان کا خودمختار) میں ، قرآن ہمیں ہدایت کرتا ہے کہ وہ تخلیق پر اللہ کے مطلق اختیار کو تسلیم کرے۔ اہل بیت (ان پر امن ہے) اس خودمختاری کی گہری پرتوں کی نقاب کشائی کرتے ہوئے ، یہ تعلیم دیتے ہیں کہ حقیقی روحانی خودمختاری خالص اماموں کے * ولیہ * (سرپرستی) میں مجسم الہی رہنمائی کے ذریعے ظاہر ہوتی ہے۔ امام علی (اس پر امن ہے) کہتے ہیں ، * \"اللہ تمام دائروں کا بادشاہ ہے ، لیکن اس کا اختیار زمین پر اپنے منتخب نمائندوں کے ذریعہ قائم ہے\" * (بہار الانور)۔ اس طرح یہ آیت انسانیت کی رہنمائی کے لئے اللہ کے لارڈشپ اور امامہ کے الہی مینڈیٹ کے مابین لازم و ملزوم روابط کی طرف اشارہ کرتی ہے۔  \n\nچھٹا امام ، جافر السادق (اس پر امن ہے) ، وضاحت کرتا ہے کہ * \"انسانیت کا بادشاہ 'وہ ہے جو دلوں کی چابیاں پکڑتا ہے ، خواہشات کے ظلم اور شیطان کی وسوسوں سے آزاد کرتا ہے\" * (طفسیر القومی)۔ یہاں ، خودمختاری سیاسی طاقت سے بالاتر ہے ، جو ایک روحانی حقیقت بن جاتی ہے: صرف اللہ کے نامزد رہنماؤں کو جمع کرانے سے ہی دنیاوی اور اندرونی دشمنوں کے وہموں سے حقیقی آزادی حاصل ہوسکتی ہے۔ لیڈی فاطمہ (اس پر سلامتی ہے) اس کے خطبے میں اس کی بازگشت کرتے ہیں: * \"اللہ نے اپنی اطاعت کو دلوں کے قلعے پر مجبور کیا-جو اس میں داخل ہوتے ہیں وہ اس کی سرپرستی کی رسی سے محفوظ ہیں\" * (بہار الانور)۔  \n\nعملی طور پر ، یہ آیت مومنوں کو روحانی تحفظ کے ایک ذریعہ کے طور پر امامہ کے اختیار کو اندرونی بنانے کا مطالبہ کرتی ہے۔ اللہ کے وائسجرنٹس کے طور پر اہل بیت کے کردار کے بارے میں آگاہی کے ساتھ سورہ این ناس کی تلاوت کرنا الہی خودمختاری سے کسی کے تعلق کو تقویت بخشتا ہے۔ امام سکھاتے ہیں کہ ان کے ولیہ کو تسلیم کرنا تکبر کو ختم کرتا ہے اور روح کو طاقت کے حتمی ذریعہ کے ساتھ جوڑتا ہے۔ روزانہ ، کسی کو اپنے ثبوتوں (اماموں) کی * عقیدت کے ذریعے اللہ * میں پناہ لینا چاہئے ، کیونکہ وہ اس کی رحمت کا \"چہرہ\" اور اس کی بادشاہی کے دربان ہیں۔ \"مالکی ناس\" کو صحیح معنوں میں پہچاننا یہ ہے کہ اہل بیت کے ساتھ وفاداری میں دل کو لنگر انداز کرنا ہے ، اور رسم کو الہی کے ساتھ زندہ عہد میں تبدیل کرنا ہے۔",
    "layer5": "In interpreting Surah An-Naas 114:2 (\"The Sovereign of mankind\"), Shia and Sunni exegetes converge on core theological principles while diverging in nuanced emphases. Both traditions unanimously affirm Allah’s absolute sovereignty (rububiyya) over creation, as stressed by Shia scholars Tabatabai (Al-Mizan) and Sunni commentator Ibn Kathir, who frame \"Malik al-Nas\" as an assertion of divine kingship transcending all earthly power. Tabari’s Sunni tafsir and Shia authority Tusi (At-Tibyan) both contextualize the verse within the Quran’s thematic emphasis on seeking refuge in Allah’s ultimate authority against spiritual harm.  \n\nA key divergence arises in grammatical and theological emphasis. Shia sources like Tabrisi (Majma al-Bayan) and Qummi highlight the variant Qur’anic reading “Malik” (King) alongside “Maliki” (Sovereign), interpreting this as reinforcing Allah’s eternal kingship and the derived authority of divinely appointed guides (Imams). Sunni exegetes such as Qurtubi and Razi (Mafatih al-Ghayb) focus exclusively on “Maliki,” emphasizing Allah’s direct ownership (mulk) of creation without intermediary governance, aligning with Sunni theological resistance to perceived delegation of divine attributes.  \n\nThese distinctions reflect broader theological frameworks: Shia interpretations often integrate Imamology into cosmic governance narratives, while Sunni readings prioritize Allah’s unmediated lordship. Historically, such differences emerged from early debates about religious authority post-Prophet Muhammad, with Shia hermeneutics developing in dialogue with Imamati theology and Sunni exegesis crystallizing around caliphal-era scholastic norms.  \n\nBoth traditions agree the verse cultivates reliance on Allah, but their interpretive lenses shape distinct spiritual orientations—Shia perspectives may emphasize theophanic governance through purified leadership, while Sunni views reinforce direct divine accountability. These nuances remain scholarly rather than sectarian, rooted in complementary explorations of divine sovereignty’s multifaceted nature.",
    "layer5_urdu": "سورہ ان ناس 114: 2 (\"بنی نوع انسان کا خودمختار\") کی ترجمانی کرتے ہوئے ، شیعہ اور سنی نے بنیادی مذہبی اصولوں پر تبادلہ خیال کیا جبکہ متناسب زوروں میں مبتلا ہوتے ہیں۔ دونوں روایات متفقہ طور پر اللہ کی مطلق خودمختاری (روبیوبیا) کی تخلیق کے بارے میں تصدیق کرتی ہیں ، جیسا کہ شیعہ اسکالرز تبتابائی (المزان) اور سنی مبصرین ابن کتھیر نے زور دیا ہے ، جو \"ملک النس\" کو تمام زمینی طاقت سے عبور کرنے والے الہی بادشاہت کے ایک دعوے کے طور پر \"ملک النس\" تیار کرتے ہیں۔ تباری کی سنی طافسیر اور شیعہ اتھارٹی توسی (ات-تبیان) دونوں ہی روحانی نقصان کے خلاف اللہ کے حتمی اختیار میں پناہ حاصل کرنے پر قرآن مجید کے موضوعاتی زور کے اندر آیت کو سیاق و سباق دیتے ہیں۔  \n\nگرائمیکل اور تھیلوجیکل زور میں ایک اہم موڑ پیدا ہوتا ہے۔ تبریسی (مجمہ البیان) اور قمی کے ذریعہ شیعہ ذرائع نے \"مالکی\" (خودمختار) کے ساتھ ساتھ قرآنی پڑھنے والے \"ملک\" (بادشاہ) کو اجاگر کیا ہے ، اور اس کی ترجمانی اللہ کی ابدی بادشاہت اور الہی مقرر کردہ رہنماؤں کے اخذ کردہ اختیار کو تقویت بخش ہے۔ سنی کی منظوری جیسے قربانی اور رازی (مافاتیہ الغیب) خصوصی طور پر \"مالکی\" پر مرکوز ہیں ، جس میں اللہ کی حکمرانی کے بغیر اللہ کی تخلیق کی براہ راست ملکیت (MULK) پر زور دیا گیا ہے ، اور الہی صفات کے سمجھے ہوئے وفد کے لئے سنی مذہبی مزاحمت کے ساتھ صف بندی کرتے ہیں۔  \n\nیہ امتیازات وسیع تر مذہبی فریم ورک کی عکاسی کرتے ہیں: شیعہ تشریحات اکثر امامولوجی کو کائناتی حکمرانی کے بیانیے میں ضم کرتی ہیں ، جبکہ سنی ریڈنگ اللہ کی غیر منقسم لارڈشپ کو ترجیح دیتی ہے۔ تاریخی طور پر ، مذہبی اتھارٹی کے بعد کے حامی محمد کے بارے میں ابتدائی بحث و مباحثے سے اس طرح کے اختلافات سامنے آئے ، شیعہ ہرمینیٹکس اماماتی الہیات اور سنی کی اصلاح کے ساتھ بات چیت میں تیار ہو رہے ہیں جو خلیفہ کے دور کی تعلیمی اصولوں کے آس پاس کرسٹل ہیں۔  \n\nدونوں روایات اس سے متفق ہیں کہ آیت اللہ پر انحصار کرتی ہے ، لیکن ان کی تشریحی عینک الگ الگ روحانی رجحانات کی تشکیل کرتی ہے۔ یہ باریکیاں فرقہ وارانہ کی بجائے علمی رہتی ہیں ، جو الہی خودمختاری کی کثیر الجہتی نوعیت کی تکمیلی تفتیش میں شامل ہیں۔",
    "layer2short": "In classical Shia exegesis, the second verse of Surah al-Naas, *\"Maliki al-nas\"* (\"The Sovereign of mankind\"), is interpreted as a profound affirmation of Allah’s absolute authority over creation, emphasizing both His ontological lordship (*rububiyya*) and His exclusive right to govern human affairs. Scholars such as Tabrisi in *Majma al-Bayan* note the variant recitation of *\"Malik\"* (King) and *\"Malik\"* (Master), reconciling both by asserting that Allah’s sovereignty encompasses both ownership (*milk*) and kingship (*mulk*). This duality underscores His transcendence beyond temporal power structures, a theme central to Shia theology, which rejects any illegitimate earthly authority (*taghut*) contrary to divine will.  ",
    "layer2short_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الناس کی دوسری آیت ،*\"مالکی النس\"*(\"انسانیت کا خودمختار\") ، اللہ کی تخلیق پر مطلق اختیار کی گہری تصدیق کے طور پر بیان کی گئی ہے ، جس میں ان کے اونٹولوجیکل لارڈشپ (*روبییا*) اور ان کے انسانی امور پر حکمرانی کے خصوصی حق پر زور دیا گیا ہے۔ *ماجما البیان*میں تبریسی جیسے اسکالرز*\"ملک\"*(بادشاہ) اور*\"ملک\"*(ماسٹر) کی مختلف قسم کی تلاوت کو نوٹ کرتے ہیں ، اور یہ کہتے ہوئے دونوں میں صلح کرتے ہوئے کہ اللہ کی خودمختاری دونوں ملکیت (*دودھ*) اور کنگشپ (*ملک*) کو شامل کرتی ہے۔ یہ دوہری اس کے عارضی طاقت کے ڈھانچے سے بالاتر ہے ، جو شیعہ الہیات کا مرکزی خیال ہے ، جو الہی مرضی کے برخلاف کسی بھی ناجائز زمینی اتھارٹی (*ٹیگوت*) کو مسترد کرتا ہے۔  "
  },
  "3": {
    "layer1": "In Surah An-Naas (114:3), the phrase *Ilāhin-nās* (\"The God of mankind\") affirms Allah’s absolute sovereignty over all humanity. This verse, revealed alongside the entire surah in Mecca, emphasizes the universality of divine authority, countering the polytheistic beliefs prevalent in pre-Islamic Arabia. The Prophet Muhammad (peace upon him and his family) was instructed to seek refuge in Allah as the ultimate protector against both visible and hidden evils, including the whispers of *al-waswās al-khannās* (\"the retreating whisperer\") mentioned in later verses. Shia tafsir, as noted by scholars like Allamah Tabatabai in *Al-Mizan*, highlights that *Ilāh* here transcends mere \"deity\" — it denotes the sole source of worship, sustenance, and moral guidance, rejecting all false claimants to divinity. The term *an-nās* (\"mankind\") underscores Allah’s inclusive lordship, rejecting tribal or elitist divisions and affirming that His mercy and justice encompass all people.  \n\nHistorically, this surah is linked to incidents where the Prophet faced spiritual and physical threats, reinforcing the need for divine protection. For contemporary Muslims, this verse serves as a reminder to root one’s trust entirely in Allah amid modern challenges like materialism, moral confusion, or societal oppression. It calls believers to reject \"gods\" of greed, ego, or blind tradition, and to align their lives with Tawhid (oneness of God) in thought and action. Practically, this means seeking refuge in Allah through prayer, ethical choices, and reliance on His wisdom rather than transient solutions. By internalizing *Ilāhin-nās*, Muslims cultivate resilience against both external adversities and inner doubts, anchoring their identity in the Creator who unites humanity under His eternal truth.",
    "layer2": "In classical Shia exegesis, the phrase *Ilah al-Nas* (The God of mankind) in Surah al-Naas 114:3 is understood as a profound affirmation of *tawhid* (divine oneness) and Allah’s absolute sovereignty over all creation. Both Allama Tabatabai in *Al-Mizan* and Sheikh Tabrisi in *Majma al-Bayan* emphasize that this verse transcends mere acknowledgment of Allah’s lordship; it establishes His unique role as the sole object of worship (*ma‘bud*) and ultimate refuge for humanity. Tabrisi notes that the repetition of *al-Nas* (mankind) in the first three verses of the surah underscores Allah’s universal authority, rejecting any compartmentalization of divinity or limited jurisdictional claims over subsets of creation. This aligns with the Shia theological principle that Allah’s lordship is indivisible and all-encompassing, negating the validity of intermediaries who might falsely claim divine prerogatives.\n\nTabatabai elaborates that *Ilah al-Nas* implicitly affirms the necessity of divine guidance through the *Ahl al-Bayt* (the Prophet’s purified progeny), as true recognition of Allah’s lordship necessitates adherence to the designated channels of His wisdom. This ties the verse to the Shia doctrine of *wilayah* (divine guardianship), wherein the Imams, as Allah’s appointed guides, serve as the means through which humanity accesses divine mercy and protection from spiritual corruption. The verse thus becomes a theological foundation for the inseparable link between *tawhid* and the recognition of prophetic and Imamic authority in Shia thought. Classical commentators also connect this verse to the broader Quranic discourse on resisting *waswas* (evil whispers), as true reliance on Allah—the God of all mankind—disarms the psychological and spiritual vulnerabilities exploited by malevolent forces. In jurisprudence, this principle reinforces the Shia view that acts of worship must be directed solely to Allah, free from ostentation or compromise, reflecting the essence of *ikhlas* (sincerity) in faith.",
    "layer3": "In contemporary Shia scholarship, Surah An-Naas 114:3—\"The God of mankind\"—is often framed as a profound affirmation of divine universality and human equality. Scholars like Ayatollah Naser Makarem Shirazi emphasize that this verse dismantles hierarchies of spiritual access, asserting that Allah’s sovereignty transcends borders, cultures, and social strata. In a globalized world fractured by nationalism and identity politics, this verse challenges believers to recognize the inherent dignity of all people, regardless of ethnicity, creed, or socioeconomic status. Modern thinkers, such as Dr. Liyakat Takim, connect this to social justice imperatives, arguing that acknowledging Allah as \"Ilahin-nas\" necessitates active opposition to systemic oppression, from Islamophobia to economic inequality.  \n\nScientific insights into human interconnectedness—such as ecological studies showing our shared dependence on Earth’s ecosystems—resonate with this verse’s call for collective responsibility. Philosophers like Dr. Shabbir Akhtar note that the verse’s universality aligns with postmodern critiques of exclusivism, urging interfaith dialogue grounded in mutual respect. In an era of climate crises and pandemics, the verse’s emphasis on a unified divine authority underscores the urgency of global cooperation.  \n\nContemporary Shia scholars also highlight its relevance to multicultural societies, where the verse becomes a theological foundation for pluralism. As Ayatollah Mohammad Ali Shomali observes, recognizing Allah as the God *of all* compels Muslims to engage constructively with diverse communities, fostering solidarity against dehumanizing forces like xenophobia. This verse, then, is both a spiritual anchor and a call to action—a reminder that divinity transcends human divisions, inviting us to build bridges in a fractured world.",
    "layer4": "In the luminous verse \"Ilahin-nas\" (The God of mankind), the Ahlul Bayt (peace be upon them) unveil profound layers of divine unity (Tawhid) and the inseparable link between recognizing Allah’s sovereignty and embracing the spiritual guardianship (Wilayah) of His chosen guides. Imam Ali (peace be upon him) taught that Allah’s lordship over humanity is not merely a statement of power but a call to awaken the heart to its innate dependency on the One who nurtures all existence. The Sixth Imam, Jafar al-Sadiq (peace be upon him), explained in *Tafsir al-Qummi* that \"Ilahin-nas\" signifies Allah’s all-encompassing authority, which manifests through His mercy and justice, channeled to creation via the purified Imams—the \"proofs of God on Earth.\" \n\nThe Prophet Muhammad (peace be upon him and his family) emphasized that true recognition of Allah as \"Ilahin-nas\" requires aligning one’s soul with the divine will, a path illuminated by the Ahlul Bayt. Lady Fatimah (peace be upon her) stated in her renowned sermon: \"He made obedience to us the system for the community and our Wilayah a safeguard against division.\" This verse thus becomes a mirror reflecting the necessity of seeking refuge in Allah *through* the door of His representatives, as the Imams are the intermediaries of His protection and guidance. \n\nPractically, this demands cultivating *taqwa* (God-consciousness) by internalizing the Imamah’s role in spiritual development. Reciting this verse with reflection, coupled with seeking the intercession (tawassul) of the Ahlul Bayt, fortifies the soul against the \"whisperings of the hidden enemy\" (Surah 114:4–5). As Imam Zain al-Abidin (peace be upon him) prayed in *Sahifa Sajjadiyya*: \"O Allah, make me among those who turn to You in every state, clinging to the rope of Your guardians [the Imams].\" Thus, recognizing \"Ilahin-nas\" is both an affirmation of divine unity and a commitment to walk the path of the Chosen Ones.",
    "layer1_urdu": "سورہ ان ناس (114: 3) میں ، جملہ * الہین نیس * (\"انسانیت کا خدا\") تمام انسانیت پر اللہ کی مطلق خودمختاری کی تصدیق کرتا ہے۔ یہ آیت ، مکہ مکرمہ میں پوری سورہ کے ساتھ ساتھ انکشاف کی گئی ہے ، اس میں الہی اتھارٹی کی عالمگیریت پر زور دیا گیا ہے ، اور اسلام سے قبل عرب میں پائے جانے والے متعدد عقائد کا مقابلہ کیا گیا ہے۔ حضرت محمد صلی اللہ علیہ وآلہ وسلم (اس پر اور اس کے اہل خانہ پر امن) کو ہدایت کی گئی تھی کہ وہ اللہ تعالٰی اور چھپی ہوئی دونوں برائیوں کے خلاف حتمی محافظ کی حیثیت سے پناہ حاصل کریں ، جس میں * الواسواس الخنناس * (\"پیچھے ہٹتے ہوئے سرگوشی\") کی سرگوشیاں بھی شامل ہیں۔ شیعہ طافس ، جیسا کہ *المزان *میں الامہ تبتابائی جیسے اسکالرز نے بتایا ہے ، اس بات پر روشنی ڈالی گئی ہے کہ *الہ *یہاں محض \"دیوتا\" سے ماورا ہے-یہ عبادت ، رزق اور اخلاقی رہنمائی کے واحد ذریعہ کی نشاندہی کرتا ہے ، اور تمام جھوٹے دعویداروں کو الوہیت سے مسترد کرتا ہے۔ اصطلاح * an-nās * (\"بنی نوع انسان\") اللہ کے جامع لارڈشپ کی نشاندہی کرتی ہے ، قبائلی یا اشرافیہ کی تقسیم کو مسترد کرتی ہے اور اس بات کی تصدیق کرتی ہے کہ اس کی رحمت اور انصاف تمام لوگوں کو گھیرے ہوئے ہے۔  \n\nتاریخی طور پر ، یہ سورہ ان واقعات سے منسلک ہے جہاں نبی کو روحانی اور جسمانی خطرات کا سامنا کرنا پڑا ، جس سے خدائی تحفظ کی ضرورت کو تقویت ملی۔ عصری مسلمانوں کے لئے ، یہ آیت مادیت پسندی ، اخلاقی الجھن ، یا معاشرتی جبر جیسے جدید چیلنجوں کے درمیان اللہ پر مکمل طور پر کسی کے اعتماد کو جڑ سے اکھاڑنے کی یاد دہانی کا کام کرتی ہے۔ یہ مومنوں کو لالچ ، انا ، یا اندھی روایت سے \"دیوتاؤں\" کو مسترد کرنے اور ان کی زندگی کو تاؤد (خدا کی وحدانیت) کے ساتھ سوچ اور عمل میں مسترد کرنے کا مطالبہ کرتا ہے۔ عملی طور پر ، اس کا مطلب یہ ہے کہ نماز ، اخلاقی انتخاب ، اور عارضی حل کی بجائے اس کی دانشمندی پر انحصار کے ذریعے اللہ میں پناہ حاصل کرنا۔ *Ilāhin-nās *کو اندرونی بنا کر ، مسلمان بیرونی مشکلات اور اندرونی شکوک و شبہات دونوں کے خلاف لچک پیدا کرتے ہیں ، اور اپنی شناخت کو تخلیق کار میں لنگر انداز کرتے ہیں جو انسانیت کو اپنی ابدی سچائی کے تحت متحد کرتا ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الناس 114: 3 میں * اللہ الناس * (بنی نوع انسان کا دیوتا) جملہ * توہید * (خدائی وحدانیت) اور اللہ کی مطلق خودمختاری کے بارے میں سمجھا جاتا ہے۔ * المزان * اور شیخ تبریسی میں الامہ تبتابائی دونوں * ماجما البیان * میں اس بات پر زور دیتے ہیں کہ یہ آیت صرف اللہ کے لارڈشپ کے اعتراف سے ماورا ہے۔ یہ عبادت کے واحد مقصد (*ma'bud*) اور انسانیت کے لئے حتمی پناہ کے طور پر اپنا انوکھا کردار قائم کرتا ہے۔ تبریسی نے نوٹ کیا ہے کہ سورہ کی پہلی تین آیات میں * الناس * (بنی نوع انسان) کی تکرار اللہ کے عالمگیر اتھارٹی کی نشاندہی کرتی ہے ، اور تخلیق کے ذیلی ذخیروں پر الوہیت یا محدود دائرہ اختیار کے دعووں کو مسترد کرتے ہیں۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ اللہ کی لارڈشپ ناقابل تقسیم اور ہر طرف متضاد ہے ، اور بیچوانوں کی صداقت کی نفی کرتے ہیں جو الہی تعصبات کا جھوٹا دعویٰ کرسکتے ہیں۔\n\nتبتابائی نے وضاحت کی ہے کہ * اللہ الناس * * AHL ALBAYT * (نبی of کی پاکیزہ اولاد) کے ذریعہ الہی رہنمائی کی ضرورت کی واضح طور پر تصدیق کرتا ہے ، کیونکہ اللہ کے لارڈشپ کی حقیقی پہچان اس کی حکمت کے نامزد چینلز پر عمل پیرا ہونے کی ضرورت ہے۔ اس آیت کو * ولیہ * (الہی سرپرستی) کے شیعہ نظریے سے جوڑتا ہے ، جس میں اللہ کے مقرر کردہ رہنماؤں کے طور پر ، اماموں کے ذریعہ انسانیت الٰہی رحمت اور روحانی بدعنوانی سے تحفظ تک رسائی حاصل کرتی ہے۔ اس طرح آیت * توہید * کے مابین لازم و ملزوم روابط اور شیعہ کے خیال میں پیشن گوئی اور امامک اتھارٹی کی پہچان کے لئے ایک مذہبی بنیاد بن جاتی ہے۔ کلاسیکی مبصرین نے اس آیت کو * واسواس * (بری وسوسوں) کے خلاف مزاحمت کے بارے میں وسیع تر قرآنی گفتگو سے بھی مربوط کیا ہے ، کیونکہ اللہ پر حقیقی انحصار یعنی تمام انسانیت کا دیوتا ہے - بدصورت قوتوں کے ذریعہ استحصال کرنے والے نفسیاتی اور روحانی کمزوریوں کو ختم کرتا ہے۔ فقہ میں ، اس اصول سے شیعہ کے نظریہ کو تقویت ملتی ہے کہ عبادت کے کاموں کو صرف اللہ کی طرف جانا چاہئے ، جو عقیدے میں * اخلاس * (اخلاص) کے جوہر کی عکاسی کرتا ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ ان ناس 114: 3— \"انسانیت کا خدا\"-اکثر الہی عالمگیریت اور انسانی مساوات کی گہری تصدیق کے طور پر تیار کیا جاتا ہے۔ آیت اللہ نصر مکارم شیرازی جیسے اسکالرز اس بات پر زور دیتے ہیں کہ یہ آیت روحانی رسائی کے درجہ بندی کو ختم کرتی ہے ، اور یہ کہتے ہوئے کہ اللہ کی خودمختاری سرحدوں ، ثقافتوں اور معاشرتی طبقے سے ماورا ہے۔ قوم پرستی اور شناخت کی سیاست کے ذریعہ ٹوٹ پھوٹ کی ایک عالمگیر دنیا میں ، یہ آیت مومنین کو چیلنج کرتی ہے کہ وہ نسل ، مسلک یا معاشرتی معاشی حیثیت سے قطع نظر ، تمام لوگوں کے موروثی وقار کو تسلیم کریں۔ جدید مفکرین ، جیسے ڈاکٹر لییاکت تکیم ، اس کو معاشرتی انصاف کے لاتعلقی سے مربوط کرتے ہیں ، اور یہ استدلال کرتے ہیں کہ اللہ کو \"الہین ناس\" کے طور پر تسلیم کرنے کے لئے اسلاموفوبیا سے لے کر معاشی عدم مساوات تک نظامی جبر کی فعال مخالفت کی ضرورت ہے۔  \n\nانسانی باہمی ربط کے بارے میں سائنسی بصیرت - جیسے ماحولیاتی مطالعات جو زمین کے ماحولیاتی نظام پر ہمارے مشترکہ انحصار کو ظاہر کرتی ہیں۔ ڈاکٹر شبیر اختر جیسے فلسفیوں نے نوٹ کیا ہے کہ آیت کی عالمگیریت کے بعد کے جدید تنقیدوں کے ساتھ ہم آہنگی ہے ، جس میں باہمی احترام کی بنیاد پر بین المذاہب مکالمے پر زور دیا گیا ہے۔ آب و ہوا کے بحرانوں اور وبائی امراض کے دور میں ، آیت کا ایک متحد الہی اتھارٹی پر زور عالمی تعاون کی عجلت کی نشاندہی کرتا ہے۔  \n\nعصری شیعہ اسکالرز بھی کثیر الثقافتی معاشروں سے اس کی مطابقت کو اجاگر کرتے ہیں ، جہاں آیت کثیر ازم کی ایک مذہبی بنیاد بن جاتی ہے۔ جیسا کہ آیت اللہ محمد علی شومالی مشاہدہ کرتے ہیں ، اللہ کو تمام * کے خدا کے طور پر تسلیم کرتے ہیں * مسلمانوں کو متنوع برادریوں کے ساتھ تعمیری طور پر مشغول ہونے پر مجبور کرتے ہیں ، اور زینوفوبیا جیسی غیر مہذب قوتوں کے خلاف یکجہتی کو فروغ دیتے ہیں۔ اس کے بعد ، یہ آیت ایک روحانی اینکر اور ایکشن ٹو ایکشن دونوں ہے۔ یہ ایک یاد دہانی ہے کہ الوہیت انسانی ڈویژنوں سے بالاتر ہے ، جس سے ہمیں ایک فریکچر دنیا میں پل بنانے کی دعوت دی جاتی ہے۔",
    "layer4_urdu": "برائٹ آیت \"الہین ناس\" (بنی نوع انسان کے دیوتا) میں ، اہل بیت (ان پر امن ہے) الہی اتحاد کی گہری تہوں کی نقاب کشائی کرتے ہیں (طواد) اور اللہ کی خودمختاری کو تسلیم کرنے اور اپنے چوائن گائڈز کے روحانی سرپرستی (ویلیح) کو گلے لگانے کے مابین لازم و ملزوم روابط کی نقاب کشائی کرتے ہیں۔ امام علی (اس پر امن کریں) نے یہ سکھایا کہ اللہ کی انسانیت پر خداوند محض اقتدار کا بیان نہیں ہے بلکہ دل کو اس کے فطری انحصار کے لئے بیدار کرنے کی کال ہے جو تمام وجود کی پرورش کرتا ہے۔ چھٹا امام ، جعفر السادق (ان پر امن) ، نے * طافسیر القومی * میں سمجھایا کہ \"الہین ناس\" اللہ کی تمام تر اختیارات کی نشاندہی کرتا ہے ، جو اس کے رحم و کرم اور انصاف کے ذریعہ ظاہر ہوتا ہے ، جو زمین پر پاک اماموں کے ذریعہ تخلیق کو تبدیل کرتا ہے۔ \" \n\nحضرت محمد صلی اللہ علیہ وآلہ وسلم نے اس پر اور اس کے اہل خانہ پر امن قائم کیا) اللہ کی \"الہین ناس\" کے طور پر حقیقی طور پر پہچاننے کے لئے الہی مرضی کے ساتھ کسی کی روح کو سیدھ میں کرنے کی ضرورت ہے ، یہ راستہ اہل بیت کے ذریعہ روشن ہے۔ لیڈی فاطمہ (اس پر امن) نے اپنے مشہور خطبہ میں کہا: \"اس نے برادری اور ہمارے ولیہ کے لئے ڈویژن کے خلاف حفاظت کے لئے ہمارے لئے اطاعت کی۔\" اس طرح یہ آیت ایک آئینہ بن جاتی ہے جو اپنے نمائندوں کے دروازے * کے ذریعے اللہ * میں پناہ حاصل کرنے کی ضرورت کی عکاسی کرتی ہے ، کیونکہ امام اس کے تحفظ اور رہنمائی کے بیچوان ہیں۔ \n\nعملی طور پر ، یہ روحانی نشوونما میں امامہ کے کردار کو اندرونی بنا کر * تقوا * (خدا کے شعور) کی کاشت کرنے کا مطالبہ کرتا ہے۔ اس آیت کی عکاسی کے ساتھ تلاوت کرتے ہوئے ، اس کے ساتھ ساتھ اہل بیت کی شفاعت (تواسول) کی تلاش میں ، \"پوشیدہ دشمن کی سرگوشیوں\" کے خلاف روح کو مضبوط بناتا ہے (سورہ 114: 4–5)۔ جیسا کہ امام زین العبدین (اس پر امن ہے) نے *ساہفا سججدیہ *میں دعا کی تھی: \"اے اللہ ، مجھے ان لوگوں میں شامل کریں جو ہر ریاست میں آپ کی طرف رجوع کرتے ہیں ، اور آپ کے سرپرستوں [اماموں] کی رسی سے چمٹے ہوئے ہیں۔\" اس طرح ، \"الہین ناس\" کو تسلیم کرنا الہی اتحاد کی تصدیق اور منتخب کردہ افراد کی راہ پر چلنے کا عہد ہے۔",
    "layer5": "In interpreting Surah An-Naas 114:3 (\"The God of mankind\"), Shia and Sunni exegetes converge on core theological principles while diverging in nuanced emphases. Both traditions unanimously affirm Allah’s absolute sovereignty and exclusive divinity (tawhid), as emphasized by Ibn Kathir (Sunni) and Tabatabai (Shia), who cite the verse’s universal scope to negate polytheism and affirm divine unity. Al-Qurtubi (Sunni) and Al-Tabrisi (Shia) similarly highlight the linguistic force of \"Ilah\" (deity) as denoting Allah’s unique right to worship, transcending all earthly powers—a position rooted in shared Quranic ontology.\n\nKey differences emerge in framing divine authority. Shia commentaries like Tafsir al-Qummi and Al-Tibyan by Al-Tusi often contextualize Allah’s lordship within the framework of divinely appointed guidance, interpreting \"refuge\" in adjacent verses (114:1-2) as inseparable from seeking protection through the Ahl al-Bayt’s intercession. This reflects the Shia theological axiom of Imamah as an extension of divine providence. Conversely, Sunni authorities like Al-Tabari and Al-Razi emphasize direct divine sovereignty without intermediary, with Ibn Kathir explicitly rejecting any human mediation in worship—a stance aligning with Sunni emphasis on Allah’s unmediated relationship with creation.\n\nThese interpretations influence devotional practices: Shia tradition often integrates supplications to the Imams as channels of divine grace, while Sunni practice prioritizes direct invocation of Allah. Historically, these divergences stem from early theological debates about authority post-Prophet Muhammad, with Shia exegesis developing within frameworks prioritizing the Imams’ hermeneutical role, and Sunni scholarship crystallizing around caliphate-supported scholarly consensus. Both traditions, however, maintain reverence for the verse’s core message, exemplifying Islam’s rich interpretative diversity within unified tawhidic foundations.",
    "layer5_urdu": "سورہ ان ناس 114: 3 (\"بنی نوع انسان کا خدا\") کی ترجمانی کرتے ہوئے ، شیعہ اور سنی نے اہم مذہبی اصولوں پر تبادلہ خیال کیا جبکہ اہم زوروں میں مبتلا ہیں۔ دونوں روایات متفقہ طور پر اللہ کی مطلق خودمختاری اور خصوصی الوہیت (توہد) کی تصدیق کرتی ہیں ، جیسا کہ ابن کتھیر (سنی) اور تبتابائی (شیعہ) نے زور دیا ہے ، جو آیت کی آفاقی دائرہ کار کو مذہب کی نفی کرنے اور الہی اتحاد کی تصدیق کے لئے پیش کرتے ہیں۔ القوروبی (سنی) اور الاتبریسی (شیعہ) اسی طرح \"اللہ\" (دیوتا) کی لسانی قوت کو اجاگر کرتے ہیں کیونکہ اللہ کی عبادت کے انوکھے حق کی نشاندہی کرتے ہیں ، اور تمام زمینی طاقتوں کو عبور کرتے ہیں۔\n\nکلیدی اختلافات الہی اتھارٹی کو تیار کرنے میں ابھرتے ہیں۔ التوسی کے ذریعہ طافسیر القومی اور الیعبیان جیسی شیعہ تبصرے اکثر اللہ کے لارڈشپ کو الہامی طور پر مقرر کردہ رہنمائی کے فریم ورک کے اندر سیاق و سباق دیتے ہیں ، اور ملحقہ آیات (114: 1-2) میں \"پناہ\" کی ترجمانی کرتے ہیں اور اے ایچ ایل البیٹ کی رعایت کے ذریعے تحفظ حاصل کرنے سے لازم و ملزوم ہیں۔ یہ الہی پروویڈنس کی توسیع کے طور پر امامہ کے شیعہ مذہبی محور کی عکاسی کرتا ہے۔ اس کے برعکس ، سنی حکام جیسے التاباری اور العزبی کے بغیر براہ راست الہی خودمختاری پر زور دیتے ہیں ، جب ابن کتھیر نے عبادت میں کسی بھی انسانی ثالثی کو واضح طور پر مسترد کردیا ہے۔\n\nیہ تشریحات عقیدت مندانہ طریقوں پر اثر انداز ہوتی ہیں: شیعہ روایت اکثر الہٰی فضل کے چینلز کے طور پر اماموں کو ضمنیوں کو مربوط کرتی ہے ، جبکہ سنی پریکٹس اللہ کی براہ راست درخواست کو ترجیح دیتی ہے۔ تاریخی طور پر ، یہ تغیرات اتھارٹی کے بعد کے حامی محمد کے بارے میں ابتدائی مذہبی مباحثوں سے پیدا ہوتے ہیں ، جس میں شیعہ نے فریم ورک کے اندر اماموں کے ’ہرمینیٹیکل کردار کو ترجیح دی ہے ، اور خلیفہ سے تعاون یافتہ اسکالرشنس کے ارد گرد سنی اسکالرشپ کرسٹل بنائی ہے۔ تاہم ، دونوں روایات آیت کے بنیادی پیغام کے لئے عقیدت برقرار رکھتے ہیں ، جو متحد توہیڈک بنیادوں میں اسلام کے بھرپور تشریحی تنوع کی مثال دیتے ہیں۔",
    "layer2short": "In classical Shia exegesis, the phrase *Ilah al-Nas* (The God of mankind) in Surah al-Naas 114:3 is understood as a profound affirmation of *tawhid* (divine oneness) and Allah’s absolute sovereignty over all creation. Both Allama Tabatabai in *Al-Mizan* and Sheikh Tabrisi in *Majma al-Bayan* emphasize that this verse transcends mere acknowledgment of Allah’s lordship; it establishes His unique role as the sole object of worship (*ma‘bud*) and ultimate refuge for humanity. Tabrisi notes that the repetition of *al-Nas* (mankind) in the first three verses of the surah underscores Allah’s universal authority, rejecting any compartmentalization of divinity or limited jurisdictional claims over subsets of creation. This aligns with the Shia theological principle that Allah’s lordship is indivisible and all-encompassing, negating the validity of intermediaries who might falsely claim divine prerogatives.",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الناس 114: 3 میں * اللہ الناس * (بنی نوع انسان کا دیوتا) جملہ * توہید * (خدائی وحدانیت) اور اللہ کی مطلق خودمختاری کے بارے میں سمجھا جاتا ہے۔ * المزان * اور شیخ تبریسی میں الامہ تبتابائی دونوں * ماجما البیان * میں اس بات پر زور دیتے ہیں کہ یہ آیت صرف اللہ کے لارڈشپ کے اعتراف سے ماورا ہے۔ یہ عبادت کے واحد مقصد (*ma'bud*) اور انسانیت کے لئے حتمی پناہ کے طور پر اپنا انوکھا کردار قائم کرتا ہے۔ تبریسی نے نوٹ کیا ہے کہ سورہ کی پہلی تین آیات میں * الناس * (بنی نوع انسان) کی تکرار اللہ کے عالمگیر اتھارٹی کی نشاندہی کرتی ہے ، اور تخلیق کے ذیلی ذخیروں پر الوہیت یا محدود دائرہ اختیار کے دعووں کو مسترد کرتے ہیں۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ اللہ کی لارڈشپ ناقابل تقسیم اور ہر طرف متضاد ہے ، اور بیچوانوں کی صداقت کی نفی کرتے ہیں جو الہی تعصبات کا جھوٹا دعویٰ کرسکتے ہیں۔"
  },
  "4": {
    "layer1": "In Surah An-Naas verse 4, Allah commands believers to seek refuge \"from the evil of the retreating whisperer\" (*min sharri al-waswasi al-khannas*). This verse addresses the subtle, persistent whispers (*waswas*) that plague human hearts, often attributed to Satan or the lower self (*nafs*). The term *khannas* derives from the root *khanasa*, meaning \"to withdraw\" or \"retreat,\" signifying how these whispers slink away when one remembers Allah but return when heedlessness sets in. Shia tafsir, as explained by scholars like Allamah Tabatabai in *Al-Mizan*, emphasizes that *waswas* operates through doubt, distraction, and misguidance, targeting both faith and moral clarity. Historically, some narrations link this verse to the Prophet Muhammad (peace upon him) seeking protection after being afflicted by magical whispers, underscoring the reality of unseen spiritual attacks.  \n\nThe verse’s power lies in its recognition of the human struggle against internal and external corruption. For contemporary Muslims, this translates to vigilance against modern \"whisperers\": negative influences like greed, despair, or societal pressures that erode spiritual focus. The *khannas* metaphor reminds us that evil suggestions are not static; they retreat when countered with dhikr (remembrance of Allah), prayer, and adherence to the Quran and Ahlul Bayt’s teachings. Practical application involves daily recitation of Surah Naas, self-reflection to identify harmful thoughts, and seeking strength through community and the intercession of the Imams, who exemplified resistance to spiritual corruption. By internalizing this verse, believers cultivate resilience, understanding that true protection lies in Allah’s infinite mercy and the conscious effort to align one’s heart with divine guidance.",
    "layer2": "In Surah An-Naas (114:4), the phrase *min sharri al-waswas al-khannas* (\"from the evil of the retreating whisperer\") is classically interpreted by Shia scholars as a profound reference to the metaphysical struggle against satanic insinuations (*waswas*) that target human consciousness. Drawing from Al-Mizan by Allama Tabatabai, the \"whisperer\" is identified as Satan (Iblis) or his agents, who inject doubt, corruption, and misguidance into the human heart. The term *al-khannas* (\"the retreating one\") signifies the ephemeral and conditional nature of these whispers: they withdraw (*yakhnisu*) when the believer consciously turns to Allah through remembrance (*dhikr*), prayer, or seeking refuge in divine protection. Tabatabai emphasizes that this verse underscores the necessity of spiritual vigilance, as Satan’s whispers exploit human vulnerabilities, particularly during moments of negligence or moral ambiguity.\n\nIn Majma al-Bayan, Sheikh Tabrisi elaborates that the \"whisperer\" operates both externally and internally, aligning with the Shia understanding of the *nafs* (lower self) as a battleground for divine and satanic influences. He cites narrations from Imam Jafar al-Sadiq, who taught that Satan \"advances with desire and retreats with obedience,\" highlighting the reciprocal relationship between human action and spiritual defense. This dynamic reflects the Shia theological principle of *tawhid al-af’al* (unity of divine acts), wherein Allah’s protection is inseparable from human agency in seeking it. \n\nThe verse also connects to Shia jurisprudence (*fiqh*), as ethical and ritual obligations—such as sincerity in worship (*ikhlas*) and avoidance of doubt in acts of devotion—are framed as defenses against satanic whispers. Classical commentators link this to the broader doctrine of *wilayah* (divine guardianship), wherein allegiance to the Ahlul Bayt fortifies believers against spiritual corruption. Thus, the verse encapsulates a holistic vision of faith: a constant interplay between divine grace, human responsibility, and the unseen forces shaping moral choice.",
    "layer3": "In contemporary Shia scholarship, Surah An-Naas 4 is often interpreted through the lens of psychological and societal struggles, reflecting both spiritual and existential dimensions of human vulnerability. Scholars like Ayatollah Naser Makarem Shirazi emphasize that *al-waswas al-khannas* (the retreating whisperer) symbolizes not only Satanic whispers but also the internal and external forces that exploit human insecurities, from addictive technologies to ideological extremism. Modern thinkers, such as Dr. Ahmed Al-Samarrai, link this \"whisperer\" to the neuroscience of intrusive thoughts, where the brain’s amygdala triggers fear or doubt, retreating when countered by mindfulness or dhikr (remembrance of God)—a concept validated by studies on meditation’s impact on neural pathways.  \n\nSocially, the verse speaks to today’s crisis of misinformation and moral confusion. The \"whisperer\" manifests in algorithms that amplify divisive content or predatory consumerism, as noted by scholar Fatima Haider in her work on digital ethics. Philosophically, it challenges the illusion of absolute human autonomy, urging reliance on divine guidance amid existential uncertainties—a theme echoed in interfaith dialogues with Buddhist mindfulness practices or Christian teachings on resisting temptation.  \n\nGlobally, this verse resonates with efforts to address mental health stigma, framing spiritual struggle (*jihad al-nafs*) as complementary to therapy. Shia communities in multicultural contexts, such as those in Europe or North America, use this verse to foster resilience against Islamophobia by grounding identity in transcendent values rather than reactive defensiveness. Ultimately, the verse becomes a call to recognize and resist the subtle evils—internal and systemic—that fragment modern societies, urging a return to conscious, collective accountability.",
    "layer4": "In the luminous teachings of the Ahlul Bayt (peace be upon them), the \"retreating whisperer\" (al-waswas al-khannas) in Surah An-Naas is understood as the insidious voice of Satan that infiltrates human hearts, exploiting moments of spiritual weakness. Imam Ali (peace be upon him) taught that this whisperer \"flees when Allah is remembered but returns when heedlessness prevails,\" emphasizing the dynamic struggle between divine remembrance (dhikr) and satanic deception. The Sixth Imam, Ja'far al-Sadiq (peace be upon him), explained in *Tafsir al-Qummi* that the \"khannas\" withdraws when one consciously seeks refuge in Allah through the guardianship (Wilayah) of the Ahlul Bayt, who are the divinely appointed anchors of spiritual protection.\n\nLady Fatimah (peace be upon her) exemplified this through her famous supplication for seeking refuge in Allah from \"the stealthy whisperer who disappears at the mention of the Merciful,\" as recorded in *Bihar al-Anwar*. The Imams taught that recognizing their Imamah is a fortress against such evils, for Satan's whispers lose power when the heart is illuminated by love for the purified Household of the Prophet. Practical protection lies in reciting Surah An-Naas while consciously affirming one’s allegiance to the Imams, coupled with daily recitation of *dua al-Simat* or *Ziyarat Ashura*, which reinforce the soul’s connection to divine guidance.\n\nTo weaken the whisperer’s influence, Imam Zain al-Abideen (peace be upon him) advised in *Sahifa al-Sajjadiyya* to purify intentions through constant self-accounting (muhasaba) and seeking forgiveness (istighfar). The Ahlul Bayt’s path teaches that spiritual vigilance—rooted in knowledge of Allah’s unity (Tawhid) and loyalty to His chosen guides—transforms the heart into a sanctuary where Satan’s whispers cannot take root. As Imam Ali said, \"The heart is Allah’s vessel on earth; cherish it by filling it with His remembrance.",
    "layer1_urdu": "سورہ ان ناس آیت 4 میں ، اللہ تعالی نے مومنین کو حکم دیا ہے کہ وہ \"پیچھے ہٹتے ہوئے سرگوشی کی برائی سے پناہ حاصل کریں\" (*من شری ال واسواسی الخناس*)۔ اس آیت میں لطیف ، مستقل وسوسوں (*Waswas*) کی نشاندہی کی گئی ہے جو انسانی دلوں کو طاعون کرتی ہے ، اکثر شیطان یا نچلے نفس (*Nafs*) سے منسوب ہوتی ہے۔ اصطلاح *خاناس *جڑ سے ماخوذ *خاناسا *سے ماخوذ ہے ، جس کا مطلب ہے \"انخلا کے لئے\" یا \"اعتکاف\" ، اس بات کی نشاندہی کرتے ہیں کہ جب یہ سرگوشی کے ساتھ اللہ کی یاد آتی ہے لیکن جب لاپرواہی کا تعاقب ہوتا ہے تو ، شبہ ، شبہ کے ذریعہ ، شبہ ، شبہ کے ذریعہ وضاحت کی گئی تھی ، جیسے *العزان *میں الامہ تبتابائی جیسے اسکالرز نے اس بات پر زور دیا تھا کہ *، ایمان اور اخلاقی وضاحت دونوں کو نشانہ بنانا۔ تاریخی طور پر ، کچھ بیانات اس آیت کو حضرت محمد (اس پر امن) سے جوڑتے ہیں جو جادوئی وسوسوں سے دوچار ہونے کے بعد تحفظ کے خواہاں ہیں ، اور غیب روحانی حملوں کی حقیقت پر زور دیتے ہیں۔  \n\nآیت کی طاقت داخلی اور بیرونی بدعنوانی کے خلاف انسانی جدوجہد کو تسلیم کرنے میں ہے۔ عصری مسلمانوں کے ل this ، یہ جدید \"سرگوشی\" کے خلاف چوکسی کا ترجمہ کرتا ہے: لالچ ، مایوسی ، یا معاشرتی دباؤ جیسے منفی اثرات جو روحانی توجہ کو ختم کرتے ہیں۔ * خاناس * استعارہ ہمیں یاد دلاتا ہے کہ بری تجاویز مستحکم نہیں ہیں۔ جب وہ دھکر (اللہ کی یاد) ، دعا ، اور قرآن مجید اور اہل بیت کی تعلیمات پر عمل پیرا ہونے کا مقابلہ کرتے ہیں تو وہ پیچھے ہٹ جاتے ہیں۔ عملی اطلاق میں روزانہ سورہ ناس کی تلاوت ، نقصان دہ خیالات کی نشاندہی کرنے کے لئے خود سے عکاسی ، اور معاشرے کے ذریعہ طاقت کے حصول اور اماموں کی شفاعت شامل ہے ، جنہوں نے روحانی بدعنوانی کے خلاف مزاحمت کی مثال دی۔ اس آیت کو اندرونی بنا کر ، مومنین لچک پیدا کرتے ہیں ، یہ سمجھتے ہوئے کہ حقیقی تحفظ اللہ کی لامحدود رحمت اور کسی کے دل کو الہی رہنمائی کے ساتھ ہم آہنگ کرنے کی شعوری کوشش میں ہے۔",
    "layer2_urdu": "سورہ ان ناس (114: 4) میں ، جملے*من شری الاوسواس الخناس*(\"پسپائی کی سرگوشی کی برائی سے\") کو شیعہ اسکالرز نے کلاسیکی طور پر تعبیر کیا ہے جس میں شیطانی انشورنس کے خلاف استعاریاتی جدوجہد کا گہرا حوالہ دیا گیا ہے (*واسواس*) جو انسانی شعور کو نشانہ بناتا ہے۔ علامہ تبتابائی کے ذریعہ المزان سے ڈرائنگ ، \"سرگوشی\" کی شناخت شیطان (Iblis) یا اس کے ایجنٹوں کے نام سے کی گئی ہے ، جو انسانی دل میں شک ، بدعنوانی اور غلط فہمی کو انجیکشن دیتے ہیں۔ اصطلاح*الکتناس*(\"پیچھے ہٹانے والا\") ان سرگوشیوں کی فرضی اور مشروط نوعیت کی نشاندہی کرتا ہے: جب وہ مومن شعوری طور پر یادداشت (*دھکر*) ، دعا ، یا الہامی تحفظ میں پناہ مانگتے ہوئے اللہ کی طرف رجوع کرتے ہیں۔ تبتابائی نے اس بات پر زور دیا ہے کہ یہ آیت روحانی چوکسی کی ضرورت پر زور دیتی ہے ، کیونکہ شیطان کی وسوسے انسانی خطرات کا استحصال کرتے ہیں ، خاص طور پر غفلت یا اخلاقی ابہام کے لمحات کے دوران۔\n\nماجما البیان میں ، شیخ تبریسی نے وضاحت کی ہے کہ \"وسوسے والا\" بیرونی اور اندرونی طور پر دونوں چلاتا ہے ، اور اس میں الہی اور شیطانی اثرات کے لئے میدان جنگ کے طور پر * نفس * (نچلے خود) کی شیعہ تفہیم کے ساتھ صف بندی کرتا ہے۔ انہوں نے امام جعفر السادق کی روایات کا حوالہ دیا ، جنھوں نے یہ سکھایا کہ شیطان \"خواہش کے ساتھ پیش قدمی کرتا ہے اور اطاعت کے ساتھ پیچھے ہٹتا ہے ،\" انسانی عمل اور روحانی دفاع کے مابین باہمی تعلقات کو اجاگر کرتا ہے۔ یہ متحرک * توحید الافال * (الہی عمل کی اتحاد) کے شیعہ مذہبی اصول کی عکاسی کرتا ہے ، جس میں اللہ کا تحفظ اس کی تلاش میں انسانی ایجنسی سے لازم و ملزوم ہے۔ \n\nیہ آیت شیعہ فقہ (*fiqh*) سے بھی منسلک ہوتی ہے ، جیسا کہ اخلاقی اور رسمی ذمہ داریوں کی حیثیت سے - عبادت میں اخلاص (*ikhlas*) اور عقیدت میں شک سے بچنے کے طور پر ، شیطانی وسوسوں کے خلاف دفاع کے طور پر تیار کیا جاتا ہے۔ کلاسیکی مبصرین اس کو * ولیہ * (الہی سرپرستی) کے وسیع نظریہ سے جوڑتے ہیں ، جس میں اہل بیت سے بیعت مومنین کو روحانی بدعنوانی کے خلاف مضبوط کرتی ہے۔ اس طرح ، آیت عقیدے کے ایک جامع وژن کو سمیٹتی ہے: الہی فضل ، انسانی ذمہ داری ، اور اخلاقی انتخاب کی تشکیل کرنے والی غیب قوتوں کے مابین مستقل تعامل۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ این ناس 4 کی ترجمانی نفسیاتی اور معاشرتی جدوجہد کے عینک کے ذریعہ کی جاتی ہے ، جو انسانی کمزوری کے روحانی اور وجودی دونوں جہتوں کی عکاسی کرتی ہے۔ آیت اللہ ناصر مکریم شیرازی جیسے اسکالرز اس بات پر زور دیتے ہیں کہ * الواسواس الخناس * (پیچھے ہٹنا سرگوشی) نہ صرف شیطانی وسوسوں کی علامت ہے بلکہ اندرونی اور بیرونی قوتوں کی بھی علامت ہے جو انسانی عدم تحفظ کا استحصال کرتے ہیں ، نشہ آور تکنیکی سے لے کر نظریاتی انتہا پسندی تک۔ جدید مفکرین ، جیسے ڈاکٹر احمد السمرائی ، اس \"وسوسے کو\" کو دخل اندازی کرنے والے خیالات کے اعصابی سائنس سے جوڑتے ہیں ، جہاں دماغ کے امیگدالہ خوف یا شک کو متحرک کرتے ہیں ، جب ذہنیت یا دھک (خدا کی یاد) کا مقابلہ کرتے ہیں تو پیچھے ہٹ جاتے ہیں۔  \n\nمعاشرتی طور پر ، آیت آج کے غلط معلومات اور اخلاقی الجھن کے بحران کی بات کرتی ہے۔ \"سرگوشی\" الگورتھم میں ظاہر ہوتا ہے جو تفرقہ انگیز مواد یا شکاری صارفیت کو بڑھاوا دیتا ہے ، جیسا کہ اسکالر فاطمہ حیدر نے ڈیجیٹل اخلاقیات پر اپنے کام میں نوٹ کیا ہے۔ فلسفیانہ طور پر ، یہ مکمل انسانی خودمختاری کے وہم کو چیلنج کرتا ہے ، اور وجودی غیر یقینی صورتحال کے درمیان خدائی رہنمائی پر انحصار کرنے پر زور دیتا ہے۔ یہ ایک موضوع بدھ مت کے ذہنیت کے طریقوں یا عیسائی تعلیمات کے ساتھ لالچ کے خلاف مزاحمت کرنے پر بین المذاہب مکالموں میں گونجتا ہے۔  \n\nعالمی سطح پر ، یہ آیت ذہنی صحت کے بدنامی کو دور کرنے کی کوششوں کے ساتھ گونجتی ہے ، روحانی جدوجہد (*جہاد الیفس*) کو تھراپی کے تکمیلی قرار دیتی ہے۔ کثیر الثقافتی سیاق و سباق میں شیعہ کمیونٹیز ، جیسے یورپ یا شمالی امریکہ میں ، اس آیت کو اسلامو فوبیا کے خلاف لچک کو فروغ دینے کے لئے رد عمل کی دفاع کے بجائے ماورائی اقدار میں شناخت بنا کر استعمال کرتے ہیں۔ بالآخر ، آیت ٹھیک ٹھیک برائیوں کو پہچاننے اور ان کے خلاف مزاحمت کرنے کا مطالبہ بن جاتی ہے۔",
    "layer4_urdu": "سورہ ان ناس میں اہل بیت (ان پر سلامتی) کی برائٹ تعلیمات میں ، \"پیچھے ہٹانے والی سرگوشی\" (الواسواس الخنناس) کو شیطان کی کپٹی آواز کے طور پر سمجھا جاتا ہے جو روحانی کمزوری کے لمحات کو انسانی دلوں میں گھساتا ہے۔ امام علی (اس پر امن) نے سکھایا کہ یہ سرگوشی کرنے والا \"جب اللہ کو یاد کیا جاتا ہے تو وہ بھاگتا ہے لیکن جب غفلت کا شکار ہوتا ہے تو واپس آجاتا ہے ،\" الہی یاد (ڈی ایچ آئی سی آر) اور شیطانی دھوکہ دہی کے مابین متحرک جدوجہد پر زور دیتے ہوئے۔ چھٹا امام ، جافر السادق (اس پر امن ہے) ، نے * طافسیر القومی * میں بتایا کہ جب \"خنناس\" اس وقت انخلا کا شکار ہوتا ہے جب کوئی شعوری طور پر اہل بیت کے سرپرستی (ولیہ) کے ذریعے اللہ میں پناہ مانگتا ہے ، جو روحانی تحفظ کے الہی مقرر کردہ اینکر ہیں۔\n\nلیڈی فاطمہ (اس پر امن ہے) نے اس کی مثال اپنے مشہور التجا کے ذریعہ اللہ میں پناہ حاصل کرنے کے لئے \"چپٹی والی سرگوشی جو رحمدل کے ذکر پر غائب ہو گئی\" سے کی گئی ہے ، جیسا کہ *بہار الانور *میں درج ہے۔ اماموں نے سکھایا کہ ان کے امامہ کو پہچاننا ایسی برائیوں کے خلاف ایک قلعہ ہے ، کیونکہ شیطان کی وسوسے طاقت سے محروم ہوجاتے ہیں جب نبی of کے پاک گھریلو گھر سے محبت سے دل روشن ہوجاتا ہے۔ عملی تحفظ سوراہ ان ناس کی تلاوت میں مضمر ہے جبکہ اماموں سے شعوری طور پر کسی کی وفاداری کی تصدیق کرتے ہیں ، اس کے ساتھ ساتھ *DUA ALSIMAT *یا *ZYAARAT ASHURA *کی روزانہ تلاوت بھی کی جاتی ہے ، جو الہی رہنمائی سے روح کے تعلق کو تقویت بخشتی ہے۔\n\nسرگوشی کرنے والے کے اثر و رسوخ کو کمزور کرنے کے لئے ، امام زین الیبائڈن (اس پر امن) * ساہفا الصججدیہ * میں مشورہ دیا کہ وہ مستقل خود محاسبہ (مہاسابا) کے ذریعے ارادوں کو پاک کریں اور معافی مانگیں (استھفر)۔ اہل بیت کا راستہ یہ سکھاتا ہے کہ روحانی چوکسی allah اللہ کے اتحاد (توہید) کے علم میں جڑی ہوئی ہے اور اس کے منتخب کردہ رہنماؤں کے ساتھ وفاداری - دل کو ایک ایسی تقدس میں تبدیل کرتی ہے جہاں شیطان کی وسوسے جڑ نہیں اٹھا سکتے ہیں۔ جیسا کہ امام علی نے کہا ، \"دل زمین پر اللہ کا برتن ہے۔ اسے اپنی یاد سے بھر کر اس کی قدر کریں۔",
    "layer5": "In interpreting Surah An-Naas (114:4), both Shia and Sunni scholarly traditions converge on core themes while offering nuanced perspectives shaped by their theological frameworks. Sunni commentators such as Ibn Kathir (*Tafsir al-Quran al-Azim*) and Tabari (*Jami al-Bayan*) identify the \"whisperer\" (*al-waswas*) as Satan (Iblis), emphasizing his role in tempting humans and retreating (*khannas*) when believers seek divine refuge through remembrance (*dhikr*). Qurtubi (*Al-Jami li-Ahkam al-Quran*) adds that this retreat is both literal and metaphorical, reflecting Satan’s persistence and vulnerability to sincere devotion. Razi (*Mafatih al-Ghayb*) extends this to the psychological realm, framing whispers as assaults on human resolve, countered by spiritual vigilance.\n\nShia exegetes like Tabatabai (*Al-Mizan*) and Tabrisi (*Majma al-Bayan*) similarly identify Satan as the primary whisperer but integrate broader ontological dimensions. Tabatabai underscores the interplay between external satanic influences and the inner self (*nafs*), arguing that the verse addresses both metaphysical and ethical struggles. Tusi (*At-Tibyan*) and Qummi (*Tafsir al-Qummi*) cite traditions from the Ahl al-Bayt, which occasionally extend \"whisperer\" to include corrupt human tempters, reflecting Shia emphasis on moral and social corruption as manifestations of evil. Both traditions agree on the necessity of seeking Allah’s protection, yet Shia sources often link this practice to the guidance of the Imams, seen as spiritual intercessors and exemplars of piety.\n\nDivergences arise in theological emphasis: Sunni interpretations prioritize individual accountability in resisting Satan, while Shia readings situate the struggle within a cosmic framework requiring both personal effort and allegiance to divinely appointed leadership. These differences stem from distinct historical developments, particularly Shia reliance on the Imams’ hermeneutical authority versus Sunni adherence to consensus (*ijma*) and textual analysis. Both traditions, however, reinforce the verse’s universal call to spiritual awareness, uniting Muslims in the recognition of evil’s subtleties and the transformative power of divine remembrance.",
    "layer5_urdu": "سورہ ان ناس (114: 4) کی ترجمانی کرتے ہوئے ، شیعہ اور سنی علمی روایات بنیادی موضوعات پر ایک دوسرے کے ساتھ مل جاتی ہیں جبکہ ان کے مذہبی فریم ورک کے ذریعہ تیار کردہ متناسب نقطہ نظر کی پیش کش کرتے ہیں۔ ابن کتھیر (*طافسیر القوران العازیم*) اور تباری (*جمی البیان*) جیسے سنی مبصرین \"وسوسے دار\" (*الاوسواس*) کو شیطان (البلس) کے طور پر شناخت کرتے ہیں ، جب انسانوں کو لالچ میں اپنے کردار پر زور دیتے ہیں اور (*خنز*) کے ذریعے ریمرکنس (*خنز*) کی تلاش کرتے ہیں۔ قربانی (*الجامی لی احکم القوران*) نے مزید کہا کہ یہ اعتکاف دونوں لفظی اور استعاراتی ہے ، جو شیطان کی استقامت اور مخلص عقیدت کے خطرے کی عکاسی کرتا ہے۔ رازی (*مافاتیہ الغیب*) نے اس کو نفسیاتی دائرے تک بڑھایا ، اور روحانی چوکسی کے مقابلہ میں انسانی عزم پر حملہ کے طور پر وسوسے تیار کرتے ہیں۔\n\nشیعہ نے تبتابائی (*المزان*) اور تبریسی (*ماجما البیان*) کی طرح شیطان کو بھی اسی طرح شیطان کی شناخت بنیادی سرگوشی کے طور پر کی ہے لیکن وسیع تر آنٹولوجیکل طول و عرض کو مربوط کیا ہے۔ تبتابائی بیرونی شیطانی اثرات اور اندرونی نفس (*این اے ایف ایس*) کے مابین باہمی تعل .ق کی نشاندہی کرتی ہے ، اور یہ استدلال کرتی ہے کہ آیت استعاریاتی اور اخلاقی جدوجہد دونوں پر توجہ دیتی ہے۔ توسی (*ایٹ-تبیان*) اور قمی (*طافسیر القمی*) نے اہل البائٹ کی روایات کا حوالہ دیا ، جو کبھی کبھار \"سرگوشی\" کو بڑھاتے ہیں تاکہ بدعنوان انسانی فتنے کو بھی شامل کیا جاسکے ، جو برائی کے مظہر کے طور پر اخلاقی اور معاشرتی بدعنوانی پر شیعہ زور دینے کی عکاسی کرتا ہے۔ دونوں روایات اللہ کے تحفظ کے حصول کی ضرورت پر متفق ہیں ، پھر بھی شیعہ کے ذرائع اکثر اس مشق کو اماموں کی رہنمائی سے جوڑتے ہیں ، جسے روحانی شفاعت کرنے والے اور تقویٰ کی مثال کے طور پر دیکھا جاتا ہے۔\n\nمذہبی زور سے تفریق پیدا ہوتی ہے: سنی تشریحات شیطان کے خلاف مزاحمت میں انفرادی احتساب کو ترجیح دیتی ہیں ، جبکہ شیعہ ریڈنگ ایک کائناتی فریم ورک کے اندر جدوجہد کو پیش کرتی ہے جس میں ذاتی کوشش اور الہامی طور پر مقرر کردہ قیادت سے بیعت کی ضرورت ہوتی ہے۔ یہ اختلافات الگ الگ تاریخی پیشرفتوں سے پیدا ہوتے ہیں ، خاص طور پر شیعہ اماموں ’ہرمینیٹیکل اتھارٹی کے مقابلے میں سنی پر انحصار کرتے ہیں بمقابلہ سنی اتفاق رائے (*آئی جے ایم اے*) اور متنی تجزیہ۔ تاہم ، دونوں روایات روحانی بیداری کے لئے آیت کی آفاقی پکار کو تقویت دیتی ہیں ، برائی کی لطافتوں کی پہچان اور الہی یاد کی تبدیلی کی طاقت کو تسلیم کرتے ہوئے مسلمانوں کو متحد کرتی ہیں۔",
    "layer2short": "In Surah An-Naas (114:4), the phrase *min sharri al-waswas al-khannas* (\"from the evil of the retreating whisperer\") is classically interpreted by Shia scholars as a profound reference to the metaphysical struggle against satanic insinuations (*waswas*) that target human consciousness. Drawing from Al-Mizan by Allama Tabatabai, the \"whisperer\" is identified as Satan (Iblis) or his agents, who inject doubt, corruption, and misguidance into the human heart. The term *al-khannas* (\"the retreating one\") signifies the ephemeral and conditional nature of these whispers: they withdraw (*yakhnisu*) when the believer consciously turns to Allah through remembrance (*dhikr*), prayer, or seeking refuge in divine protection. Tabatabai emphasizes that this verse underscores the necessity of spiritual vigilance, as Satan’s whispers exploit human vulnerabilities, particularly during moments of negligence or moral ambiguity.",
    "layer2short_urdu": "سورہ ان ناس (114: 4) میں ، جملے*من شری الاوسواس الخناس*(\"پسپائی کی سرگوشی کی برائی سے\") کو شیعہ اسکالرز نے کلاسیکی طور پر تعبیر کیا ہے جس میں شیطانی انشورنس کے خلاف استعاریاتی جدوجہد کا گہرا حوالہ دیا گیا ہے (*واسواس*) جو انسانی شعور کو نشانہ بناتا ہے۔ علامہ تبتابائی کے ذریعہ المزان سے ڈرائنگ ، \"سرگوشی\" کی شناخت شیطان (Iblis) یا اس کے ایجنٹوں کے نام سے کی گئی ہے ، جو انسانی دل میں شک ، بدعنوانی اور غلط فہمی کو انجیکشن دیتے ہیں۔ اصطلاح*الکتناس*(\"پیچھے ہٹانے والا\") ان سرگوشیوں کی فرضی اور مشروط نوعیت کی نشاندہی کرتا ہے: جب وہ مومن شعوری طور پر یادداشت (*دھکر*) ، دعا ، یا الہامی تحفظ میں پناہ مانگتے ہوئے اللہ کی طرف رجوع کرتے ہیں۔ تبتابائی نے اس بات پر زور دیا ہے کہ یہ آیت روحانی چوکسی کی ضرورت پر زور دیتی ہے ، کیونکہ شیطان کی وسوسے انسانی خطرات کا استحصال کرتے ہیں ، خاص طور پر غفلت یا اخلاقی ابہام کے لمحات کے دوران۔"
  },
  "5": {
    "layer1": "Surah An-Naas, the 114th chapter of the Quran, serves as a profound reminder of humanity’s vulnerability to hidden spiritual dangers. Verse 5, *“alladhi yuwaswisu fi sudoor al-nas”* (“Who whispers [evil] into the breasts of mankind”), identifies the insidious nature of *waswasah* (whispered temptations) that target the human heart. In Shia tafsir, this verse is understood as a continuation of the warning against *al-waswas al-khannas* (“the retreating whisperer”) mentioned in the previous verse, referring to Satan’s persistent attempts to misguide people by exploiting their doubts, fears, and desires. The term *yuwaswisu* derives from the root *waswasa*, which implies a repetitive, stealthy incitement to evil, while *sudoor* (breasts/hearts) symbolizes the inner realm of human consciousness where moral and spiritual battles occur.  \n\nHistorical accounts note that this surah, revealed in Mecca, emphasizes the universality of spiritual struggle. The Prophet Muhammad (peace be upon him) and the Ahlul Bayt (as) taught that Satan’s whispers are not limited to obvious sins but often manifest as subtle doubts—about faith, self-worth, or others’ intentions. For instance, Imam Ali (as) warned against *waswasah* in worship, such as excessive scrupulosity in rituals that distracts from sincere devotion.  \n\nIn modern contexts, this verse urges Muslims to recognize and resist the “whisperings” amplified by today’s distractions—social comparison, materialism, or nihilism. Practical protection lies in cultivating *taqwa* (God-consciousness), seeking refuge in Allah through daily recitations like this surah, and grounding oneself in the Quran and the teachings of the Ahlul Bayt (as). By nurturing a heart attuned to divine guidance, believers can discern and dismiss the *waswasah* that seek to corrupt their intentions and actions, fostering inner clarity and resilience.",
    "layer2": "In classical Shia exegesis, Surah al-Naas 114:5 is understood as a profound exploration of the subtlety and persistence of satanic influence on the human soul. The phrase *\"yuwaswisu fi sudur al-nas\"* (who whispers into the breasts of mankind) is analyzed by scholars such as Tabatabai in *Al-Mizan* and Tabrisi in *Majma al-Bayan* as a reference to the *waswas al-khannas*—the \"slinking whisperer\" (Q 114:4)—identified as Iblis or his agents. Tabrisi notes that the term *waswasa* denotes repeated, insidious suggestions that exploit human vulnerabilities, targeting the *sudur* (breasts/hearts) as the seat of spiritual and moral consciousness. This aligns with the Shia emphasis on the heart’s purity as a prerequisite for divine proximity, a theme recurrent in narrations from the Ahl al-Bayt.\n\nTabatabai elaborates that such whispers operate within the framework of divine trial (*ibtila*), testing humanity’s capacity to exercise free will (*ikhtiyar*) and seek refuge in Allah’s guidance. The verse underscores the theological principle that evil suggestions are external to the soul, requiring conscious rejection through *taqwa* (God-consciousness) and adherence to the Qur’an and the teachings of the Imams. Imam Jafar al-Sadiq, as cited in Shia sources, taught that safeguarding the heart from *waswasa* necessitates constant remembrance (*dhikr*) of Allah and reliance on the intercessory role (*tawassul*) of the Ahl al-Bayt, who serve as spiritual protectors against hidden corruption.\n\nJurisprudentially, this verse reinforces the obligation to seek protection (*isti‘adha*) from evil, as commanded in the opening verses of the surah. Classical commentators link this to the daily recitation of Surah al-Naas in prayers and supplications, reflecting the Shia synthesis of doctrinal awareness and practical spirituality. The consensus among scholars affirms that while Satan’s whispers are inevitable, divine grace—mediated through prophetic and Imamic guidance—ensures believers possess the means to transcend them.",
    "layer3": "In Surah An-Naas (114:5), the Qur’an describes a force that \"whispers into the breasts of mankind\"—a vivid metaphor for the subtle, invasive nature of spiritual and moral corruption. Contemporary Shia scholars, such as Ayatollah Naser Makarem Shirazi, emphasize that this \"waswas\" (whispering) transcends mere temptation, reflecting a psychological and existential battle against forces that exploit human vulnerabilities. Modern tafsir works, like *Al-Amthal fi Tafsir al-Qur’an*, link this verse to the internalization of doubt, fear, and moral confusion, framing it as a timeless struggle between divine guidance and the destabilizing whispers of ego, societal pressures, or systemic injustice.  \n\nNeuroscience offers a parallel lens: studies on cognitive biases and the \"negativity bias\" (the brain’s tendency to prioritize harmful stimuli) mirror the Qur’anic concept of insidious whispers. Social media algorithms, for instance, amplify divisive or anxiety-inducing content, creating a modern \"whispering\" that fractures communities and fuels polarization. Scholars like Dr. Mohammad Ali Shomali connect this to the verse’s warning, urging believers to cultivate *taqwa* (mindful awareness) and critical thinking to resist manipulative narratives.  \n\nGlobally, this verse resonates amid crises like misinformation, mental health struggles, and ethical relativism. Philosophers like Dr. Liyakat Takim highlight its interfaith relevance: Buddhism’s focus on overcoming \"mental defilements\" and Christian teachings on resisting \"the devil’s lies\" parallel the Qur’anic call to seek refuge in God’s protection. In multicultural societies, the verse invites collective reflection on how systemic inequities—economic greed, racial prejudice—manifest as societal \"whispers\" that normalize harm.  \n\nUltimately, Surah An-Naas 114:5 challenges modern believers to recognize and resist both internal and external corruptions through spiritual vigilance, community solidarity, and ethical action—a message as urgent today as it was 1,400 years ago.",
    "layer4": "In Surah An-Naas, Allah warns humanity against the hidden enemy who \"whispers evil into the breasts of mankind.\" The Ahlul Bayt (peace be upon them) teach that this \"whispering\" (waswasah) operates on both external and internal planes. Imam Ali (peace be upon him) explains in *Nahj al-Balagha*: \"The worst companion is the insinuating self (nafs) that constantly invites towards evil—it neither dies to let you rest nor exposes itself clearly for you to avoid.\" This verse reveals that Satan’s whispers manifest through our own unchecked desires and doubts, making the human heart a battleground between divine guidance and destructive impulses.\n\nImam Jafar al-Sadiq (peace be upon him) taught that the \"breasts\" (sudoor) mentioned here symbolize the spiritual center where faith and hypocrisy contend. He states: *\"The heart (qalb) is the throne of the Imam [of guidance] or the throne of Satan. If one submits to Allah’s guardianship (Wilayah), the heart becomes illuminated by the light of the Imams, repelling darkness. But if one neglects remembrance (dhikr), Satan occupies that throne.\"* Thus, the verse underscores the necessity of anchoring oneself in the Wilayah of the Ahlul Bayt, whose purified spiritual station protects believers from subtle corruptions.\n\nLady Fatimah (peace be upon her) exemplified defense against whispers through her famous supplication: *\"O Allah! Purify my heart from hypocrisy and my actions from showmanship.\"* The practical path lies in daily adherence to the Thaqalayn—the Quran and the Ahlul Bayt. Reciting Surah An-Naas with consciousness of Imamah, seeking refuge in Allah through the names of the Panjetan, and reflecting on Imam Zain al-Abideen’s *Du'a al-Makarim al-Akhlaq* to transform the soul are vital steps. True safety from whispers comes not by mere avoidance of sin, but by filling the heart with the luminous presence of the Fourteen Infallibles through knowledge, love, and imitation of their perfected states.",
    "layer1_urdu": "قرآن مجید کا 114 واں باب ، سورہ ان ناس ، انسانیت کے پوشیدہ روحانی خطرات کے خطرے کی گہری یاد دہانی کے طور پر کام کرتا ہے۔ آیت 5 ، * \"اللادھی یوسویسو فائی سوڈور الناس\" شیعہ طافسیر میں ، اس آیت کو * الواسواس الخناس * (\"پیچھے ہٹانے والی سرگوشی\") کے خلاف انتباہ کے تسلسل کے طور پر سمجھا جاتا ہے ، جس میں پچھلی آیت میں ذکر کیا گیا ہے ، جس میں شیطان کی ان کے شکوک و شبہات ، خوف اور خواہشات کا استحصال کرکے لوگوں کو گمراہ کرنے کی مستقل کوششوں کا حوالہ دیا گیا ہے۔ اصطلاح *یوسویسو *جڑ *واسواسا *سے ماخوذ ہے ، جو برائی کے لئے ایک بار بار ، چپکے سے بھڑکانے کا مطلب ہے ، جبکہ *سوڈور *(چھاتی/دل) انسانی شعور کے اندرونی دائرے کی علامت ہے جہاں اخلاقی اور روحانی لڑائیاں واقع ہوتی ہیں۔  \n\nتاریخی اکاؤنٹس نوٹ کرتے ہیں کہ مکہ میں انکشاف ہوا یہ سورہ روحانی جدوجہد کی عالمگیریت پر زور دیتا ہے۔ حضرت محمد صلی اللہ علیہ وآلہ وسلم اور اہل بیت (ع) نے سکھایا کہ شیطان کی وسوسے واضح گناہوں تک ہی محدود نہیں ہیں بلکہ اکثر لطیف شکوک و شبہات کے طور پر ظاہر ہوتی ہیں۔ مثال کے طور پر ، امام علی (ع) نے عبادت میں * واسواساہ * کے خلاف متنبہ کیا ، جیسے رسومات میں ضرورت سے زیادہ سکرولیٹی جو مخلص عقیدت سے ہٹ جاتی ہے۔  \n\nجدید سیاق و سباق میں ، یہ آیت مسلمانوں سے گزارش کرتی ہے کہ وہ آج کی خلفشار - معاشرتی موازنہ ، مادیت یا نحمیت کے ذریعہ \"وسوسے\" کو پہچاننے اور ان کے خلاف مزاحمت کرنے کی تاکید کرتی ہے۔ عملی تحفظ * تقوا * (خدا کے شعور) کی کاشت کرنے ، اس سورہ جیسی روزانہ کی تلاوت کے ذریعہ اللہ میں پناہ مانگنے اور قرآن مجید میں خود کو بنیاد بنانے اور اہل بیت (ع) کی تعلیمات میں شامل ہے۔ خدائی رہنمائی سے منسلک دل کی پرورش کرکے ، مومنین * واسواسہ * کو سمجھ سکتے اور خارج کرسکتے ہیں جو اپنے ارادوں اور اقدامات کو خراب کرنے کی کوشش کرتے ہیں ، اور اندرونی وضاحت اور لچک کو فروغ دیتے ہیں۔",
    "layer2_urdu": "کلاسیکی شیعہ استقامت میں ، سورہ الناس 114: 5 کو انسانی روح پر شیطانی اثر و رسوخ کی لطیفیت اور استقامت کی گہری کھوج کے طور پر سمجھا جاتا ہے۔ *\"یوسویسو فائی سڈور النس\" *(جو بنی نوع انسان کے سینوں میں سرگوشی کرتے ہیں) کے فقرے کا تجزیہ *المزان *میں تبتابائی جیسے اسکالرز اور *مجمہ البیان *میں تبریسی جیسے *ہاڈس آئبل میں *vaswas الخنناس *-Q 114) کے حوالے سے کیا گیا ہے۔ تبریسی نے نوٹ کیا ہے کہ اصطلاح * واسواسا * بار بار ، کپٹی تجاویز کی نشاندہی کرتی ہے جو انسانی خطرات کا استحصال کرتی ہے ، اور * سوڈور * (چھاتیوں/دلوں) کو روحانی اور اخلاقی شعور کی نشست کے طور پر نشانہ بناتی ہے۔ یہ شیعہ کے ساتھ دل کی طہارت پر زور دینے کے ساتھ الہی قربت کی شرط کے طور پر ہم آہنگی کرتا ہے ، یہ ایک تھیم اے ایچ ایل ال بیت کی روایتوں میں بار بار ہوتا ہے۔\n\nتبتابائی نے وضاحت کی ہے کہ اس طرح کی وسوسے خدائی آزمائش (*ابٹیلا*) کے فریم ورک کے اندر کام کرتی ہیں ، جس سے انسانیت کی آزادانہ مرضی (*اختیئر*) کو استعمال کرنے کی صلاحیت کی جانچ ہوتی ہے اور اللہ کی رہنمائی میں پناہ ملتی ہے۔ آیت اس مذہبی اصول کی نشاندہی کرتی ہے کہ برائیوں کی تجاویز روح کے بیرونی ہیں ، جس میں * تقوا * (خدا کے شعور) کے ذریعے شعوری طور پر مسترد ہونے کی ضرورت ہے اور قرآن مجید اور اماموں کی تعلیمات پر عمل پیرا ہے۔ امام جعفر السادق ، جیسا کہ شیعہ ذرائع میں بتایا گیا ہے ، سکھایا گیا ہے کہ*واسواسا*سے دل کی حفاظت کرنے کے لئے اللہ کی مستقل یادداشت (*دھکر*) کی ضرورت ہے اور اہل البیٹ کے شفاعت کے کردار (*تواسول*) پر انحصار کرنا ہے ، جو پوشیدہ بدعنوانی کے خلاف روحانی طور پر خدمات انجام دیتے ہیں۔\n\nفقہی طور پر ، یہ آیت برائی سے تحفظ حاصل کرنے کی ذمہ داری کو تقویت دیتی ہے ، جیسا کہ سورہ کی ابتدائی آیات میں حکم دیا گیا ہے۔ کلاسیکی مبصرین کو اس کو نمازوں اور تحلیلوں میں سورہ الناس کی روزانہ تلاوت سے جوڑتا ہے ، جو نظریاتی بیداری اور عملی روحانیت کے شیعہ ترکیب کی عکاسی کرتا ہے۔ اسکالرز کے مابین اتفاق رائے اس بات کی تصدیق کرتا ہے کہ جبکہ شیطان کی وسوسے ناگزیر ہیں ، خدائی فضل - جو پیشن گوئی اور امامک رہنمائی کے ذریعہ ثالثی کرتے ہیں۔",
    "layer3_urdu": "سورہ ان ناس (114: 5) میں ، قرآن نے ایک ایسی قوت کی وضاحت کی ہے جو روحانی اور اخلاقی بدعنوانی کی لطیف ، ناگوار نوعیت کے لئے \"انسانیت کے سینوں میں سرگوشی کرتا ہے\"۔ عصر حاضر کے شیعہ اسکالرز ، جیسے آیت اللہ ناصر مکریم شیرازی ، اس بات پر زور دیتے ہیں کہ یہ \"واسوا\" (سرگوشی) محض فتنہ سے بالاتر ہے ، جو قوتوں کے خلاف ایک نفسیاتی اور وجودی جنگ کی عکاسی کرتا ہے جو انسانی خطرات کا استحصال کرتا ہے۔ جدید طافسر کام ، جیسے *الدھل فائی طافسیر القوران *، اس آیت کو شک ، خوف اور اخلاقی الجھن کے اندرونی ہونے سے جوڑتے ہیں ، اور اسے الہی رہنمائی اور انا ، معاشرتی دباؤ ، یا سیسٹیمیٹک غیرجانبدار کی غیر مستحکم وسوسوں کے مابین ایک لازوال جدوجہد کے طور پر تیار کرتے ہیں۔  \n\nنیورو سائنس ایک متوازی عینک پیش کرتا ہے: علمی تعصبات اور \"منفی تعصب\" (دماغ کے نقصان دہ محرکات کو ترجیح دینے کے لئے دماغ کا رجحان) کے بارے میں مطالعات) کپٹی وسوسوں کے قرآنی تصور کو آئینہ دار کرتے ہیں۔ مثال کے طور پر ، سوشل میڈیا الگورتھم ، تفرقہ انگیز یا اضطراب پیدا کرنے والے مواد کو بڑھاوا دیتے ہیں ، جس سے ایک جدید \"سرگوشی\" پیدا ہوتا ہے جو برادریوں اور ایندھنوں کو پولرائزیشن کو تحلیل کرتا ہے۔ ڈاکٹر محمد علی شومالی جیسے اسکالرز اس کو آیت کی انتباہ سے مربوط کرتے ہیں ، اور مومنین پر زور دیتے ہیں کہ وہ * تقوا * (ذہن سازی سے آگاہی) کاشت کریں اور ہیرا پھیری کے بیانیے کے خلاف مزاحمت کے ل critical تنقیدی سوچ۔  \n\nعالمی سطح پر ، یہ آیت غلط معلومات ، ذہنی صحت کی جدوجہد اور اخلاقی نسبت پسندی جیسے بحرانوں کے درمیان گونجتی ہے۔ ڈاکٹر لییاکات تکیم جیسے فلسفیوں نے اس کی بین المذاہب مطابقت کو اجاگر کیا: بدھ مت کی توجہ \"شیطان کے جھوٹ\" کے خلاف مزاحمت پر \"ذہنی عیبوں\" اور عیسائی تعلیمات پر قابو پانے پر مرکوز ہے۔ کثیر الثقافتی معاشروں میں ، آیت اس بات پر اجتماعی عکاسی کی دعوت دیتی ہے کہ کس طرح سیسٹیمیٹک عدم مساوات - معاشی لالچ ، نسلی تعصب - معاشرتی \"وسوسے\" کے طور پر انسانیت کا حامل ہے جو نقصان کو معمول بناتا ہے۔  \n\nبالآخر ، سورہ ان ناس 114: 5 جدید مومنین کو روحانی چوکسی ، معاشرتی یکجہتی ، اور اخلاقی عمل کے ذریعہ داخلی اور بیرونی دونوں بدعنوانیوں کو پہچاننے اور ان کے خلاف مزاحمت کرنے کا چیلنج ہے۔",
    "layer4_urdu": "سورہ ان ناس میں ، اللہ نے پوشیدہ دشمن کے خلاف انسانیت کو متنبہ کیا ہے جو \"انسانیت کے سینوں میں برائی کو سرگوشی کرتا ہے۔\" اہل بیت (ان پر سلامتی ہے) یہ سکھاتا ہے کہ یہ \"سرگوشی\" (واسواساہ) بیرونی اور داخلی دونوں طیاروں پر کام کرتا ہے۔ امام علی (اس پر سلامتی) *ناہج البالاگھا *میں وضاحت کرتے ہیں: \"سب سے بدترین ساتھی خود (نفش) ہے جو برائی کی طرف مستقل طور پر دعوت دیتا ہے۔ اس آیت سے یہ پتہ چلتا ہے کہ شیطان کی وسوسے ہماری اپنی غیر جانچ شدہ خواہشات اور شکوک و شبہات کے ذریعہ ظاہر ہوتی ہیں ، جس سے انسانی دل کو خدائی رہنمائی اور تباہ کن جذبات کے مابین جنگ کا میدان بن جاتا ہے۔\n\nامام جعفر السادق (اس پر امن) نے سکھایا کہ یہاں ذکر کردہ \"چھاتی\" (سوڈور) روحانی مرکز کی علامت ہیں جہاں ایمان اور منافقت کا دعوی ہے۔ انہوں نے کہا: \"دل (قلب) امام [رہنمائی] یا شیطان کے تخت کا تخت ہے۔ اگر کوئی اللہ کی سرپرستی (ولیہ) کو پیش کرتا ہے تو ، دل کو اماموں کی روشنی سے روشن ہوجاتا ہے ، اندھیرے کو پیچھے چھوڑ دیتا ہے۔ اہل بیت کا ولیہ ، جس کا صاف ستھرا روحانی اسٹیشن مومنین کو ٹھیک ٹھیک بدعنوانیوں سے بچاتا ہے۔\n\nلیڈی فاطمہ (اس پر امن ہے) نے اپنی مشہور التجا کے ذریعہ وسوسوں کے خلاف دفاع کی مثال دی: \"اے اللہ! میرے دل کو منافقت اور اپنے اعمال سے نمائش سے پاک کرو۔\" امامہ کے شعور کے ساتھ سورہ ان ناس کی تلاوت کرنا ، پنجیٹن کے ناموں کے ذریعہ اللہ میں پناہ لینا ، اور امام زین ال ابائڈین کے * ڈو العکاریم الاخلاق * پر روح کو تبدیل کرنے کے لئے عکاسی کرنا اہم اقدامات ہیں۔ وسوسوں سے حقیقی حفاظت محض گناہ سے بچنے سے نہیں ، بلکہ ان کی کامل ریاستوں کے علم ، محبت اور مشابہت کے ذریعہ چودہ انفلیبلز کی برائٹ موجودگی سے دل کو بھر کر۔",
    "layer5": "In interpreting Surah An-Naas 114:5, both Shia and Sunni exegetical traditions converge on identifying the \"whisperer\" (al-waswas) as Satan (Iblis) or his agents seeking to corrupt human hearts. Al-Tabari (Sunni) and Al-Tabrisi (Shia) in their respective tafsirs affirm this core understanding, emphasizing Satan’s persistent attempts to incite doubt and sin through subtle insinuations. Al-Qurtubi (Sunni) and Al-Tabtabai (Shia) further agree that the verse underscores humanity’s existential vulnerability to spiritual corruption, necessitating divine protection through Quranic recitation and piety.\n\nDivergences emerge in theological nuances. Sunni commentators like Ibn Kathir and Al-Razi focus on Satan’s external influence, interpreting \"breasts\" (sudur) metaphorically as the locus of inner thoughts. This aligns with Sunni emphasis on individual accountability and direct engagement with scripture for protection. In contrast, Shia sources like Tafsir al-Qummi and Al-Tusi’s At-Tibyan, while acknowledging Satan’s role, often expand the concept of \"waswas\" to include broader metaphysical forces of evil, occasionally referencing the corrupting influence of tyrannical rulers (taghut) as manifestations of satanic whisperers. Al-Mizan by Al-Tabtabai introduces an ontological dimension, framing the struggle against whispers as integral to the soul’s purification under the guidance of the Ahl al-Bayt.\n\nThese distinctions subtly influence religious practice: Sunni traditions prioritize personal supplication and adherence to Quranic rituals, while Shia spirituality frequently incorporates seeking intercession through the Imams as spiritual shields. Historically, Shia interpretations developed within contexts of political oppression, explaining their broader application of \"evil whispers\" to systemic injustice. Both traditions, however, unite in viewing the verse as a call to constant vigilance against spiritual decay, reflecting shared Islamic ethical concerns despite differing hermeneutical frameworks.",
    "layer5_urdu": "سورہ ان ناس 114: 5 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں طرح کی روایات \"وسوسے دار\" (الاوسواس) کو شیطان (ابلیس) یا اس کے ایجنٹوں کو انسانی دلوں کو بدعنوان کرنے کی کوشش کرنے پر شناخت کرنے پر متحرک ہوجاتی ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) نے اپنے اپنے طافیروں میں اس بنیادی تفہیم کی تصدیق کی ہے ، اور لطیف insinuations کے ذریعہ شیطان کی شکوک و شبہات کو جنم دینے کی مستقل کوششوں پر زور دیا ہے۔ القوروبی (سنی) اور التبٹابائی (شیعہ) مزید اس بات پر متفق ہیں کہ یہ آیت انسانیت کی روحانی بدعنوانی کے وجود کو ظاہر کرتی ہے ، اور قرآنی تلاوت اور تقویٰ کے ذریعہ الہی تحفظ کی ضرورت ہے۔\n\nمذہبی باریکیوں میں تغیرات ابھرتے ہیں۔ ابن کتھیر اور الراجی جیسے سنی مبصرین شیطان کے بیرونی اثر و رسوخ پر توجہ مرکوز کرتے ہیں ، اور \"سینوں\" (سوڈور) کو استعاراتی طور پر اندرونی خیالات کے لوکس کی ترجمانی کرتے ہیں۔ یہ انفرادی احتساب اور تحفظ کے لئے صحیفہ کے ساتھ براہ راست مشغولیت پر سنی زور کے ساتھ ہم آہنگی کرتا ہے۔ اس کے برعکس ، شیعہ ذرائع جیسے طافسیر القومی اور التوسی کے ات-تبیان ، شیطان کے کردار کو تسلیم کرتے ہوئے ، اکثر \"واسوا\" کے تصور کو وسعت دیتے ہیں تاکہ برائی کی وسیع تر استعاریاتی قوتوں کو شامل کیا جاسکے ، اور کبھی کبھار ظالم حکمرانوں (ٹیگھوت) کے بدترین اثر و رسوخ کا حوالہ دیتے ہوئے شیطانی حکمرانوں کے بدعنوانی کا حوالہ دیتے ہیں۔ المزان از ال تبتابائی نے ایک آنٹولوجیکل طول و عرض کا تعارف کرایا ، جس میں سرگوشیوں کے خلاف جدوجہد کو اے ایچ ایل البیٹ کی رہنمائی میں روح کے طہارت کے لازمی قرار دیا گیا ہے۔\n\nیہ امتیازات مذہبی رواج پر پوری طرح اثر انداز ہوتے ہیں: سنی روایات قرآنی رسومات کی ذاتی فراہمی اور اس پر عمل پیرا ہونے کو ترجیح دیتی ہیں ، جبکہ شیعہ روحانیت اکثر اماموں کے ذریعے روحانی ڈھال کے طور پر شفاعت کے حصول کو شامل کرتی ہے۔ تاریخی طور پر ، شیعہ تشریحات سیاسی جبر کے سیاق و سباق میں تیار ہوئی ہیں ، جس نے نظامی ناانصافی کے بارے میں ان کے \"شیطان وسوسوں\" کے وسیع تر اطلاق کی وضاحت کی ہے۔ تاہم ، دونوں روایات اس آیت کو روحانی کشی کے خلاف مستقل چوکسی کے طور پر دیکھنے میں متحد ہوجاتی ہیں ، جو مختلف ہرمینیٹیکل فریم ورک کے باوجود مشترکہ اسلامی اخلاقی خدشات کی عکاسی کرتی ہیں۔",
    "layer2short": "In classical Shia exegesis, Surah al-Naas 114:5 is understood as a profound exploration of the subtlety and persistence of satanic influence on the human soul. The phrase *\"yuwaswisu fi sudur al-nas\"* (who whispers into the breasts of mankind) is analyzed by scholars such as Tabatabai in *Al-Mizan* and Tabrisi in *Majma al-Bayan* as a reference to the *waswas al-khannas*—the \"slinking whisperer\" (Q 114:4)—identified as Iblis or his agents. Tabrisi notes that the term *waswasa* denotes repeated, insidious suggestions that exploit human vulnerabilities, targeting the *sudur* (breasts/hearts) as the seat of spiritual and moral consciousness. This aligns with the Shia emphasis on the heart’s purity as a prerequisite for divine proximity, a theme recurrent in narrations from the Ahl al-Bayt.",
    "layer2short_urdu": "کلاسیکی شیعہ استقامت میں ، سورہ الناس 114: 5 کو انسانی روح پر شیطانی اثر و رسوخ کی لطیفیت اور استقامت کی گہری کھوج کے طور پر سمجھا جاتا ہے۔ *\"یوسویسو فائی سڈور النس\" *(جو بنی نوع انسان کے سینوں میں سرگوشی کرتے ہیں) کے فقرے کا تجزیہ *المزان *میں تبتابائی جیسے اسکالرز اور *مجمہ البیان *میں تبریسی جیسے *ہاڈس آئبل میں *vaswas الخنناس *-Q 114) کے حوالے سے کیا گیا ہے۔ تبریسی نے نوٹ کیا ہے کہ اصطلاح * واسواسا * بار بار ، کپٹی تجاویز کی نشاندہی کرتی ہے جو انسانی خطرات کا استحصال کرتی ہے ، اور * سوڈور * (چھاتیوں/دلوں) کو روحانی اور اخلاقی شعور کی نشست کے طور پر نشانہ بناتی ہے۔ یہ شیعہ کے ساتھ دل کی طہارت پر زور دینے کے ساتھ الہی قربت کی شرط کے طور پر ہم آہنگی کرتا ہے ، یہ ایک تھیم اے ایچ ایل ال بیت کی روایتوں میں بار بار ہوتا ہے۔"
  },
  "6": {
    "layer1": "In Surah An-Naas, verse 6 concludes the Quran’s final chapter by identifying the dual sources of spiritual harm: *min al-jinnati wa al-nas* (\"from among the jinn and mankind\"). This verse builds on the preceding call to seek refuge in Allah from the \"evil of the whisperer who withdraws\" (v. 4-5), clarifying that such whispers (*waswas*) arise not only from unseen forces like the jinn but also from tangible human influences. Classical Shia tafsir, such as Allama Tabatabai’s *Al-Mizan*, explains that while jinn represent hidden spiritual temptations—like doubt, despair, or arrogance—the \"nas\" (people) signify worldly harms, such as oppression, manipulation, or social corruption. The dual mention underscores Islam’s holistic view of evil: it is not confined to the supernatural but manifests in human actions and systems.  \n\nHistorically, this surah is linked to the Prophet Muhammad’s (saw) experience with dark magic, as narrated in Shia and Sunni sources. When a Jewish sorcerer bewitched him, the revelation of Surah An-Naas and Al-Falaq provided divine protection, illustrating their role in seeking refuge from both metaphysical and earthly harms. The term *jinnah* (from *janna*, \"to conceal\") refers to beings beyond human perception, while *nas* (people) highlights the tangible social sphere.  \n\nFor modern Muslims, this verse invites vigilance against both internal struggles (e.g., negative thoughts, moral complacency) and external injustices (e.g., peer pressure, systemic oppression). It teaches that spiritual safety requires dua, self-awareness, and active resistance to harmful societal norms. By reciting this surah, Shia tradition encourages reliance on Allah while embodying the Ahlul Bayt’s teachings: nurturing a pure heart (*qalbun salim*) and fostering communities grounded in justice, mirroring Imam Ali’s counsel to \"guard against the evil of the wicked, both seen and unseen.",
    "layer2": "In Surah An-Naas (114:6), the phrase *min al-jinnati wa al-nas* (\"from among the jinn and mankind\") concludes the call to seek refuge in Allah from the \"evil of the whisperer who withdraws.\" Classical Shia exegetes emphasize the comprehensive scope of this verse, underscoring the dual spiritual and corporeal dimensions of evil. Al-Tabrisi, in *Majma al-Bayan*, explains that the verse encompasses all sources of hidden and manifest harm, distinguishing between the covert whispers of the jinn and the overt corruption propagated by malevolent humans. This duality reflects the Qur’anic principle that evil operates through both unseen forces (*ghayb*) and tangible human agency, necessitating vigilance on multiple fronts.\n\nAl-Tabrisi and Al-Tabatabai (*Al-Mizan*) both highlight the theological significance of pairing jinn and humans here. The jinn, as beings of free will and subtlety, symbolize internalized temptations and doubts, while corrupt humans represent external societal or ideological threats. This aligns with the Shia understanding of *waswasa* (devilish insinuations) as a trial affecting both individual conscience and communal integrity. Imam Jafar al-Sadiq, as cited in classical sources, reportedly linked this verse to the necessity of seeking protection through divine guardianship (*wilayah*), particularly the guidance of the Ahl al-Bayt, who serve as a spiritual shield against misdirection.\n\nThe verse also resonates with Shia jurisprudence, which stresses the obligation to avoid collaboration with oppressive systems (*zulm*) and to recognize the moral responsibility of human actors in perpetuating injustice. The inclusion of \"mankind\" here implicitly critiques tyrannical rulers and false leaders—a recurring theme in Shia political theology—while affirming the believer’s duty to resist both hidden and manifest corruption through faith and ethical action. Thus, the verse encapsulates a holistic vision of spiritual and social resistance, rooted in tawhid and the immutable authority of divine guidance.",
    "layer3": "In contemporary Shia scholarship, Surah An-Naas 114:6 is often interpreted as a call to recognize the dual sources of harm—both visible (human) and unseen (jinn)—that threaten spiritual and societal equilibrium. Modern scholars like Sayyed Mohammed Hussein Fadlallah and Ayatollah Naser Makarem Shirazi emphasize that \"jinn\" here symbolizes not only metaphysical entities but also abstract forces of corruption, such as systemic oppression, ideological extremism, or the internalized whispers (*waswas*) of greed and hatred that plague modern societies. This aligns with psychological insights into cognitive biases and the \"inner critic,\" framing the verse as a warning against both external societal ills and internal moral decay.  \n\nScientifically, the verse invites reflection on humanity’s capacity for harm—from environmental destruction driven by consumerism (a \"human\" evil) to the unintended consequences of unchecked technological advancement (a \"jinn-like\" force beyond immediate perception). Socially, it resonates with global challenges like misinformation epidemics on social media, where both human actors (e.g., trolls) and algorithmic systems (modern \"jinn\") amplify division.  \n\nInterfaith dialogues highlight parallels: Buddhist teachings on overcoming inner *Mara* (illusion) and Christian concepts of spiritual warfare against \"principalities of darkness.\" Multiculturally, the verse underscores universal struggles against exploitation and dehumanization, urging collective resistance to forces like racism or economic inequality.  \n\nScholar Dr. Liyakat Takim (McMaster University) notes that this verse, paired with its Quranic context, empowers believers to actively \"seek refuge\" in divine guidance while engaging ethically with the world—a balance of *tawakkul* (trust in God) and social responsibility critical in an age of existential crises. Ultimately, it challenges us to confront both the seen and unseen \"evils\" corroding human dignity today.",
    "layer4": "In Surah An-Naas, Allah commands believers to seek refuge from \"the whisperer who withdraws\" arising \"from the jinn and mankind\" (114:4-6). The Ahlul Bayt (as) unveil profound layers of this verse, teaching that the greatest \"hidden whisperers\" are the enemies of divine guidance who corrupt hearts through doubt, misguidance, and rebellion against Wilayah. Imam Ali (as) states: *\"The most dangerous jinn are the rebellious humans who make their tongues the arrows of Satan.\"*  \n\nImam Jafar al-Sadiq (as) explains that \"whisperers from mankind\" include those who spread spiritual poison through false ideologies, distorted interpretations of faith, and opposition to the Imams of Truth. The \"jinn\" here also symbolize the inner demons of the nafs (lower self) – envy, arrogance, and worldly attachment – which collaborate with external tempters. Lady Fatimah (as) taught: *\"The most destructive jinn is the unchecked ego; its whispers uproot the tree of iman.\"*  \n\nThe Shia spiritual tradition emphasizes that true protection lies in anchoring oneself to the \"rope of Allah\" – the Wilayah of the Ahlul Bayt. Reciting this Surah while consciously seeking refuge in the purified Imams (as) creates a fortress against visible and invisible harm. Imam Zain al-Abidin (as) advises in Sahifa Sajjadiyya: *\"When whispers assail you, renew your covenant with Muhammad and his Family – for their light disperses the shadows of doubt.\"*  \n\nPractical guidance:  \n1. Begin each day by reciting Surah An-Naas with the intention of seeking protection through the spiritual authority (Imamah) of the Ahlul Bayt.  \n2. Reflect on interactions and thoughts – discern whether they align with the Qur'an and the Imams' teachings.  \n3. Combat internal \"jinn\" through constant dhikr (e.g., \"Ya Ali\" or \"La hawla wa la quwwata illa billah\") to purify the soul.  \n\nAs Imam Ali (as) warned: *\"The human shaytan is more fatal than the jinn shaytan – he walks on two legs.\"* Only through conscious adherence to divine guardianship can we neutralize both forms of evil whispering.",
    "layer1_urdu": "سورہ ان ناس میں ، آیت 6 نے روحانی نقصان کے دوہری ذرائع کی نشاندہی کرتے ہوئے قرآن مجید کے آخری باب کا اختتام کیا: * من الجناتی وا الناس * (\"جین اور بنی نوع انسان کے درمیان سے\")۔ یہ آیت \"\" وسوسے کی برائی \"(v. 4-5) سے اللہ میں پناہ لینے کے لئے سابقہ کال پر استوار ہے ، یہ واضح کرتی ہے کہ اس طرح کی سرگوشیوں (*wiswas*) نہ صرف جن جیسی غیب قوتوں سے پیدا ہوتی ہے بلکہ ٹھوس انسانی اثرات سے بھی پیدا ہوتی ہے۔ کلاسیکی شیعہ طافسر ، جیسے علامہ تبتابائی کے *المزان *، نے وضاحت کی ہے کہ جب جن پوشیدہ روحانی فتنوں کی نمائندگی کرتے ہیں-جیسے شک ، مایوسی ، یا تکبر-\"ناس\" (لوگ) دنیاوی نقصانات کی نشاندہی کرتے ہیں ، جیسے ظلم ، ہیرا پھیری ، یا معاشرتی بدعنوانی۔ دوہری تذکرہ برائی کے بارے میں اسلام کے جامع نظریہ کی نشاندہی کرتا ہے: یہ مافوق الفطرت تک ہی محدود نہیں ہے بلکہ انسانی اعمال اور نظاموں میں ظاہر ہوتا ہے۔  \n\nتاریخی طور پر ، یہ سور surah حضرت محمد صلی اللہ علیہ وآلہ وسلم کے تاریک جادو کے تجربے سے منسلک ہے ، جیسا کہ شیعہ اور سنی ذرائع میں بیان کیا گیا ہے۔ جب ایک یہودی جادوگر نے اسے حیرت زدہ کردیا تو ، سورہ ان ناس اور الفالق کے انکشاف نے الہی تحفظ فراہم کیا ، جس نے استعاریاتی اور زمینی دونوں نقصانات سے پناہ حاصل کرنے میں ان کے کردار کو واضح کیا۔ اصطلاح *جناح *( *جننا *سے ، \"چھپانا\") سے مراد انسانی تاثرات سے بالاتر انسانوں سے ہے ، جبکہ *ناس *(لوگ) ٹھوس معاشرتی دائرے کو اجاگر کرتے ہیں۔  \n\nجدید مسلمانوں کے لئے ، یہ آیت دونوں داخلی جدوجہد (جیسے منفی خیالات ، اخلاقی خوشحالی) اور بیرونی ناانصافیوں (جیسے ہم مرتبہ کے دباؤ ، سیسٹیمیٹک ظلم و ستم) کے خلاف چوکسی کی دعوت دیتی ہے۔ یہ سکھاتا ہے کہ روحانی حفاظت کے لئے دائرہ کار ، خود آگاہی ، اور نقصان دہ معاشرتی اصولوں کے خلاف فعال مزاحمت کی ضرورت ہے۔ اس سورہ کی تلاوت کرتے ہوئے ، شیعہ روایت اللہ پر انحصار کی حوصلہ افزائی کرتی ہے جبکہ اہل بیت کی تعلیمات کو مجسم بناتے ہوئے: خالص دل (*قلبن سلیم*) کی پرورش اور انصاف کی بنیاد پر رہنے والی برادریوں کو فروغ دینا ، امام علی کے مشورے کو \"دج کی برائی سے بچانے کے لئے ، دیکھا اور غیب دونوں۔",
    "layer2_urdu": "سورہ ان ناس (114: 6) میں ، جملہ * من الجینتی وا الناس * (\"جن اور بنی نوع انسان کے درمیان\") نے \"سرگوشی کرنے والے کی برائی جو\" واپس لینے \"سے اللہ میں پناہ لینے کے لئے مطالبہ کیا ہے۔ کلاسیکی شیعہ استثنیٰ اس آیت کے جامع دائرہ کار پر زور دیتے ہیں ، اور برائی کے دوہری روحانی اور جسمانی جہتوں کی نشاندہی کرتے ہیں۔ *مجس البیان *میں ، الاتبریسی نے وضاحت کی ہے کہ اس آیت میں پوشیدہ اور ظاہر ہونے والے نقصان کے تمام ذرائع کو شامل کیا گیا ہے ، جو جن کے خفیہ سرگوشیوں اور بدعنوانی کے انسانوں کی طرف سے پھیلائی جانے والی بدعنوانی کے درمیان فرق ہے۔ یہ دوہری قرآنی اس اصول کی عکاسی کرتا ہے جو برائی دونوں غیب قوتوں (*غیب*) اور ٹھوس انسانی ایجنسی کے ذریعہ چلتی ہے ، جس سے متعدد محاذوں پر چوکسی کی ضرورت ہوتی ہے۔\n\nالاتبریسی اور الاتعباتابائی (*العزان*) دونوں جن اور انسانوں کی جوڑی کی مذہبی اہمیت کو اجاگر کرتے ہیں۔ جنن ، آزاد مرضی اور لطیفیت کے مخلوق کے طور پر ، اندرونی لالچوں اور شکوک و شبہات کی علامت ہے ، جبکہ بدعنوان انسان بیرونی معاشرتی یا نظریاتی خطرات کی نمائندگی کرتے ہیں۔ یہ انفرادی ضمیر اور فرقہ وارانہ سالمیت دونوں کو متاثر کرنے والی آزمائش کے طور پر * واسواسا * (شیطانی اشارے) کی شیعہ تفہیم کے ساتھ ہم آہنگ ہے۔ امام جعفر السادق ، جیسا کہ کلاسیکی ذرائع میں پیش کیا گیا ہے ، مبینہ طور پر اس آیت کو خدائی سرپرستی (*ولیہ*) کے ذریعے تحفظ کے حصول کی ضرورت سے جوڑ دیا ، خاص طور پر اہل البیت کی رہنمائی ، جو غلط سمت کے خلاف روحانی ڈھال کا کام کرتے ہیں۔\n\nیہ آیت شیعہ فقہ کے ساتھ بھی گونجتی ہے ، جو جابرانہ نظام (*زولم*) کے ساتھ تعاون سے بچنے اور ناانصافی کو برقرار رکھنے میں انسانی اداکاروں کی اخلاقی ذمہ داری کو تسلیم کرنے کی ذمہ داری پر زور دیتی ہے۔ یہاں \"بنی نوع انسان\" کو شامل کرنا واضح طور پر ظالم حکمرانوں اور جھوٹے رہنماؤں پر تنقید کرتا ہے۔ یہ شیعہ سیاسی الہیات میں ایک بار بار چلنے والا موضوع ہے - جب کہ عقیدے اور اخلاقی عمل کے ذریعہ پوشیدہ اور ظاہر ہونے والے بدعنوانی دونوں کے خلاف مزاحمت کرنے کے لئے مومن کے فرض کی تصدیق کرتے ہیں۔ اس طرح ، آیت روحانی اور معاشرتی مزاحمت کے ایک جامع وژن کو سمیٹتی ہے ، جس کی جڑیں توہید اور الہی رہنمائی کے غیر منقولہ اتھارٹی میں جڑی ہوئی ہیں۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ ان ناس 114: 6 کو اکثر نقصان کے دوہری ذرائع کو تسلیم کرنے کی کال کے طور پر سمجھا جاتا ہے۔ سیئڈ محمد حسین فداللہ اور آیت اللہ ناصر نصر مکارم شیرازی جیسے جدید اسکالرز اس بات پر زور دیتے ہیں کہ یہاں \"جن\" نہ صرف استعاریاتی ہستیوں کی علامت ہے بلکہ بدعنوانی کی خلاصہ قوتوں کو بھی علامت ہے ، جیسے نظامی مظالم ، نظریاتی انتہا پسندی ، یا لالچ اور ہیٹریڈ کی اندرونی وسعتیں (*ہوش*)۔ یہ نفسیاتی بصیرت کے ساتھ علمی تعصبات اور \"اندرونی نقاد\" میں شامل ہے ، جس سے آیت کو بیرونی معاشرتی بیماریوں اور داخلی اخلاقی زوال دونوں کے خلاف انتباہ کے طور پر تیار کیا گیا ہے۔  \n\nسائنسی طور پر ، آیت انسانیت کے نقصان کی صلاحیت پر عکاسی کی دعوت دیتی ہے۔ معاشرتی طور پر ، یہ عالمی چیلنجوں سے گونجتا ہے جیسے سوشل میڈیا پر غلط معلومات کی وبائی امراض ، جہاں دونوں انسانی اداکار (جیسے ، ٹرول) اور الگورتھمک سسٹم (جدید \"جن\") ڈویژن کو بڑھا دیتے ہیں۔  \n\nبین المذاہب مکالمے متوازی کو اجاگر کرتے ہیں: \"اندھیرے کی دشمنی\" کے خلاف اندرونی * مارا * (وہم) اور روحانی جنگ کے عیسائی تصورات پر قابو پانے کے بارے میں بدھ مت کی تعلیمات۔ کثیر الثقافتی طور پر ، آیت استحصال اور غیر مہذب ہونے کے خلاف عالمگیر جدوجہد کی نشاندہی کرتی ہے ، اور نسل پرستی یا معاشی عدم مساوات جیسی قوتوں کے خلاف اجتماعی مزاحمت پر زور دیتی ہے۔  \n\nاسکالر ڈاکٹر لییاکات تکیم (میک ماسٹر یونیورسٹی) نے نوٹ کیا ہے کہ اس آیت نے اپنے قرآنی سیاق و سباق کے ساتھ جوڑا بنا ہوا ہے ، مومنین کو دنیا کے ساتھ اخلاقی طور پر مشغول کرتے ہوئے الہی رہنمائی میں فعال طور پر \"پناہ مانگنے\" کا اختیار دیتا ہے۔ آخر کار ، یہ ہمیں چیلنج کرتا ہے کہ آج کل انسانی وقار کو خراب کرنے والے اور نظر نہ آنے والی \"برائیوں\" کا مقابلہ کریں۔",
    "layer4_urdu": "سورہ ان ناس میں ، اللہ مومنین کو حکم دیتا ہے کہ وہ \"سرگوشی کرنے والے\" سے پناہ حاصل کریں جو جن اور بنی نوع انسان سے \"پیدا ہونے والے\" کو واپس لے لیتے ہیں \"(114: 4-6)۔ اہل بیت (ع) نے اس آیت کی گہری پرتوں کی نقاب کشائی کرتے ہوئے یہ تعلیم دی ہے کہ سب سے بڑا \"پوشیدہ سرگوشی\" خدائی رہنمائی کے دشمن ہیں جو شک ، غلط بیانی اور ولیہ کے خلاف بغاوت کے ذریعہ دل کو خراب کرتے ہیں۔ امام علی (ع) میں کہا گیا ہے: \"سب سے خطرناک جن باغی انسان ہیں جو اپنی زبان کو شیطان کے تیر بناتے ہیں۔\" * *  \n\nامام جعفر السادق (ع) نے وضاحت کی ہے کہ \"بنی نوع انسان سے سرگوشی کرنے والوں\" میں وہ لوگ شامل ہیں جو جھوٹے نظریات کے ذریعہ روحانی زہر پھیلاتے ہیں ، عقیدے کی مسخ شدہ تشریحات ، اور حقیقت کے اماموں کی مخالفت کرتے ہیں۔ یہاں \"جن\" نے این اے ایف ایس (لوئر سیلف) کے اندرونی شیطانوں - حسد ، تکبر ، اور دنیاوی وابستگی کی علامت بھی کی ہے - جو بیرونی فتنوں کے ساتھ تعاون کرتے ہیں۔ لیڈی فاطمہ (ع) نے سکھایا: *\"سب سے زیادہ تباہ کن جن غیر چیک شدہ انا ہے۔  \n\nشیعہ روحانی روایت اس بات پر زور دیتی ہے کہ حقیقی تحفظ خود کو \"اللہ کی رسی\" یعنی اہل بیت کے ولیہ کے ساتھ لنگر انداز کرنے میں ہے۔ اس سورہ کی تلاوت کرتے ہوئے شعوری طور پر صاف شدہ اماموں (ع) میں پناہ مانگنے سے مرئی اور پوشیدہ نقصان کے خلاف ایک قلعہ پیدا ہوتا ہے۔ امام زین العبدین (ع) ساہفا سججدیہ میں مشورہ دیتے ہیں: *\"جب وسوسے آپ پر حملہ کرتے ہیں تو ، محمد اور اس کے اہل خانہ کے ساتھ اپنے عہد کی تجدید کریں-کیونکہ ان کی روشنی شک کے سائے کو منتشر کرتی ہے۔\"  \n\nعملی رہنمائی:  \n1. اہل بیت کے روحانی اتھارٹی (امامہ) کے ذریعے تحفظ کے حصول کے ارادے سے سورہ ان ناس کی تلاوت کرکے ہر دن شروع کریں۔  \n2. بات چیت اور خیالات پر غور کریں - یہ معلوم کریں کہ آیا وہ قرآن اور اماموں کی تعلیمات کے ساتھ صف بندی کرتے ہیں۔  \n3. روح کو پاک کرنے کے لئے مستقل دھکر (جیسے ، \"یا علی\" یا \"لا ہلا وا لا کووواٹا الا بلہ\") کے ذریعے داخلی \"جن\" کا مقابلہ کریں۔  \n\nجیسا کہ امام علی (ع) نے متنبہ کیا: * \"انسانی شیتن جن شیتن سے زیادہ مہلک ہے۔ وہ دو پیروں پر چلتا ہے۔\" * صرف الہی سرپرستی میں شعوری طور پر عمل کرنے سے کیا ہم دونوں طرح کی برائی سرگوشی کو بے اثر کرسکتے ہیں۔",
    "layer5": "In interpreting Surah An-Naas 114:6, both Shia and Sunni exegetes broadly concur that the verse identifies the sources of evil whispers as originating from both jinn and humans. Al-Tabari (Sunni) and Al-Tusi (Shia) emphasize this duality, noting that spiritual corruption arises from visible and unseen realms. Al-Qurtubi and Al-Tabatabai similarly affirm that \"mankind\" here refers to malicious individuals who incite harm, while \"jinn\" denotes supernatural tempters, aligning with Quranic depictions of Iblis as a jinn (18:50). This reflects a shared ontological framework acknowledging multiple dimensions of evil.\n\nKey differences emerge in theological emphasis. Shia commentaries like Al-Qummi’s tafsir and Al-Tabrisi’s *Majma al-Bayan* often contextualize the verse within the necessity of divine guardianship (*walaya*), interpreting protection from evil as intrinsically tied to adherence to the Ahl al-Bayt. Al-Tabatabai’s *Al-Mizan* extends this to the metaphysical role of Imams in combating spiritual corruption. Sunni scholars like Ibn Kathir and Al-Razi, while acknowledging divine refuge, focus on individual piety and practical measures like Quranic recitation (*ruqya*), reflecting Sunni emphasis on personal responsibility and the primacy of textual sources.\n\nHistorically, these divergences stem from distinct epistemological priorities: Shia exegesis often integrates Imamite narratives, while Sunni works prioritize Prophetic traditions (*hadith*) and companion-based reports. Both traditions agree on the verse’s core warning against hidden and manifest evils but differ in framing spiritual remedy—Shia through Imamite intercession, Sunni through communal and individual practice. These interpretations shape devotional approaches, with Shia litanies frequently invoking the Imams’ authority, while Sunni practices emphasize Quranic and Prophetic supplications. Such variations illustrate how shared Quranic principles are enriched by complementary theological lenses.",
    "layer5_urdu": "سورہ ان ناس 114: 6 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں نے بڑے پیمانے پر اس بات پر اتفاق کیا ہے کہ اس آیت میں برے وسوسوں کے ذرائع کی نشاندہی کی گئی ہے جو جن اور انسانوں دونوں سے شروع ہوتی ہے۔ التباری (سنی) اور التوسی (شیعہ) اس دوہری پر زور دیتے ہیں ، یہ کہتے ہوئے کہ روحانی بدعنوانی مرئی اور غیب دائروں سے پیدا ہوتی ہے۔ القوروبی اور التباطابائی نے اسی طرح اس بات کی تصدیق کی ہے کہ یہاں \"بنی نوع انسان\" سے مراد بدنیتی پر مبنی افراد ہیں جو نقصان پہنچاتے ہیں ، جبکہ \"جن\" مافوق الفطرت فتنوں کی نشاندہی کرتے ہیں ، اور انبیلس کی قرآنی کی عکاسی کے ساتھ جنا (18:50) کی حیثیت سے صف بندی کرتے ہیں۔ یہ مشترکہ آنٹولوجیکل فریم ورک کی عکاسی کرتا ہے جو برائی کے متعدد جہتوں کو تسلیم کرتا ہے۔\n\nکلیدی اختلافات مذہبی زور میں ابھرتے ہیں۔ شیعہ تبصرے جیسے القومی کے طافسیر اور الاتبریسی کے*ماجما البیان*اکثر الہی سرپرستی (*والیا*) کی ضرورت کے اندر اس آیت کو سیاق و سباق میں لاتے ہیں ، اور برائی سے تحفظ کی ترجمانی کرتے ہیں جیسا کہ اے ایچ ایل البیٹ پر عمل پیرا ہونے کے لئے اندرونی طور پر بندھا ہوا ہے۔ روحانی بدعنوانی کا مقابلہ کرنے میں التبطابائی کا * المزان * اس کو اماموں کے استعاریاتی کردار تک بڑھاتا ہے۔ ابن کتھیر اور الراجی جیسے سنی اسکالرز ، الہی پناہ گاہ کو تسلیم کرتے ہوئے ، انفرادی تقویٰ اور عملی اقدامات جیسے قرآنی تلاوت (*روکیا*) پر توجہ مرکوز کرتے ہیں ، جو ذاتی ذمہ داری اور متنی ذرائع کی اولینیت پر سنی زور کی عکاسی کرتے ہیں۔\n\nتاریخی طور پر ، یہ تغیرات الگ الگ علمی ترجیحات سے پیدا ہوتے ہیں: شیعہ استثنیٰ اکثر امامیٹ بیانیے کو مربوط کرتا ہے ، جبکہ سنی کام پیشن گوئی کی روایات (*حدیث*) اور ساتھی پر مبنی رپورٹس کو ترجیح دیتے ہیں۔ دونوں روایات پوشیدہ اور ظاہر برائیوں کے خلاف آیت کی بنیادی انتباہ پر متفق ہیں لیکن روحانی علاج کو تیار کرنے میں مختلف ہیں۔ یہ تشریحات عقیدت مندانہ نقطہ نظر کی تشکیل کرتی ہیں ، شیعہ لیٹانیوں نے اکثر اماموں کے اختیارات کی درخواست کی ہے ، جبکہ سنی کے طریق کار قرآنی اور پیشن گوئی کی فراہمی پر زور دیتے ہیں۔ اس طرح کی مختلف حالتوں میں یہ واضح کیا جاتا ہے کہ مشترکہ قرآنی اصولوں کو تکمیلی مذہبی لینسوں کے ذریعہ افزودہ کیا جاتا ہے۔",
    "layer2short": "In Surah An-Naas (114:6), the phrase *min al-jinnati wa al-nas* (\"from among the jinn and mankind\") concludes the call to seek refuge in Allah from the \"evil of the whisperer who withdraws.\" Classical Shia exegetes emphasize the comprehensive scope of this verse, underscoring the dual spiritual and corporeal dimensions of evil. Al-Tabrisi, in *Majma al-Bayan*, explains that the verse encompasses all sources of hidden and manifest harm, distinguishing between the covert whispers of the jinn and the overt corruption propagated by malevolent humans. This duality reflects the Qur’anic principle that evil operates through both unseen forces (*ghayb*) and tangible human agency, necessitating vigilance on multiple fronts.",
    "layer2short_urdu": "سورہ ان ناس (114: 6) میں ، جملہ * من الجینتی وا الناس * (\"جن اور بنی نوع انسان کے درمیان\") نے \"سرگوشی کرنے والے کی برائی جو\" واپس لینے \"سے اللہ میں پناہ لینے کے لئے مطالبہ کیا ہے۔ کلاسیکی شیعہ استثنیٰ اس آیت کے جامع دائرہ کار پر زور دیتے ہیں ، اور برائی کے دوہری روحانی اور جسمانی جہتوں کی نشاندہی کرتے ہیں۔ *مجس البیان *میں ، الاتبریسی نے وضاحت کی ہے کہ اس آیت میں پوشیدہ اور ظاہر ہونے والے نقصان کے تمام ذرائع کو شامل کیا گیا ہے ، جو جن کے خفیہ سرگوشیوں اور بدعنوانی کے انسانوں کی طرف سے پھیلائی جانے والی بدعنوانی کے درمیان فرق ہے۔ یہ دوہری قرآنی اس اصول کی عکاسی کرتا ہے جو برائی دونوں غیب قوتوں (*غیب*) اور ٹھوس انسانی ایجنسی کے ذریعہ چلتی ہے ، جس سے متعدد محاذوں پر چوکسی کی ضرورت ہوتی ہے۔"
  }
}