{
  "1": {
    "layer1": "The opening verse of Surah At-Tin, *\"By the fig and the olive\" (Wat-Teeni waz-Zaytoon)*, uses two symbolic creations of Allah to draw attention to profound truths. In Shia tafsir, such divine oaths often highlight sacred places, spiritual principles, or lessons tied to human responsibility. Scholars like Allamah Tabatabai note that *At-Tin* (the fig) and *Az-Zaytun* (the olive) are not merely fruits but symbols of lands blessed by revelation. Many classical commentators link these to regions associated with prophets: the fig is connected to Damascus (where Prophet Yahya preached) and the olive to Jerusalem (linked to Prophet Isa), though some traditions also associate them with Kufa and Medina, centers of Islamic guidance tied to the Ahlul Bayt. These symbols evoke Allah’s covenant with humanity through His messengers and the sanctity of lands where divine wisdom flourished.\n\nHistorically, this Meccan surah was revealed during a period of intense opposition to the Prophet Muhammad (peace be upon him), serving as a reminder that just as past communities were tested, so too must the early Muslims remain steadfast. The verse’s imagery grounds spiritual truths in tangible creation, inviting reflection on Allah’s signs in nature. The olive, mentioned seven times in the Quran, symbolizes light, wisdom, and sustenance, while the fig represents fertility and the delicate balance of existence—both reflecting Allah’s intricate design.\n\nFor contemporary Muslims, this verse encourages gratitude for Allah’s blessings and awareness of the interconnectedness of faith, history, and nature. It calls for stewardship of the Earth’s resources, appreciation for the sacred geography of Islam, and mindfulness of the Prophets’ and Imams’ legacies. By contemplating such symbols, believers strengthen their connection to divine wisdom, recognizing that every aspect of creation—from a humble fig to the olive’s oil—carries lessons for those who reflect.",
    "layer2": "In *Tafsir al-Mizan*, Allama Tabatabai elucidates the symbolic resonance of the fig (*tin*) and olive (*zaytun*) in Surah At-Tin’s opening verse, interpreting them as references to sacred lands or spiritual archetypes. Drawing from traditions attributed to the Ahlul Bayt, he notes that the fig and olive may signify Mount Judi (associated with Prophet Nuh), Mount Sinai (linked to Prophet Musa), Jerusalem (connected to Prophet Isa), and Mecca or Medina—sites sanctified by divine revelation. Alternatively, Tabatabai suggests these symbols allude to Prophet Muhammad (peace be upon him) and Imam Ali (AS), whose combined roles embody the culmination of prophetic and walaya (divine guardianship) traditions. This duality reflects the Shia theological principle of *nass* (divine designation), underscoring the inseparable link between prophethood and Imamate.  \n\nTabrisi’s *Majma al-Bayan* corroborates this hermeneutical approach, noting that classical exegetes often interpreted the fig and olive as metaphors for divinely chosen individuals or communities. The olive, frequently cited in the Quran as a symbol of blessedness (e.g., in Surah Nur 24:35), is tied to the “light of guidance” manifested through the Imams. Shia theology uniquely posits that such cosmic oaths in the Quran implicitly affirm the necessity of the Ahlul Bayt as the preservers of tawhid (monotheism) and the interpreters of divine law. The verse’s subsequent emphasis on humanity’s creation in the “best stature” (95:4) and subsequent spiritual decline is thus understood through the lens of access to divine wisdom via the Imams, who safeguard the balance between human potential and divine accountability.  \n\nThis verse, while concise, encapsulates the Shia worldview: natural phenomena serve as reminders of divine covenants, and spiritual excellence is contingent upon allegiance to the divinely appointed guides—a theme recurrent in Shia jurisprudence and creed.",
    "layer3": "In contemporary Shia scholarship, Surah At-Tin’s opening oath by the fig and olive is often explored through layered lenses of ecology, social ethics, and spiritual symbolism. Ayatollah Naser Makarem Shirazi, in his *Tafsir Nemuneh*, notes that these fruits historically symbolize regions sacred to Abrahamic traditions—figs linked to Damascus and olives to Jerusalem—emphasizing humanity’s shared spiritual geography. Modern thinkers like Dr. Ali Reza Panahian extend this, framing the verse as a call to recognize nature’s inherent *ayat* (signs) and humanity’s custodianship over Earth’s bounty, resonating with today’s climate crisis.  \n\nScientifically, both figs and olives are celebrated for their health benefits—rich in antioxidants and anti-inflammatory properties—highlighting Islam’s alignment with holistic well-being. Scholars like Sheikh Mehdi Shomali connect this to contemporary public health challenges, urging communities to address food insecurity and promote sustainable agriculture. Philosophically, the pairing represents balance: the fig’s sweetness and olive’s bitterness mirror life’s dualities, a theme echoed in Imam Ali’s teachings on resilience.  \n\nSocially, the verse invites reflection on economic justice. Many olive-producing regions face exploitation in global trade networks; contemporary *maraji’* like Grand Ayatollah Sistani have emphasized fair labor practices, linking Quranic ethics to modern workers’ rights. Interfaithly, the olive’s prominence in Christian, Jewish, and Islamic rituals underscores shared values of peace and nourishment—a timely reminder for interreligious solidarity amid cultural polarization.  \n\nUltimately, this verse bridges reverence for creation with actionable ethics, urging believers to protect ecosystems, champion equity, and find unity in diversity—a roadmap for addressing today’s interconnected crises.",
    "layer4": "In the Name of Allah, the Most Gracious, the Most Merciful. The oath of \"the fig and the olive\" in Surah At-Tin carries profound spiritual secrets illuminated by the Ahlul Bayt (peace be upon them). Imam Ja'far al-Sadiq (peace be upon him) taught that the fig symbolizes Imam Hasan (peace be upon him) and the olive represents Imam Husayn (peace be upon him), as narrated in *Tafsir al-Qummi*. These two blessed trees allude to the twin lights of guidance emerging from the Prophetic lineage, embodying the perfection of human creation mentioned later in the Surah. The olive, specifically, connects to the \"Noor\" (Divine Light) of Wilayah, as the Quran states: \"Allah is the Light of the heavens and the earth\" (24:35), which Shia tradition links to the Imams as inheritors of this luminous guidance.\n\nLady Fatimah (peace be upon her) emphasized the spiritual significance of natural symbols in the Quran, stating: \"Every verse has an exterior (zahir) and an interior (batin), every limit has a foundation, and every word has a reality.\" The fig and olive thus transcend their material forms, pointing to the spiritual fruits borne by following the Ahlul Bayt. The olive tree’s oil, which \"neither of the east nor the west\" (24:35), symbolizes the universal and timeless nature of Imamah – a mercy beyond geographical or temporal bounds.\n\nPractical wisdom lies in contemplating how these symbols reflect the balance of knowledge (fig) and action (olive) required for spiritual growth. Imam Ali (peace be upon him) taught: \"Knowledge is a tree, and action is its fruit.\" To embody the \"best stature\" (95:4), believers must nourish their souls through loyalty (Tawalla) to the Ahlul Bayt and emulate their virtues – Imam Hasan’s forbearance and Imam Husayn’s steadfastness. Reciting this Surah with awareness of its inner meanings becomes an act of reaffirming Wilayah, the covenant that elevates humanity beyond the \"lowest of the low\" (95:5). Let every fig and olive we encounter remind us to seek the intercession of those whose very existence fulfills Allah’s oath.",
    "layer1_urdu": "سورہ اٹ ٹن کی افتتاحی آیت ، *\"انجیر اور زیتون کے ذریعہ\" (واٹ-ٹین واز زیتون) * *گہری سچائیوں کی طرف توجہ مبذول کروانے کے لئے اللہ کی دو علامتی تخلیقات کا استعمال کرتی ہے۔ شیعہ طافسیر میں ، اس طرح کے الہی قسمیں اکثر مقدس مقامات ، روحانی اصولوں ، یا انسانی ذمہ داری سے منسلک اسباق کو اجاگر کرتی ہیں۔ علامہ تبتابائی جیسے اسکالرز نوٹ کرتے ہیں کہ * ایٹ ٹن * (انجیر) اور * ایز زیتون * (زیتون) محض پھل نہیں ہیں بلکہ وحی سے برکت والی زمینوں کی علامت ہیں۔ بہت سارے کلاسیکی مبصرین ان کو نبیوں سے وابستہ خطوں سے جوڑتے ہیں: انجیر دمشق (جہاں نبی یحییٰ نے تبلیغ کی) اور زیتون سے یروشلم (نبی عیسیٰ سے منسلک) سے جڑا ہوا ہے ، حالانکہ کچھ روایات انہیں کوفا اور مدینہ کے ساتھ بھی منسلک ہیں ، جو اسلام بیت سے منسلک اسلامی رہنمائی کے مراکز ہیں۔ یہ علامتیں اللہ کے عہد کو انسانیت کے ساتھ اپنے میسینجرز اور ان زمینوں کے تقدس کے ذریعہ پیدا کرتی ہیں جہاں خدائی حکمت پروان چڑھتی ہے۔\n\nتاریخی طور پر ، اس میکن سورہ کا انکشاف حضرت محمد صلی اللہ علیہ وآلہ وسلم کی شدید مخالفت کے دوران ہوا تھا ، جس نے ایک یاد دہانی کے طور پر کام کیا تھا کہ جس طرح ماضی کی برادریوں کا تجربہ کیا گیا تھا ، اسی طرح ابتدائی مسلمان بھی مستحکم رہیں۔ آیت کی منظر کشی غیر معمولی تخلیق میں روحانی سچائیوں کی بنیاد رکھتی ہے ، اور فطرت میں اللہ کی علامتوں پر عکاسی کرتی ہے۔ زیتون ، جو قرآن مجید میں سات بار ذکر کیا گیا ہے ، روشنی ، حکمت اور رزق کی علامت ہے ، جبکہ انجیر زرخیزی اور وجود کے نازک توازن کی نمائندگی کرتا ہے۔ یہ دونوں اللہ کے پیچیدہ ڈیزائن کی عکاسی کرتے ہیں۔\n\nعصری مسلمانوں کے لئے ، یہ آیت اللہ کی برکتوں اور عقیدے ، تاریخ اور فطرت کے باہمی ربط کے بارے میں آگاہی کے لئے شکرگزار کی حوصلہ افزائی کرتی ہے۔ اس میں زمین کے وسائل کی ذمہ داری ، اسلام کے مقدس جغرافیہ کی تعریف ، اور انبیاء کی ذہنیت ’اور اماموں کی میراث کا مطالبہ کیا گیا ہے۔ اس طرح کی علامتوں پر غور کرنے سے ، مومنین الہی حکمت سے اپنے تعلق کو تقویت دیتے ہیں ، اور یہ تسلیم کرتے ہیں کہ تخلیق کے ہر پہلو - ایک شائستہ انجیر سے زیتون کے تیل تک - عکاسی کرنے والوں کے لئے سبق حاصل کرتے ہیں۔",
    "layer2_urdu": "*طافسیر المزان*میں ، علامہ تبتابائی نے سورہ اٹ ٹن کی افتتاحی آیت میں انجیر (*ٹن*) اور زیتون (*زیتون*) کی علامتی گونج کو واضح کیا ، اور انھیں مقدس زمینوں یا روحانی آثار قدیمہ کے حوالے سے تعبیر کیا۔ اہل بیت سے منسوب روایات سے متعلق ، وہ نوٹ کرتے ہیں کہ انجیر اور زیتون ماؤنٹ جوڈی (نبی نوح سے وابستہ) ، ماؤنٹ سینا (نبی موسیٰ سے منسلک) ، یروشلم (نبی عیسی سے منسلک) ، اور مکیکا یا میڈینا - جو الہی مذہب کے ذریعہ تقویت بخش ہیں۔ متبادل کے طور پر ، تبتابائی ان علامتوں کو نبی اکرم (ان پر امن) اور امام علی (ع) کی طرف اشارہ کرتے ہیں ، جن کے مشترکہ کردار پیشن گوئی اور والیا (الہی سرپرست) روایات کے خاتمے کو مجسم بناتے ہیں۔ یہ دوغلا پن * ناس * (الہی عہدہ) کے شیعہ مذہبی اصول کی عکاسی کرتا ہے ، جس میں پیشن گوئی اور امامیٹ کے مابین لازم و ملزوم روابط کی نشاندہی ہوتی ہے۔  \n\nتبریسی کے * مجس البیان * اس ہرمینیٹیکل نقطہ نظر کی تائید کرتے ہیں ، یہ کہتے ہوئے کہ کلاسیکی استثنیٰ اکثر انجیر اور زیتون کی ترجمانی الہی منتخب کردہ افراد یا برادریوں کے استعارے کے طور پر کرتے ہیں۔ زیتون ، جو اکثر قرآن مجید میں نعمت کی علامت کے طور پر پیش کیا جاتا ہے (جیسے ، سورہ نور 24:35 میں) ، اماموں کے ذریعے ظاہر ہونے والے \"لائٹ آف رہنمائی\" سے منسلک ہے۔ شیعہ الہیات انفرادی طور پر یہ کہتے ہیں کہ قرآن مجید میں اس طرح کے کائناتی حلف صالب بیت کی ضرورت کو توہڈ (توحید) اور الہی قانون کے ترجمانوں کے تحفظ کے طور پر واضح طور پر تصدیق کرتے ہیں۔ \"بہترین قد\" (95: 4) اور اس کے نتیجے میں روحانی زوال پر انسانیت کی تخلیق پر آیت کے بعد کے زور کو اس طرح اماموں کے ذریعہ الہی حکمت تک رسائی کے عینک کے ذریعے سمجھا جاتا ہے ، جو انسانی صلاحیت اور خدائی احتساب کے مابین توازن کی حفاظت کرتے ہیں۔  \n\nیہ آیت ، جبکہ جامع ، شیعہ کے عالمی نظریہ کو سمیٹتی ہے: قدرتی مظاہر خدائی عہدوں کی یاد دہانی کے طور پر کام کرتے ہیں ، اور روحانی فضیلت الہی مقرر کردہ رہنماؤں کی وفاداری کے مطابق ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ اٹ ٹن کی انجیر کے ذریعہ افتتاحی حلف اور زیتون کو اکثر ماحولیات ، معاشرتی اخلاقیات اور روحانی علامت کے پرتوں والے عینک کے ذریعے تلاش کیا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں ، نوٹ کیا ہے کہ یہ پھل تاریخی طور پر ابراہک روایات کے مقدس خطوں کی علامت ہیں۔ دمشق اور زیتون سے منسلک فگوں کو یروشلم سے منسلک - انسانیت کے مشترکہ روحانی جغرافیہ پر زور دینا۔ ڈاکٹر علی رضا پانہیان جیسے جدید مفکرین اس کو بڑھا دیتے ہیں ، اور اس آیت کو فطرت کے موروثی * آیت * (علامتوں) اور زمین کے فضل پر انسانیت کی تحویل کو تسلیم کرنے کی کال کے طور پر تیار کرتے ہیں ، جو آج کے آب و ہوا کے بحران سے گونجتے ہیں۔  \n\nسائنسی طور پر ، انجیر اور زیتون دونوں ان کے صحت سے متعلق فوائد کے لئے منائے جاتے ہیں۔ شیخ مہدی شومالی جیسے اسکالرز اس کو معاصر صحت عامہ کے چیلنجوں سے مربوط کرتے ہیں ، اور معاشروں پر زور دیتے ہیں کہ وہ غذائی عدم تحفظ سے نمٹنے اور پائیدار زراعت کو فروغ دیں۔ فلسفیانہ طور پر ، جوڑا توازن کی نمائندگی کرتا ہے: انجیر کی مٹھاس اور زیتون کی تلخی زندگی کی دوہریوں کی آئینہ دار ، ایک موضوع ، لچک سے متعلق امام علی کی تعلیمات میں گونج اٹھا۔  \n\nمعاشرتی طور پر ، آیت معاشی انصاف پر عکاسی کی دعوت دیتی ہے۔ بہت سے زیتون پیدا کرنے والے علاقوں کو عالمی تجارتی نیٹ ورکس میں استحصال کا سامنا کرنا پڑتا ہے۔ ہم عصر * مارجی ’ * جیسے گرینڈ آیت اللہ سسٹانی نے قرآنی اخلاقیات کو جدید کارکنوں کے حقوق سے جوڑتے ہوئے مزدوری کے منصفانہ طریقوں پر زور دیا ہے۔ بین الاقوامی سطح پر ، عیسائی ، یہودی اور اسلامی رسومات میں زیتون کی اہمیت امن اور پرورش کی مشترکہ اقدار کی نشاندہی کرتی ہے۔  \n\nآخر کار ، یہ آیت قابل عمل اخلاقیات کے ساتھ تخلیق کے لئے عقیدت مند ہے ، اور مومنوں کو ماحولیاتی نظام کی حفاظت ، چیمپئن ایکویٹی ، اور تنوع میں اتحاد تلاش کرنے کی تاکید کرتی ہے۔",
    "layer4_urdu": "اللہ کے نام پر ، سب سے زیادہ احسان مند ، سب سے زیادہ مہربان۔ سورہ ایٹ ٹن میں \"انجیر اور زیتون\" کا حلف اٹھاوول بیت (ان پر امن ہے) کے ذریعہ روشن روحانی راز ہے۔ امام جافر السادق (اس پر امن) نے یہ سکھایا کہ انجیر امام حسن کی علامت ہے (اس پر امن ہے) اور زیتون امام حسین (اس پر امن) کی نمائندگی کرتا ہے ، جیسا کہ *طافسیر القومی *میں بیان کیا گیا ہے۔ یہ دو مبارک درخت پیشن گوئی نسب سے ابھرتے ہوئے رہنمائی کی جڑواں روشنی کی طرف اشارہ کرتے ہیں ، اور بعد میں سورہ میں مذکور انسانی تخلیق کے کمال کو مجسم بناتے ہیں۔ زیتون ، خاص طور پر ، ولیہ کے \"نور\" (الہی روشنی) سے جڑتا ہے ، جیسا کہ قرآن مجید میں کہا گیا ہے: \"اللہ آسمانوں اور زمین کی روشنی ہے\" (24:35) ، جسے شیعہ روایت اس لیمین رہنمائی کے وارث کے طور پر اماموں سے جوڑتی ہے۔\n\nلیڈی فاطمہ (اس پر امن) نے قرآن مجید میں فطری علامتوں کی روحانی اہمیت پر زور دیا ، اور کہا: \"ہر آیت میں بیرونی (ظہیر) اور ایک داخلہ (بٹین) ہوتا ہے ، ہر حد کی ایک بنیاد ہوتی ہے ، اور ہر لفظ کی حقیقت ہوتی ہے۔\" اس طرح انجیر اور زیتون ان کی مادی شکلوں سے بالاتر ہیں ، اور اہل بیت کی پیروی کرکے پیدا ہونے والے روحانی پھلوں کی طرف اشارہ کرتے ہیں۔ زیتون کے درخت کا تیل ، جو \"نہ تو مشرق اور نہ ہی مغرب\" (24:35) ، امامہ کی عالمگیر اور لازوال نوعیت کی علامت ہے - جغرافیائی یا دنیاوی حدود سے بالاتر ایک رحمت۔\n\nعملی دانشمندی اس بات پر غور کرنے میں مضمر ہے کہ یہ علامت روحانی نشوونما کے ل required مطلوبہ علم (انجیر) اور عمل (زیتون) کے توازن کی عکاسی کرتی ہے۔ امام علی (اس پر امن) نے سکھایا: \"علم ایک درخت ہے ، اور عمل اس کا پھل ہے۔\" \"بہترین قد\" (95: 4) کو مجسم بنانے کے لئے ، مومنین کو لازمی طور پر اپنی جانوں کو وفاداری (طوالہ) کے ذریعہ اہل بیت سے پروان چڑھانا چاہئے اور ان کی خوبیوں کی تقلید کرنا چاہئے - امام حسن کی رواداری اور امام حسین کی ثابت قدمی۔ اس سورہ کو اپنے اندرونی معانیوں کے بارے میں شعور کے ساتھ تلاوت کرنا ولیہ کی تصدیق کرنے کا ایک عمل بن جاتا ہے ، یہ عہد جو انسانیت کو \"نچلے سے کم\" (95: 5) سے آگے بڑھاتا ہے۔ ہر انجیر اور زیتون کا سامنا کرنے دیں جس کا سامنا ہمیں ان لوگوں کی شفاعت حاصل کرنے کی یاد دلاتا ہے جن کا وجود اللہ کے حلف کو پورا کرتا ہے۔",
    "layer5": "In interpreting Surah At-Tin 1 (“By the fig and the olive”), Shia and Sunni exegetes exhibit both shared symbolic frameworks and distinct theological emphases. Classical scholars across traditions, including Tabari (Sunni) and Tabrisi (Shia), acknowledge the fig and olive as symbols of sacred lands or divine blessings. Many agree these refer to locations associated with prophetic history: Tabari and Al-Mizan (Tabatabai) both cite Jerusalem (Mount Zion) and its olive groves, while Ibn Kathir and Majma al-Bayan (Tabrisi) link them to Damascus and Mount Sinai, reflecting a shared reverence for Abrahamic holy sites.  \n\nDivergences emerge in allegorical extensions. Shia commentaries like Tafsir al-Qummi (Qummi) and Al-Mizan often connect the verse to the Ahlul Bayt, interpreting the fig as Prophet Muhammad and the olive as Imam Ali, symbolizing their inseparable spiritual legacy. This reflects the Shia theological emphasis on walaya (divine guardianship through the Imams). Sunni exegetes such as Qurtubi and Razi, while acknowledging the verse’s symbolic depth, generally avoid explicit links to specific figures beyond prophets like Jesus or Abraham, prioritising broader ethical lessons on human potential and divine justice.  \n\nThese differences stem from distinct hermeneutical priorities: Shia tafsir integrates the ontological status of the Imams as inheritors of prophetic wisdom, whereas Sunni interpretations often emphasise historical and moral dimensions. While neither tradition disputes the verse’s divine oath or its connection to human accountability (developed in subsequent verses), the Shia focus on the Imamate’s cosmic role influences devotional practices, such as invoking the Ahlul Bayt in supplications. Sunni applications typically stress individual piety aligned with prophetic teachings.  \n\nHistorically, these interpretive trajectories reflect early theological developments: Shia exegesis evolved within frameworks of Imam Ali’s spiritual authority, while Sunni scholarship consolidated around preserving the Prophetic Sunnah. Both traditions, however, uphold the Quran’s multilayered symbolism, demonstrating Islam’s rich exegetical diversity within a unified theological ethos.",
    "layer5_urdu": "سورہ ایٹ ٹن 1 (\"انجیر اور زیتون کے ذریعہ\") کی ترجمانی کرتے ہوئے ، شیعہ اور سنی کی نمائندگی دونوں مشترکہ علامتی فریم ورک اور الگ الگ مذہبی زور کی نمائش کرتی ہے۔ روایات کے کلاسیکی اسکالرز ، بشمول تباری (سنی) اور تبریسی (شیعہ) ، انجیر اور زیتون کو مقدس زمینوں یا خدائی نعمتوں کی علامت کے طور پر تسلیم کرتے ہیں۔ بہت سے لوگ اس بات پر متفق ہیں کہ پیشن گوئی کی تاریخ سے وابستہ مقامات کا حوالہ دیتے ہیں: تباری اور المزان (تبتابائی) دونوں نے یروشلم (ماؤنٹ زیون) اور اس کے زیتون کی نالیوں کا حوالہ دیا ہے ، جبکہ ابن کتھیر اور ماجما البیان (تبریسی) انہیں ابراسک مقدس کے لئے مشترکہ عقیدت کی عکاسی کرتے ہیں۔  \n\nتخیلاتی توسیع میں تغیرات ابھرتے ہیں۔ شیعہ تبصرے جیسے طافسیر القومی (قمی) اور المزان اکثر اس آیت کو اہل بیت سے جوڑتے ہیں ، اور انجیر کی ترجمانی کرتے ہیں کہ ان کی لازم و ملزوم روحانی میراث کی علامت ہیں۔ اس سے والیا (اماموں کے ذریعے خدائی سرپرستی) پر شیعہ مذہبی زور کی عکاسی ہوتی ہے۔ سنی استثنیٰ جیسے قربانی اور رازی ، جبکہ آیت کی علامتی گہرائی کو تسلیم کرتے ہوئے ، عام طور پر عیسیٰ یا ابراہیم جیسے نبیوں سے پرے مخصوص شخصیات کے واضح روابط سے پرہیز کرتے ہیں ، جو انسانی صلاحیتوں اور الہی انصاف پر وسیع تر اخلاقی سبق کو ترجیح دیتے ہیں۔  \n\nیہ اختلافات الگ الگ ہرمینیٹیکل ترجیحات سے پیدا ہوتے ہیں: شیعہ طافسیر اماموں کی آنٹولوجیکل حیثیت کو پیشن گوئی کی حکمت کے وارث کے طور پر مربوط کرتی ہے ، جبکہ سنی تشریحات اکثر تاریخی اور اخلاقی جہتوں پر زور دیتے ہیں۔ اگرچہ نہ تو روایت آیت کے خدائی حلف یا اس کے انسانی احتساب سے اس کے تعلق (اس کے بعد کی آیات میں تیار کی گئی ہے) پر اختلاف نہیں کرتی ہے ، لیکن شیعہ امامیٹ کے کائناتی کردار پر توجہ مرکوز کرتے ہیں ، جیسے کہ Ahlul بائٹ کو التجا میں شامل کرنا۔ سنی ایپلی کیشنز عام طور پر انفرادی تقویٰ پر زور دیتے ہیں جو پیشن گوئی کی تعلیمات کے ساتھ منسلک ہوتے ہیں۔  \n\nتاریخی طور پر ، یہ تشریحی رفتار ابتدائی مذہبی پیشرفتوں کی عکاسی کرتی ہے: شیعہ استثنیٰ امام علی کے روحانی اتھارٹی کے فریم ورک کے اندر تیار ہوا ، جبکہ سنی اسکالرشپ نے پیشن گوئی سنت کو محفوظ رکھنے کے ارد گرد مستحکم کیا۔ تاہم ، دونوں روایات قرآن مجید کی کثیر الجہتی علامت کو برقرار رکھتی ہیں ، جو ایک متحد مذہبی اخلاقیات کے اندر اسلام کی بھرپور مبتلا تنوع کا مظاہرہ کرتی ہیں۔",
    "layer2short": "In *Tafsir al-Mizan*, Allama Tabatabai elucidates the symbolic resonance of the fig (*tin*) and olive (*zaytun*) in Surah At-Tin’s opening verse, interpreting them as references to sacred lands or spiritual archetypes. Drawing from traditions attributed to the Ahlul Bayt, he notes that the fig and olive may signify Mount Judi (associated with Prophet Nuh), Mount Sinai (linked to Prophet Musa), Jerusalem (connected to Prophet Isa), and Mecca or Medina—sites sanctified by divine revelation. Alternatively, Tabatabai suggests these symbols allude to Prophet Muhammad (peace be upon him) and Imam Ali (AS), whose combined roles embody the culmination of prophetic and walaya (divine guardianship) traditions. This duality reflects the Shia theological principle of *nass* (divine designation), underscoring the inseparable link between prophethood and Imamate.  ",
    "layer2short_urdu": "*طافسیر المزان*میں ، علامہ تبتابائی نے سورہ اٹ ٹن کی افتتاحی آیت میں انجیر (*ٹن*) اور زیتون (*زیتون*) کی علامتی گونج کو واضح کیا ، اور انھیں مقدس زمینوں یا روحانی آثار قدیمہ کے حوالے سے تعبیر کیا۔ اہل بیت سے منسوب روایات سے متعلق ، وہ نوٹ کرتے ہیں کہ انجیر اور زیتون ماؤنٹ جوڈی (نبی نوح سے وابستہ) ، ماؤنٹ سینا (نبی موسیٰ سے منسلک) ، یروشلم (نبی عیسی سے منسلک) ، اور مکیکا یا میڈینا - جو الہی مذہب کے ذریعہ تقویت بخش ہیں۔ متبادل کے طور پر ، تبتابائی ان علامتوں کو نبی اکرم (ان پر امن) اور امام علی (ع) کی طرف اشارہ کرتے ہیں ، جن کے مشترکہ کردار پیشن گوئی اور والیا (الہی سرپرست) روایات کے خاتمے کو مجسم بناتے ہیں۔ یہ دوغلا پن * ناس * (الہی عہدہ) کے شیعہ مذہبی اصول کی عکاسی کرتا ہے ، جس میں پیشن گوئی اور امامیٹ کے مابین لازم و ملزوم روابط کی نشاندہی ہوتی ہے۔  "
  },
  "2": {
    "layer1": "In Surah At-Tin, Allah swears by sacred places and symbols to affirm profound truths about human purpose. The phrase *wa Toori Seeneen* (\"And by Mount Sinai\") refers to the mountain where Prophet Musa (AS) received divine revelation, including the Torah. This oath connects to the broader theme of the surah, which contrasts humanity’s spiritual potential with the consequences of rejecting truth. The *Toor* (mountain) symbolizes stability and grandeur, while *Seeneen* linguistically links to both Sinai (*Sina*) and blessings (*sanaan*), reflecting its dual role as a site of revelation and a symbol of divine favor.\n\nShia tafsir, as noted by scholars like Allamah Tabatabai, emphasizes that such oaths in the Quran highlight the sanctity of places tied to prophetic missions. Mount Sinai represents the covenant between Allah and His messengers, underscoring the responsibility of humans to uphold divine guidance. Historically, this verse reminds believers of the continuity of revelation—from Musa’s Torah to the final message of Prophet Muhammad (SAW)—and the necessity of heeding the successors of prophethood, namely the Ahlul Bayt (AS), who preserved and explained Islamic teachings.\n\nFor contemporary Muslims, this verse invites reflection on steadfastness in faith. Just as mountains stand firm, believers are called to remain rooted in Quranic principles amid life’s challenges. It also reinforces the importance of sacred spaces—not just physical locations like Sinai or Mecca, but the spiritual \"mountains\" in our lives, such as moments of prayer, moral decisions, or adherence to justice. By aligning with the divine wisdom symbolized by *Toor Seeneen*, Muslims can embody the \"best stature\" mentioned in the surah, striving for spiritual elevation through faith and righteous action.",
    "layer2": "In Surah At-Tin (95:2), the divine oath \"وَطُورِ سِينِينَ\" (\"And [by] Mount Sinai\") is interpreted by classical Shia exegetes as a profound allusion to the sanctity of divine revelation and the covenant between God and His chosen guides. Both Allama Tabatabai in *Al-Mizan* and Sheikh Tabrisi in *Majma al-Bayan* emphasize that Mount Sinai (Tur Sinin) symbolizes the locus of divine communication with Prophet Musa (Moses), where the Torah was revealed as a manifestation of God’s legislative wisdom. Tabrisi notes that \"Sinin\" linguistically denotes \"blessed\" or references the mountain’s dual prominence in hosting both Musa’s prophethood and the subsequent spiritual legacy tied to the Ahlul Bayt, who embody the continuity of divine guidance.\n\nTabatabai expands this theological framework, arguing that such oaths in the Quran serve to elevate human consciousness toward the interconnectedness of creation, revelation, and moral accountability. The mountain’s sanctity is not merely geographical but metaphysical, representing the elevation of the human soul through submission to divine law. Shia commentators uniquely link this to the doctrine of Imamah, viewing the revelation at Sinai as a precursor to the eternal guidance provided by the Imams, who inherit and safeguard divine knowledge. This verse thus subtly reinforces the Shia belief in the unbroken chain of divinely appointed leadership after the Prophet Muhammad.\n\nJurisprudentially, the reference to Sinai underscores the permanence of divine law (Sharia), while theologically, it affirms the principle of *nubuwwah* (prophethood) and *walayah* (divine guardianship) as inseparable pillars of faith. The covenant at Sinai, as interpreted through Shia lens, prefigures the covenant of allegiance to the Imams, binding believers to both the letter of the law and the spirit of spiritual guardianship.",
    "layer3": "In contemporary Shia scholarship, Surah At-Tin’s reference to Mount Sinai (Tur-e-Sinin) is often explored through layered lenses of theology, ecology, and social ethics. Ayatollah Nasir Makarem Shirazi, in his *Tafsir Nemuneh*, emphasises Sinai as a symbol of divine revelation and human accountability, noting its connection to Prophet Musa’s mission to challenge oppression—a theme resonant today amid global struggles for justice. Modern scholars like Dr. Ali Reza Panahian extend this, framing Sinai as a metaphor for spiritual and moral “elevation,” urging believers to seek higher consciousness amid societal materialism.  \n\nScientifically, the verse invites reflection on the sacredness of natural landscapes. Geologists identify the Sinai Peninsula’s unique tectonic history, aligning with Quranic descriptions of mountains as “pegs” (Surah An-Naba 78:7) stabilising Earth’s crust—a nod to environmental stewardship. This intersects with contemporary issues like climate change; Shia theologians such as Sayyid Mohammad Hasan al-Amin argue that degrading ecosystems violates the Quranic ethic of *khalifa* (stewardship).  \n\nSocially, the verse’s context—swearing by sacred spaces—underscores interfaith commonality. Sinai is revered in Judaism, Christianity, and Islam, offering a platform for dialogue amid rising religious polarisation. Scholars at the Al-Mahdi Institute highlight this shared heritage to promote collaborative efforts in addressing humanitarian crises, from refugee displacement to intercommunal violence.  \n\nPhilosophically, the “mountain” symbolises life’s challenges. In lectures, Shaykh Hamza Sodagar links Sinai’s rugged terrain to spiritual resilience, urging youth to navigate modern anxieties with faith. Thus, the verse bridges ancient wisdom and modern urgency, calling believers to harmonise revelation, reason, and responsibility in a fractured world.",
    "layer4": "The verse \"And [by] Mount Sinai\" (95:2) is illuminated by the teachings of the Ahlul Bayt (peace be upon them) as a profound symbol of divine covenant, spiritual elevation, and the unshakable reality of *Wilayah* (divine guardianship). Imam Ja'far al-Sadiq (peace be upon him) taught that Mount Sinai represents the heart purified by obedience to Allah, transformed into a sanctuary for divine revelation. Just as Allah chose Mount Sinai as the site for Prophet Musa’s (AS) communion with Him, He elevates the hearts of the faithful through devotion to the *Imamah*—the divinely appointed leadership of the Ahlul Bayt.  \n\nThe Sixth Imam (AS) states, \"The mountains mentioned in the Qur’an are symbols of the Imams, for they are the firm pillars of the earth of faith\" (*Tafsir al-Burhan*). This aligns with Lady Fatimah’s (AS) declaration in her *Khutbat al-Fadakiyyah*: \"Allah made the mountains His deputies on earth, and the Imams are His deputies over creation.\" Mount Sinai, therefore, signifies the unwavering station of the Imams, who carry the weight of divine guidance as mountains bear the earth.  \n\nSpiritually, this verse calls believers to cultivate steadfastness in faith and submission to the *Wilayah* of the Ahlul Bayt. Imam Ali (AS) taught, \"The heart of a believer is firmer than a mountain; it does not crack under trials.\" To embody this, one must anchor their soul in the love and obedience of the Imams, whose teachings are the \"peaks\" of divine wisdom. Practical guidance lies in daily reflection on their words, upholding their ethical legacy, and seeking nearness to Allah through loyalty to their path. Just as Sinai witnessed divine light, the heart illuminated by *Wilayah* becomes a locus of spiritual ascension.",
    "layer1_urdu": "سورہ ایٹ ٹن میں ، اللہ انسانی مقصد کے بارے میں گہری سچائیوں کی تصدیق کرنے کے لئے مقدس مقامات اور علامتوں کی قسم کھاتا ہے۔ جملہ * و ٹوری نے دیکھا * (\"اور ماؤنٹ سینا\") سے مراد اس پہاڑ سے ہے جہاں نبی موسیٰ (ع) نے تورات سمیت الہی وحی حاصل کی۔ یہ حلف سورہ کے وسیع تر موضوع سے جڑتا ہے ، جو انسانیت کی روحانی صلاحیت کو حق کو مسترد کرنے کے نتائج سے متصادم ہے۔ *ٹور*(پہاڑ) استحکام اور عظمت کی علامت ہے ، جبکہ*دیکھا*لسانی طور پر سینا (*سینا*) اور برکتوں (*ثناان*) دونوں سے ربط رکھتا ہے ، جو اس کے دوہری کردار کو وحی کی جگہ اور الہی احسان کی علامت کے طور پر ظاہر کرتا ہے۔\n\nشیعہ طافسیر ، جیسا کہ الامہ تبتابائی جیسے اسکالرز نے نوٹ کیا ہے ، اس بات پر زور دیتا ہے کہ قرآن مجید میں اس طرح کے حلف کی پیشن گوئی کے مشنوں سے منسلک مقامات کے تقدس کو اجاگر کیا گیا ہے۔ ماؤنٹ سینا اللہ اور اس کے میسینجرز کے مابین عہد کی نمائندگی کرتا ہے ، اور الہی رہنمائی کو برقرار رکھنے کے لئے انسانوں کی ذمہ داری پر زور دیتا ہے۔ تاریخی طور پر ، یہ آیت مومنوں کو موسیٰ کے تورات سے لے کر حضرت محمد (ص) کے حتمی پیغام تک - اور پیشن گوئی کے جانشینوں ، یعنی اہل بیت (ع) کے بارے میں غور کرنے کی ضرورت کی یاد دلاتی ہے ، جس نے اسلامی تعلیمات کو محفوظ اور سمجھایا۔\n\nعصری مسلمانوں کے لئے ، یہ آیت ایمان میں ثابت قدمی پر عکاسی کی دعوت دیتی ہے۔ جس طرح پہاڑ مضبوط ہیں ، مومنین کو زندگی کے چیلنجوں کے درمیان قرآنی اصولوں میں جڑیں رہنے کے لئے کہا جاتا ہے۔ اس سے مقدس جگہوں کی اہمیت کو بھی تقویت ملتی ہے - نہ صرف جسمانی مقامات جیسے سینا یا مکہ مکرمہ ، بلکہ ہماری زندگی میں روحانی \"پہاڑ\" ، جیسے نماز کے لمحات ، اخلاقی فیصلوں ، یا انصاف کے ساتھ عمل پیرا ہونا۔ *ٹور سیونین *کی علامت الہی حکمت کے ساتھ سیدھ کر کے ، مسلمان سورت میں مذکور \"بہترین قد\" کو مجسم بنا سکتے ہیں ، جو ایمان اور نیک عمل کے ذریعہ روحانی بلندی کے لئے کوشاں ہیں۔",
    "layer2_urdu": "سورہ ایٹ ٹن (95: 2) میں ، الہی حلف \"وُ va یوری سیسیانی َ\" (\"اور [[[]] ماؤنٹ سینا\") کو کلاسیکی شیعہ نے الہی الہٰی کے تقدس اور خدا اور اس کے منتخب رہنماؤں کے مابین عہد نامے کے گہرے الجھے قرار دیا ہے۔ * المزان * میں الامہ تبتابائی اور * ماجما البیان * میں شیخ تبریسی دونوں اس بات پر زور دیتے ہیں کہ ماؤنٹ سینا (ٹور سنین) نبی موسیٰ (موسیٰ) کے ساتھ الہی رابطے کے مقام کی علامت ہے ، جہاں تورات کو خدا کی قانون سازی کی حکمت کے مظہر کے طور پر ظاہر کیا گیا تھا۔ تبریسی نے نوٹ کیا ہے کہ \"سنن\" لسانی طور پر \"برکت\" کی نشاندہی کرتا ہے یا موسیٰ کی پیشن گوئی کی میزبانی میں پہاڑ کی دوہری اہمیت کا حوالہ دیتا ہے اور اس کے نتیجے میں روحانی میراث کو اہل بیت سے منسلک کیا جاتا ہے ، جو الہی رہنمائی کے تسلسل کو مجسم بناتے ہیں۔\n\nتبتابائی نے اس مذہبی فریم ورک کو وسعت دی ہے ، اور یہ استدلال کیا ہے کہ قرآن مجید میں اس طرح کے حلف انسانی شعور کو تخلیق ، وحی اور اخلاقی احتساب کی باہمی ربط کی طرف بڑھاتے ہیں۔ پہاڑ کا تقدس محض جغرافیائی نہیں بلکہ استعاریاتی ہے ، جو الہی قانون کو پیش کرنے کے ذریعہ انسانی روح کی بلندی کی نمائندگی کرتا ہے۔ شیعہ مبصرین کو اس کو امامہ کے نظریے سے الگ الگ جوڑتا ہے ، اور سینا میں انکشاف کو اماموں کے ذریعہ فراہم کردہ ابدی رہنمائی کا پیش خیمہ دیکھتے ہیں ، جو الہی علم کے وارث اور حفاظت کرتے ہیں۔ اس طرح اس آیت نے نبی صلی اللہ علیہ وسلم کے بعد الہی مقرر کردہ قیادت کی غیر منقول سلسلہ میں شیعہ کے عقیدے کو ٹھیک سے تقویت بخشی ہے۔\n\nفقہی طور پر ، سینا کے حوالے سے الہی قانون (شریعت) کے استحکام کی نشاندہی کی گئی ہے ، جبکہ مذہبی طور پر ، یہ * نوبووہ * (پیشن گوئی) اور * والیہ * (خدائی سرپرستی) کے اصول کی تصدیق کرتا ہے کیونکہ وہ عقیدے کے لازم و ملزوم ستون ہیں۔ سینا میں عہد نامہ ، جیسا کہ شیعہ لینس کے ذریعہ تشریح کی گئی ہے ، وہ اماموں سے بیعت کرنے کے عہد کو پیش کرتا ہے ، مومنوں کو قانون کے خط اور روحانی سرپرستی کے جذبے دونوں پر پابند کرتا ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، ماؤنٹ سینا (ٹور-ای سنین) کے حوالے سے سورہ اٹ ٹن کا حوالہ اکثر الہیات ، ماحولیات ، اور معاشرتی اخلاقیات کے پرتوں والے عینک کے ذریعے تلاش کیا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں ، سینا پر الہی وحی اور انسانی احتساب کی علامت کے طور پر زور دیا ہے ، اور انصاف کے لئے عالمی جدوجہد کے دوران آج ایک موضوع گونجنے کے لئے ، ایک موضوع گونجنے کے لئے نبی موسیٰ کے مشن سے اس کے تعلق کو نوٹ کیا ہے۔ ڈاکٹر علی رضا پاناہیان جیسے جدید اسکالرز اس میں توسیع کرتے ہیں ، اور سینا کو روحانی اور اخلاقی \"بلندی\" کے استعارے کے طور پر تیار کرتے ہیں ، اور مومنین پر زور دیتے ہیں کہ وہ معاشرتی مادیت پرستی کے درمیان اعلی شعور کی تلاش کریں۔  \n\nسائنسی لحاظ سے ، آیت قدرتی مناظر کی تقدس کی عکاسی کی دعوت دیتی ہے۔ ماہرین ارضیات جزیرہ نما سینا کی منفرد ٹیکٹونک تاریخ کی نشاندہی کرتے ہیں ، اور پہاڑوں کی قرآنی بیانات کے ساتھ \"پیگس\" کے طور پر صف بندی کرتے ہیں (سورہ ان نابا 78: 7) زمین کی پرت کو مستحکم کرنا-ماحولیاتی ذمہ داری کے لئے اشارہ ہے۔ یہ آب و ہوا کی تبدیلی جیسے عصری مسائل کے ساتھ مل جاتا ہے۔ شیعد محمد حسن الامین جیسے شیعہ مذہبی ماہرین کا مؤقف ہے کہ ہراس ماحولیاتی نظام * خلیفہ * (اسٹیورشپ) کی قرآنی اخلاقیات کی خلاف ورزی کرتا ہے۔  \n\nمعاشرتی طور پر ، آیت کا سیاق و سباق - مقدس جگہوں کے ذریعہ واردات - انڈرسورز کو مداخلت کے ساتھ مشترکات۔ سینا یہودیت ، عیسائیت اور اسلام میں قابل احترام ہے ، اور بڑھتے ہوئے مذہبی پولرائزیشن کے درمیان مکالمے کے لئے ایک پلیٹ فارم پیش کرتا ہے۔ المہدی انسٹی ٹیوٹ کے اسکالرز نے پناہ گزینوں کے بے گھر ہونے سے لے کر باہمی تشدد تک ، انسانی بحرانوں سے نمٹنے کے لئے باہمی تعاون کی کوششوں کو فروغ دینے کے لئے اس مشترکہ ورثے کو اجاگر کیا۔  \n\nفلسفیانہ طور پر ، \"پہاڑ\" زندگی کے چیلنجوں کی علامت ہے۔ لیکچرز میں ، شیخ حمزہ سوڈگر سینا کے ناہموار خطوں کو روحانی لچک سے جوڑتا ہے ، اور نوجوانوں پر زور دیتا ہے کہ وہ جدید پریشانیوں کو ایمان کے ساتھ تشریف لے جائیں۔ اس طرح ، آیت قدیم حکمت اور جدید عجلت کو ختم کرتی ہے ، اور مومنوں کو ایک فریکچرڈ دنیا میں وحی ، وجہ اور ذمہ داری کو ہم آہنگ کرنے کے لئے کہتے ہیں۔",
    "layer4_urdu": "آیت \"اور [بذریعہ] ماؤنٹ سینا\" (95: 2) احلول بیت (ان پر امن) کی تعلیمات سے الہی عہد ، روحانی بلندی ، اور * ولیہ * (الہی سرپرستی) کی غیر متزلزل حقیقت کی ایک گہری علامت کے طور پر روشن ہے۔ امام جافر السادق (اس پر امن ہے) نے سکھایا کہ ماؤنٹ سینا اللہ کی اطاعت کے ذریعہ دل کی نمائندگی کرتا ہے ، جو الہی وحی کے لئے ایک حرمت میں بدل گیا ہے۔ جس طرح اللہ نے ماؤنٹ سینا کو اس کے ساتھ نبی موسیٰ (ع) کے ساتھ اتحاد کے طور پر منتخب کیا تھا ، اسی طرح وہ *امامہ *کے ساتھ عقیدت کے ذریعہ وفاداروں کے دلوں کو بلند کرتا ہے۔  \n\nچھٹا امام (ع) میں کہا گیا ہے ، \"قرآن مجید میں مذکور پہاڑ اماموں کی علامت ہیں ، کیونکہ وہ ایمان کی زمین کے پختہ ستون ہیں\" (*طافسیر البرہان*)۔ اس سے لیڈی فاطمہ کے (ع) کے اس کے *خٹ بٹ الفاداکیہ *کے اعلامیہ کے ساتھ صف بندی ہوتی ہے: \"اللہ نے پہاڑوں کو زمین پر اپنے نائبین بنا دیا ، اور امام تخلیق پر ان کے نائبین ہیں۔\" لہذا ، پہاڑ سینا ، اماموں کے غیر متزلزل اسٹیشن کی نشاندہی کرتا ہے ، جو آسمانی رہنمائی کا وزن اٹھاتے ہیں کیونکہ پہاڑ زمین کو برداشت کرتے ہیں۔  \n\nروحانی طور پر ، یہ آیت مومنوں کو عقیدہ میں ثابت قدمی اور اہل بیت کے * ولیہ * کے سامنے پیش کرنے کا مطالبہ کرتی ہے۔ امام علی (ع) نے سکھایا ، \"مومن کا دل پہاڑ سے زیادہ مضبوط ہے۔ یہ آزمائشوں کے تحت نہیں پھٹتا ہے۔\" اس کو مجسمہ بنانے کے ل one ، کسی کو اپنی جان کو اماموں کی محبت اور اطاعت میں لنگر انداز کرنا چاہئے ، جس کی تعلیمات الہی حکمت کی \"چوٹی\" ہیں۔ عملی رہنمائی ان کے الفاظ پر روزانہ کی عکاسی میں ہے ، ان کی اخلاقی وراثت کو برقرار رکھتی ہے ، اور ان کے راستے سے وفاداری کے ذریعہ اللہ سے قربت کی تلاش کرتی ہے۔ جس طرح سینا نے الہی روشنی کا مشاہدہ کیا ، اسی طرح دل * ولیہ * کے ذریعہ روشن ہوا روحانی چڑھائی کا ایک مقام بن جاتا ہے۔",
    "layer5": "The oath in Surah At-Tin 2 (“And [by] Mount Sinai”) draws convergent interpretations across Shia and Sunni traditions, with scholars from both schools identifying “Mount Sinai” (Toor Seeneen) as the sacred site of Prophet Musa’s divine communion. Al-Tabari (Sunni) and Al-Tusi (Shia) both affirm its connection to Musa’s reception of the Torah, emphasizing its theological significance as a symbol of divine revelation and covenant. Ibn Kathir and Al-Tabrisi similarly highlight the mountain’s sanctity within Abrahamic prophetic history, reflecting shared reverence for Musa’s prophethood.\n\nDivergences emerge in symbolic interpretations. Shia exegetes like Al-Tabatabai (Al-Mizan) and Al-Qummi often extend the verse’s meaning to encompass broader themes of divine guidance through the Imamate. Al-Qummi links Sinai’s illumination during Musa’s revelation to the eternal light (nur) of the Ahl al-Bayt, framing it as a metaphor for continuous divine authority. This aligns with Shia theological emphasis on the Imam’s role as inheritor of prophetic wisdom. Conversely, Sunni commentators like Al-Qurtubi and Al-Razi focus on Sinai as a physical locus of monotheistic affirmation, stressing its connection to Tawhid (divine unity) and the finality of prophethood. Al-Razi (Mafatih al-Ghayb) interprets the oath as underscoring human accountability through historical divine interventions, without explicit links to post-prophetic authority.\n\nThese differences stem from distinct theological frameworks: Shia thought prioritizes the metaphysical continuity of revelation through the Imams, while Sunni exegesis centers on prophetic finality and scriptural permanence. Practically, this influences Shia devotional emphasis on the Ahl al-Bayt’s guidance versus Sunni focus on adhering to prophetic precedent (Sunnah). Historically, such divergences reflect early Islamic debates about religious authority, with Shia interpretations crystallizing around the Imam’s ontological role and Sunni scholarship consolidating around textual and historical analysis. Both traditions, however, unite in viewing Sinai as a testament to divine-human dialogue and moral responsibility.",
    "layer5_urdu": "سور ah ایٹ ٹن 2 (\"اور [[بذریعہ] ماؤنٹ سینا\") میں حلف شیعہ اور سنی روایات میں متضاد تشریحات کھینچتا ہے ، جس میں دونوں اسکولوں کے اسکالرز \"ماؤنٹ سینا\" (ٹور سنیون) کو نبی موسیٰ کے الہی اجتماع کے مقدس مقام کے طور پر شناخت کرتے ہیں۔ التباری (سنی) اور التوسی (شیعہ) دونوں موسیٰ کے تورات کے استقبال سے اس کے تعلق کی تصدیق کرتے ہیں ، اور اس نے الہی وحی اور عہد کی علامت کے طور پر اس کی مذہبی اہمیت پر زور دیا ہے۔ ابن کتھیر اور الاترسی بھی اسی طرح ابراہیمک پیشن گوئی کی تاریخ کے اندر پہاڑ کے تقدس کو اجاگر کرتے ہیں ، جو موسیٰ کی پیشن گوئی کے لئے مشترکہ عقیدت کی عکاسی کرتے ہیں۔\n\nعلامتی تشریحات میں تغیرات ابھرتے ہیں۔ شیعہ التباطابائی (العزان) اور القومی جیسے استثنیٰ کرتے ہیں اکثر اس آیت کے معنی کو امامیٹ کے ذریعہ الہی رہنمائی کے وسیع تر موضوعات کو گھیرے میں رکھتے ہیں۔ موسیٰ کے انکشاف کے دوران القمی نے سینا کی روشنی کو اے ایچ ایل ال بیت کی ابدی روشنی (نور) سے جوڑ دیا ہے ، اور اسے مسلسل الہی اتھارٹی کے استعارے کے طور پر تیار کیا ہے۔ یہ پیشن گوئی دانشمندی کے ورثہ کے طور پر امام کے کردار پر شیعہ مذہبی زور کے ساتھ ہم آہنگ ہے۔ اس کے برعکس ، سنی مفسرین جیسے القوروبی اور الراجی نے توہید (الہی اتحاد) اور پیشن گوئی کی حتمی حیثیت سے اس کے تعلق پر زور دیتے ہوئے ، توحید کی تصدیق کے جسمانی لوکس کی حیثیت سے سینا پر توجہ مرکوز کی۔ الراجی (مافاتیہ الغیب) حلف کو تاریخی الہی مداخلتوں کے ذریعہ انسانی احتساب کی نشاندہی کرنے کی ترجمانی کرتا ہے ، بغیر کسی پروفیوٹک اتھارٹی کے واضح روابط کے۔\n\nیہ اختلافات الگ الگ تھیلوجیکل فریم ورک سے پیدا ہوتے ہیں: شیعہ سوچ نے اماموں کے ذریعہ وحی کے استعاریاتی تسلسل کو ترجیح دی ہے ، جبکہ سنی کی اصلاح پیشن گوئی کی حتمی اور صحیفاتی استحکام پر مرکوز ہے۔ عملی طور پر ، اس سے شیعہ عقیدت مندانہ زور کو اے ایچ ایل البائٹ کی رہنمائی بمقابلہ سنی پر پیشن گوئی کی نظیر (سنت) پر عمل پیرا ہونے پر توجہ دینے پر اثر انداز ہوتا ہے۔ تاریخی طور پر ، اس طرح کے تغیرات مذہبی اتھارٹی کے بارے میں ابتدائی اسلامی مباحثوں کی عکاسی کرتے ہیں ، جس میں شیعہ کی ترجمانی امام کے آنٹولوجیکل کردار اور سنی اسکالرشپ کو متنی اور تاریخی تجزیہ کے ارد گرد مستحکم کرتی ہے۔ تاہم ، دونوں روایات سینا کو الہی انسانی مکالمے اور اخلاقی ذمہ داری کے ثبوت کے طور پر دیکھنے میں متحد ہوجاتی ہیں۔",
    "layer2short": "In Surah At-Tin (95:2), the divine oath \"وَطُورِ سِينِينَ\" (\"And [by] Mount Sinai\") is interpreted by classical Shia exegetes as a profound allusion to the sanctity of divine revelation and the covenant between God and His chosen guides. Both Allama Tabatabai in *Al-Mizan* and Sheikh Tabrisi in *Majma al-Bayan* emphasize that Mount Sinai (Tur Sinin) symbolizes the locus of divine communication with Prophet Musa (Moses), where the Torah was revealed as a manifestation of God’s legislative wisdom. Tabrisi notes that \"Sinin\" linguistically denotes \"blessed\" or references the mountain’s dual prominence in hosting both Musa’s prophethood and the subsequent spiritual legacy tied to the Ahlul Bayt, who embody the continuity of divine guidance.",
    "layer2short_urdu": "سورہ ایٹ ٹن (95: 2) میں ، الہی حلف \"وُ va یوری سیسیانی َ\" (\"اور [[[]] ماؤنٹ سینا\") کو کلاسیکی شیعہ نے الہی الہٰی کے تقدس اور خدا اور اس کے منتخب رہنماؤں کے مابین عہد نامے کے گہرے الجھے قرار دیا ہے۔ * المزان * میں الامہ تبتابائی اور * ماجما البیان * میں شیخ تبریسی دونوں اس بات پر زور دیتے ہیں کہ ماؤنٹ سینا (ٹور سنین) نبی موسیٰ (موسیٰ) کے ساتھ الہی رابطے کے مقام کی علامت ہے ، جہاں تورات کو خدا کی قانون سازی کی حکمت کے مظہر کے طور پر ظاہر کیا گیا تھا۔ تبریسی نے نوٹ کیا ہے کہ \"سنن\" لسانی طور پر \"برکت\" کی نشاندہی کرتا ہے یا موسیٰ کی پیشن گوئی کی میزبانی میں پہاڑ کی دوہری اہمیت کا حوالہ دیتا ہے اور اس کے نتیجے میں روحانی میراث کو اہل بیت سے منسلک کیا جاتا ہے ، جو الہی رہنمائی کے تسلسل کو مجسم بناتے ہیں۔"
  },
  "3": {
    "layer1": "In Surah At-Tin, Allah swears by three sacred entities: the fig, the olive, Mount Sinai, and finally \"this secure city\" (وَٰهَـٰذَا ٱلْبَلَدِ ٱلْأَمِينِ), universally understood in Shia tafsir as Makkah. The term *al-Balad al-Amin* carries profound significance, combining *balad* (city/land) and *amin* (secure, trustworthy), reflecting both physical safety and spiritual sanctity. Classical commentators like Allama Tabatabai in *Al-Mizan* emphasize that Makkah’s \"security\" isn’t merely geographic but divinely ordained, rooted in its role as the birthplace of Islam and the site of the Kaaba, established by Prophet Ibrahim (AS) as a sanctuary for monotheism.  \n\nHistorically, this Meccan surah was revealed during intense opposition to the Prophet Muhammad (PBUH), reinforcing Makkah’s sacred status despite its leaders’ hostility. The oath underscores Allah’s wisdom in choosing this city as the spiritual heart of Islam, a theme echoed in Shia narrations linking the Ahlul Bayt to the protection of faith anchored in such holy spaces.  \n\nFor contemporary Muslims, this verse invites reflection on the interconnectedness of physical sanctuaries and spiritual integrity. Just as Makkah is a symbol of divine refuge, believers are called to cultivate inner *aman* (security) through faith and ethical conduct. Practically, this translates to respecting holy sites, promoting peace in communities, and embodying trustworthiness in daily interactions. In a world where sacred spaces sometimes face threats, the verse reminds Muslims to uphold the values of sanctuary and justice, mirroring the eternal covenant between the Creator and His creation. By honouring *al-Balad al-Amin*, we reaffirm our commitment to preserving both the tangible and intangible havens of faith in our lives.",
    "layer2": "In Surah At-Tin, verse 3, Allah swears by \"this secure city [Makkah],\" a declaration classical Shia exegetes interpret through layered theological and metaphysical lenses. Sheikh Tabrisi, in *Majma al-Bayan*, emphasizes Makkah’s divinely ordained sanctity (*haram*) as a place of physical and spiritual refuge, protected since the era of Prophet Ibrahim. He notes its role as the birthplace of Islamic revelation and the epicenter of monotheism, with its security symbolizing Allah’s covenant to preserve the Abrahamic legacy. This aligns with Shia narratives that position Makkah not merely as a geographical locus but as a metaphysical axis (*qibla*) for spiritual orientation and divine proximity.\n\nAyatollah Tabatabai, in *Al-Mizan*, extends this analysis by linking the oath to the broader Qur’anic theme of divine guardianship (*wilayah*). He argues that Makkah’s \"security\" transcends its tangible boundaries, reflecting the immutable protection granted to the prophetic mission and its continuation through the Ahlul Bayt. The city’s inviolability thus mirrors the infallibility (*ismah*) of the Imams, who embody the spiritual and intellectual \"security\" of Islamic guidance. This interpretation resonates with Shia hadiths, such as those in *Bihar al-Anwar*, where Imam Jafar al-Sadiq describes Makkah’s sanctity as inseparable from the Prophet’s household, who safeguard the faith’s integrity.\n\nTheologically, this verse underscores the Shia principle that divine covenants—whether spatial (Makkah) or human (the Prophets and Imams)—are interlinked manifestations of Allah’s mercy. Jurisprudentially, it reinforces the sacred laws governing the Haram’s boundaries and rituals, while doctrinally, it affirms the necessity of divinely appointed guides to preserve religious truth. Thus, the \"secure city\" becomes a metaphor for the enduring, protected legacy of the Ahlul Bayt, through whom the ummah navigates spiritual and moral peril.",
    "layer3": "In contemporary Shia scholarship, Surah At-Tin’s third verse—swearing by Makkah, the \"secure city\"—is often interpreted as a multidimensional covenant emphasizing both physical sanctuary and spiritual responsibility. Scholars like Ayatollah Nasir Makarem Shirazi highlight the verse’s timeless link between sacred geography and human dignity, noting that Makkah’s sanctity as a divinely protected space (as affirmed in classical tafsir) extends metaphorically to humanity’s duty to foster security and justice in all communities. This aligns with modern discourses on urban safety and social cohesion, where cities are seen as microcosms of ethical potential.  \n\nScientifically, researchers like Dr. Hassan Hassani (a Shia scholar and geologist) have explored Makkah’s unique geological stability in a seismically active region, framing it as a sign of divine design. Philosophically, thinkers such as Dr. Liyakat Takim connect the \"secure city\" to the concept of *amn* (security) in Islamic ethics—arguing that true security today requires addressing systemic inequities, climate crises, and intercommunal tensions. In a world grappling with displacement and urban violence, Makkah’s model challenges societies to become havens of inclusion rather than exclusion.  \n\nInterfaith perspectives enrich this dialogue: Rabbi David Rosen has noted parallels between Makkah’s sanctity and Jerusalem’s role in Judaism, emphasizing shared Abrahamic values of sanctuary. For multicultural societies, the verse’s call resonates in efforts to build \"cities of refuge\" for migrants and marginalized groups. Contemporary Shia voices, like Sheikh Abdullah Dahrouj, stress that defending Makkah’s security isn’t merely about physical borders but resisting ideologies of hatred that threaten global harmony—a timely reminder in an age of polarization. Ultimately, the verse bridges divine oath and human action, urging believers to transform spaces—physical and social—into embodiments of peace.",
    "layer4": "The oath in Surah At-Tin by \"this secure city\" carries profound spiritual dimensions illuminated by the Ahlul Bayt (peace be upon them). Imam Ja'far al-Sadiq (peace be upon him) taught that while the apparent meaning refers to Makkah's sanctity, the deeper reality points to the Holy Prophet Muhammad (peace be upon him and his family) as the ultimate \"Secure City\" of divine guidance. Just as Makkah's sacred precincts offer physical sanctuary, the Prophet's purified progeny provide spiritual sanctuary for humanity. \n\nIn Tafsir al-Burhan, Imam al-Sadiq explains: \"The fig is Imam Ali, the olive is Fatimah, Mount Sinai is Hasan, this secure city is Husayn – all connected through the covenant of wilayah.\" This reveals the verse's connection to the Imamah's divine continuum. The \"security\" of the city symbolizes the spiritual protection found in clinging to the Ahlul Bayt's teachings – they are the ark of salvation in life's tempests.\n\nLady Fatimah (peace be upon her) embodies this sacred security through her role as \"Umm Abiha\" (Mother of Her Father), becoming the living bridge between prophethood and Imamah. Her purified status, affirmed in the Verse of Purification (33:33), establishes the household as the eternal sanctuary of truth. \n\nPractical wisdom lies in recognizing that true spiritual security comes not from stone walls, but through submission to the Muhammadan light embodied in the Imams. As Imam Ali (peace be upon him) taught: \"We are the pillars of this earth – through us it stands secure.\" Daily connection to their teachings through dua, Quranic reflection, and ethical conduct becomes our fortress. Let every prayer upon the Prophet and his family be a brick reinforcing this city of luminous guidance within our hearts.",
    "layer1_urdu": "سورہ ایٹ ٹن میں ، اللہ تین مقدس اداروں کی قسم کھاتا ہے: انجیر ، زیتون ، ماؤنٹ سینا ، اور آخر کار \"یہ محفوظ شہر\" (وُ ٰ ٰ ٰ ٰ ٰ ٰ ٰ \" اصطلاح * البالاد الامین * کی گہری اہمیت ہے ، جس میں * بالاد * (شہر/زمین) اور * امین * (محفوظ ، قابل اعتماد) کا امتزاج کیا گیا ہے ، جو جسمانی حفاظت اور روحانی تقدس دونوں کی عکاسی کرتا ہے۔ * المزان * میں علامہ تبتابائی جیسے کلاسیکی مبصرین نے اس بات پر زور دیا کہ مکہ مکرمہ کی \"سلامتی\" محض جغرافیائی نہیں بلکہ خدائی طور پر مقرر ہے ، جس کی جڑ اسلام کی جائے پیدائش اور کعبہ کے مقام کی حیثیت سے ہے ، جو نبی ابراہیم (جیسے) نے مذہب کے لئے ایک مقدس ہے۔  \n\nتاریخی طور پر ، اس مکہ سرہ کا انکشاف حضرت محمد (صلی اللہ علیہ وآلہ وسلم) کی شدید مخالفت کے دوران ہوا ، جس نے اس کے رہنماؤں کی دشمنی کے باوجود مکہ مکرمہ کی مقدس حیثیت کو تقویت بخشی۔ حلف اس شہر کو روحانی دل کے اسلام کے طور پر منتخب کرنے میں اللہ کی دانشمندی کی نشاندہی کرتا ہے ، جو اس طرح کے مقدس مقامات پر لنگر انداز ہونے والے عقیدے کے تحفظ سے اہل بیت کو جوڑنے والے شیعہ بیانات میں ایک موضوع کی بازگشت ہے۔  \n\nعصری مسلمانوں کے لئے ، یہ آیت جسمانی مقدس اور روحانی سالمیت کے باہمی ربط پر عکاسی کی دعوت دیتی ہے۔ جس طرح مکہ مکرمہ الہی پناہ کی علامت ہے ، اسی طرح مومنین کو عقیدہ اور اخلاقی طرز عمل کے ذریعہ اندرونی * امان * (سیکیورٹی) کاشت کرنے کے لئے کہا جاتا ہے۔ عملی طور پر ، اس کا ترجمہ مقدس مقامات کا احترام کرنے ، برادریوں میں امن کو فروغ دینے اور روزانہ کی بات چیت میں اعتماد کو مجسم بنانے کا ہے۔ ایسی دنیا میں جہاں مقدس جگہوں کو بعض اوقات خطرات کا سامنا کرنا پڑتا ہے ، آیت مسلمانوں کو یاد دلاتی ہے کہ وہ حرمت اور انصاف کی اقدار کو برقرار رکھے ، جو خالق اور اس کی تخلیق کے مابین ابدی عہد کا آئینہ دار ہے۔ *البالاد الامین *کا اعزاز دے کر ، ہم اپنی زندگی میں اعتماد کے ٹھوس اور ناقابل تسخیر پناہ گاہوں کو محفوظ رکھنے کے اپنے عزم کی تصدیق کرتے ہیں۔",
    "layer2_urdu": "سورت اٹ ٹن ، آیت 3 میں ، اللہ نے \"اس محفوظ شہر [مکہ]\" کی قسم کھائی ہے ، ایک اعلامیہ کلاسیکی شیعہ استثنیٰ پرتوں والے مذہبی اور استعاریاتی لینسوں کے ذریعے تشریح کرتے ہیں۔ شیخ تبریسی ،*ماجما البیان*میں ، مکہ مکرمہ کے خدائی مقررہ مقدس (*حرام*) پر جسمانی اور روحانی پناہ گاہ کے طور پر زور دیتے ہیں ، جو حضرت ابراہیم کے دور سے محفوظ ہیں۔ وہ اسلامی وحی کی جائے پیدائش اور توحید کے مرکز کے طور پر اس کے کردار کو نوٹ کرتا ہے ، اس کی سلامتی کے ساتھ ابراہیمی میراث کو برقرار رکھنے کے ل Allah اللہ کے عہد کی علامت ہے۔ یہ شیعہ بیانیے کے ساتھ صف بندی کرتا ہے کہ مکہ مکرمہ محض جغرافیائی لوکس کے طور پر نہیں بلکہ روحانی رجحان اور خدائی قربت کے لئے ایک استعاریاتی محور (*کیبلا*) کے طور پر ہے۔\n\nآیت اللہ تبتابائی ،*المزان*میں ، اس تجزیے کو الہی سرپرستی (*ولیہ*) کے وسیع تر قرآنی موضوع سے جوڑ کر اس تجزیے میں توسیع کرتے ہیں۔ ان کا استدلال ہے کہ مکہ مکرمہ کی \"سلامتی\" اپنی ٹھوس حدود کو عبور کرتی ہے ، جو پیشنو مشن کو دیئے گئے غیر منقولہ تحفظ اور اہل بائٹ کے ذریعہ اس کے تسلسل کی عکاسی کرتی ہے۔ اس طرح شہر کی ناقابل تسخیر صلاحیتوں نے اسلامی رہنمائی کی روحانی اور فکری \"سلامتی\" کو مجسم بناتے ہوئے ، اماموں کی عدم استحکام (*عثمہ*) کی عکس بندی کی ہے۔ یہ تشریح شیعہ حدیث کے ساتھ گونجتی ہے ، جیسے *بہار الانور *میں ، جہاں امام جعفر السادیق مکہ مکرمہ کے حرمت کو نبی کے گھر سے لازم و ملزوم قرار دیتے ہیں ، جو عقیدے کی سالمیت کی حفاظت کرتے ہیں۔\n\nمذہبی طور پر ، یہ آیت شیعہ کے اصول کی نشاندہی کرتی ہے کہ الہی عہد - چاہے وہ مقامی (مکہ) ہو یا انسان (نبی اور امام) - اللہ کی رحمت کے باہم مربوط مظہر ہیں۔ فقہی طور پر ، یہ حرام کی حدود اور رسومات پر حکمرانی کرنے والے مقدس قوانین کو تقویت دیتا ہے ، جبکہ نظریاتی طور پر ، یہ مذہبی سچائی کے تحفظ کے لئے خدائی مقرر کردہ رہنماؤں کی ضرورت کی تصدیق کرتا ہے۔ اس طرح ، \"محفوظ شہر\" اہل بیت کی پائیدار ، محفوظ وراثت کا استعارہ بن جاتا ہے ، جس کے ذریعہ امت اس کے ذریعے روحانی اور اخلاقی خطرہ پر گامزن ہوتا ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ اٹ ٹن کی تیسری آیت-مکہ مکرمہ کے ذریعہ ، \"محفوظ شہر\"-جو اکثر جسمانی حرمت اور روحانی ذمہ داری دونوں پر زور دیتے ہیں۔ آیت اللہ ناصر مکریم شیرازی جیسے اسکالرز مقدس جغرافیہ اور انسانی وقار کے مابین آیت کی لازوال روابط کو اجاگر کرتے ہیں ، اور یہ کہتے ہوئے کہ مکہ مکرمہ کی تقدس کو ایک الہی محفوظ جگہ کے طور پر (جیسا کہ کلاسیکی طافسیر میں تصدیق کی گئی ہے) تمام برادریوں میں سلامتی اور انصاف کو فروغ دینے کے لئے انسانیت کے فرائض کو استعاراتی طور پر پھیلا دیتا ہے۔ یہ شہری حفاظت اور معاشرتی ہم آہنگی پر جدید گفتگو کے ساتھ منسلک ہے ، جہاں شہروں کو اخلاقی صلاحیت کے مائکروکومس کے طور پر دیکھا جاتا ہے۔  \n\nسائنسی اعتبار سے ، ڈاکٹر حسن حسنی (ایک شیعہ اسکالر اور ماہر ارضیات) جیسے محققین نے زلزلے سے فعال خطے میں مکہ مکرمہ کے منفرد ارضیاتی استحکام کی کھوج کی ہے ، اور اسے خدائی ڈیزائن کی علامت کے طور پر تیار کیا ہے۔ فلسفیانہ طور پر ، ڈاکٹر لییاکات تکیم جیسے مفکرین \"محفوظ شہر\" کو اسلامی اخلاقیات میں * AMN * (سیکیورٹی) کے تصور سے مربوط کرتے ہیں - اس بات کی نشاندہی کرتے ہیں کہ آج حقیقی سلامتی کے لئے نظامی عدم مساوات ، آب و ہوا کے بحرانوں اور باہمی تعامل کو دور کرنے کی ضرورت ہے۔ بے گھر ہونے اور شہری تشدد سے دوچار دنیا میں ، مکہ کا ماڈل معاشروں کو چیلنج کرتا ہے کہ وہ خارج ہونے کی بجائے شمولیت کا پناہ بن جائے۔  \n\nانٹرفیتھ نقطہ نظر اس مکالمے کو تقویت بخشتا ہے: ربی ڈیوڈ روزن نے مکہ مکرمہ کی تقدس اور یہودیت میں یروشلم کے کردار کے مابین ہم آہنگی کو نوٹ کیا ہے ، جس میں حرمت کی مشترکہ ابراہیمک اقدار پر زور دیا گیا ہے۔ کثیر الثقافتی معاشروں کے لئے ، آیت کی کال تارکین وطن اور پسماندہ گروہوں کے لئے \"پناہ کے شہر\" بنانے کی کوششوں میں گونجتی ہے۔ عصری شیعہ آوازیں ، جیسے شیخ عبداللہ دہروج ، اس بات پر زور دیتے ہیں کہ مکہ مکرمہ کی سلامتی کا دفاع محض جسمانی سرحدوں کے بارے میں نہیں ہے بلکہ نفرت کے نظریات کی مزاحمت کرنا ہے جو عالمی ہم آہنگی کو خطرہ بناتا ہے۔ آخر کار ، آیت الہی حلف اور انسانی عمل کو پل کرتی ہے ، اور مومنوں پر زور دیتی ہے کہ وہ امن کے مجسموں میں خالی جگہوں - جسمانی اور معاشرتی - کو تبدیل کریں۔",
    "layer4_urdu": "\"اس محفوظ شہر\" کے ذریعہ سورہ میں حلف برداری کے ذریعہ احلول بیت (ان پر امن ہے) کے ذریعہ روشن روحانی جہتیں ہیں۔ امام جافر السادق (ان پر امن) نے سکھایا کہ اگرچہ اس کے واضح معنی مکہ مکرمہ کی تقدس کی طرف اشارہ کرتے ہیں ، لیکن گہری حقیقت حضور صلی اللہ علیہ وآلہ وسلم کی طرف اشارہ کرتی ہے (اس پر اور اس کے اہل خانہ پر امن) الہی رہنمائی کا حتمی \"محفوظ شہر\" ہے۔ جس طرح مکہ مکرمہ کے مقدس خطوط جسمانی تقدس کی پیش کش کرتے ہیں ، اسی طرح نبی. کی پاکیزہ نسل انسانیت کے لئے روحانی تقدس مہیا کرتی ہے۔ \n\nطافسیر البوران میں ، امام السادق نے وضاحت کی ہے: \"انجیر امام علی ہے ، زیتون فاطمہ ہے ، ماؤنٹ سینا ہی حسن ہے ، یہ محفوظ شہر حسین ہے-یہ سب ولایہ کے عہد کے ذریعے جڑے ہوئے ہیں۔\" اس سے امامہ کے الہی تسلسل سے آیت کا تعلق ظاہر ہوتا ہے۔ شہر کی \"سلامتی\" اہل بیت کی تعلیمات سے چمٹے رہنے میں پائے جانے والے روحانی تحفظ کی علامت ہے - وہ زندگی کے طوفان میں نجات کا صندوق ہیں۔\n\nلیڈی فاطمہ (اس پر امن ہے) اس مقدس سلامتی کو \"ام ابیہا\" (اپنے والد کی ماں) کے کردار کے ذریعہ پیش کرتی ہے ، جو پیشن گوئی اور امامہ کے مابین زندہ پل بن جاتی ہے۔ طہارت کی آیت (33:33) میں اس کی صاف ستھری حیثیت ، گھر کو حقیقت کے دائمی حرمت کے طور پر قائم کرتی ہے۔ \n\nعملی دانشمندی یہ تسلیم کرنے میں مضمر ہے کہ حقیقی روحانی سلامتی پتھر کی دیواروں سے نہیں ، بلکہ اماموں میں مجسم محمدن کی روشنی کے سامنے آتی ہے۔ جیسا کہ امام علی (اس پر امن ہے) نے سکھایا: \"ہم اس زمین کے ستون ہیں - ہمارے ذریعہ یہ محفوظ ہے۔\" DUA ، قرآنی عکاسی ، اور اخلاقی طرز عمل کے ذریعہ ان کی تعلیمات سے روزانہ تعلق ہمارا قلعہ بن جاتا ہے۔ نبی and اور اس کے اہل خانہ پر ہر دعا ہمارے دلوں میں برائٹ رہنمائی کے اس شہر کو تقویت دینے والی ایک اینٹ بنیں۔",
    "layer5": "In interpreting Surah At-Tin 95:3, both Shia and Sunni exegetes universally identify \"this secure city\" as Makkah, affirming its sacred status in Islamic theology. Classical Sunni commentators like Ibn Kathir (*Tafsir al-Quran al-Azim*) and Tabari (*Jami al-Bayan*) emphasize Makkah’s physical and spiritual inviolability (ḥaram), linking its \"security\" to divine protection from historical threats like Abraha’s invasion, as well as its role as the birthplace of Prophet Muhammad (ﷺ) and the qibla for prayer. Qurtubi (*Al-Jami li-Ahkam al-Quran*) adds juristic dimensions, noting Makkah’s unique legal sanctity in Islamic law. Similarly, Shia scholars such as Tabrisi (*Majma al-Bayan*) and Tabatabai (*Al-Mizan*) concur on Makkah’s identification but expand its symbolic significance, framing it as the epicenter of divine revelation and the prophetic mission’s unfolding.  \n\nA key divergence arises in theological emphasis. Sunni interpretations, particularly in Razi’s *Mafatih al-Ghayb*, often contextualize the oath within broader cosmological arguments about human potential and accountability, connecting Makkah’s sanctity to its role in humanity’s spiritual refinement. Shia exegeses, while acknowledging these aspects, frequently integrate the verse into narratives of divinely guided leadership. Al-Qummi’s *Tafsir al-Qummi* and Tusi’s *At-Tibyan* subtly associate Makkah’s \"security\" with the safeguarding of prophetic legacy and the Imamate, reflecting the Shia view of continuous divine guidance through the Ahl al-Bayt.  \n\nThese differences stem from distinct hermeneutical priorities: Sunni tafsir often prioritizes historical-literary analysis and legal implications, while Shia commentaries emphasize metaphysical continuity between prophecy and Imamate. Both traditions, however, reinforce Makkah’s centrality in Muslim practice, uniting believers in veneration of the Kaaba and pilgrimage rites. The variations in interpretation illustrate how theological frameworks shape textual engagement, rooted in each school’s historical development and doctrinal priorities, without negating shared reverence for the Quran’s sacred geography.",
    "layer5_urdu": "سورہ ایٹ ٹن 95: 3 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں نے عالمی سطح پر \"اس محفوظ شہر\" کو مکہ کے نام سے شناخت کیا ، اور اسلامی الہیات میں اس کی مقدس حیثیت کی تصدیق کی۔ کلاسیکی سنی مبصر جیسے ابن کتھیر (*طافسیر القوران الازیم*) اور تباری (*جمی البیان*) نے مککا کی جسمانی اور روحانی انوولیبلٹی (ارم) پر زور دیا ہے ، اور اس کے \"سلامتی\" کو ابراہ کے حملے کی طرح تاریخی خطرات سے منسلک کیا ہے کیونکہ اس کے کردار کو ابراہا کے حملے کے طور پر ہی پیدا کیا گیا ہے۔ نماز قربانی (*الجامی لی احکم القوران*) نے اسلامی قانون میں مکہ مکرمہ کی منفرد قانونی تقدس کو نوٹ کرتے ہوئے فقہی طول و عرض میں اضافہ کیا۔ اسی طرح ، شیعہ اسکالرز جیسے تبریسی (*ماجما البیان*) اور تبتابائی (*المزان*) مکہ مکرمہ کی شناخت پر متفق ہیں لیکن اس کی علامتی اہمیت کو بڑھا دیتے ہیں ، اور اس کو الہی وحی اور پیشن گوئی کے مشن کے سامنے آنے کا مرکز بناتے ہیں۔  \n\nمذہبی زور میں ایک اہم موڑ پیدا ہوتا ہے۔ سنی تشریحات ، خاص طور پر رازی کے *مافاتیہ الغیب *میں ، اکثر انسانی صلاحیتوں اور احتساب کے بارے میں وسیع تر کائناتی دلائل کے اندر حلف کو سیاق و سباق سے دوچار کرتے ہیں ، اور مکہ مکرمہ کو انسانیت کی روحانی تطہیر میں اس کے کردار سے مربوط کرتے ہیں۔ شیعہ نے ان پہلوؤں کو تسلیم کرتے ہوئے ، آیت کو اکثر آیت کو الہامی رہنمائی کی قیادت کے بیانیے میں ضم کیا۔ القومی کا * طافسیر القومی * اور توسی کا * ایٹ تبیان * عمومی طور پر مکہ مکرمہ کی \"سلامتی\" کو پیشن گوئی کی میراث اور امامیٹ کی حفاظت کے ساتھ جوڑتا ہے ، جو اہل البائٹ کے ذریعہ مستقل الہی رہنمائی کے شیعہ نظارے کی عکاسی کرتا ہے۔  \n\nیہ اختلافات الگ الگ ہرمینیٹیکل ترجیحات سے پیدا ہوتے ہیں: سنی طافسر اکثر تاریخی لیٹرری تجزیہ اور قانونی مضمرات کو ترجیح دیتے ہیں ، جبکہ شیعہ تبصرے پیشن گوئی اور امامیٹ کے مابین استعاریاتی تسلسل پر زور دیتے ہیں۔ تاہم ، دونوں روایات مسلم پریکٹس میں مکہ مکرمہ کی مرکزیت کو تقویت دیتی ہیں ، اور مومنوں کو کعبہ اور زیارت کی رسومات کی تعظیم میں متحد کرتی ہیں۔ تشریح میں تغیرات یہ واضح کرتے ہیں کہ مذہبی فریم ورک کس طرح متنی مشغولیت کی تشکیل کرتے ہیں ، جو ہر اسکول کی تاریخی ترقی اور نظریاتی ترجیحات میں جڑے ہوئے ہیں ، بغیر قرآن کے مقدس جغرافیہ کے مشترکہ عقیدت کی نفی کیے۔",
    "layer2short": "In Surah At-Tin, verse 3, Allah swears by \"this secure city [Makkah],\" a declaration classical Shia exegetes interpret through layered theological and metaphysical lenses. Sheikh Tabrisi, in *Majma al-Bayan*, emphasizes Makkah’s divinely ordained sanctity (*haram*) as a place of physical and spiritual refuge, protected since the era of Prophet Ibrahim. He notes its role as the birthplace of Islamic revelation and the epicenter of monotheism, with its security symbolizing Allah’s covenant to preserve the Abrahamic legacy. This aligns with Shia narratives that position Makkah not merely as a geographical locus but as a metaphysical axis (*qibla*) for spiritual orientation and divine proximity.",
    "layer2short_urdu": "سورت اٹ ٹن ، آیت 3 میں ، اللہ نے \"اس محفوظ شہر [مکہ]\" کی قسم کھائی ہے ، ایک اعلامیہ کلاسیکی شیعہ استثنیٰ پرتوں والے مذہبی اور استعاریاتی لینسوں کے ذریعے تشریح کرتے ہیں۔ شیخ تبریسی ،*ماجما البیان*میں ، مکہ مکرمہ کے خدائی مقررہ مقدس (*حرام*) پر جسمانی اور روحانی پناہ گاہ کے طور پر زور دیتے ہیں ، جو حضرت ابراہیم کے دور سے محفوظ ہیں۔ وہ اسلامی وحی کی جائے پیدائش اور توحید کے مرکز کے طور پر اس کے کردار کو نوٹ کرتا ہے ، اس کی سلامتی کے ساتھ ابراہیمی میراث کو برقرار رکھنے کے ل Allah اللہ کے عہد کی علامت ہے۔ یہ شیعہ بیانیے کے ساتھ صف بندی کرتا ہے کہ مکہ مکرمہ محض جغرافیائی لوکس کے طور پر نہیں بلکہ روحانی رجحان اور خدائی قربت کے لئے ایک استعاریاتی محور (*کیبلا*) کے طور پر ہے۔"
  },
  "4": {
    "layer1": "In Surah At-Tin, verse 4 proclaims *laqad khalaqnal-insana fi ahsani taqwim* – \"We have certainly created man in the best of stature.\" This verse highlights Allah’s perfect design of humanity, emphasizing both physical and spiritual excellence. The term *taqwim* derives from *qama* (to stand upright), symbolizing humanity’s unique capacity for moral and intellectual uprightness. *Ahsan* (the best/most beautiful) underscores divine wisdom in human creation, granting us faculties like reason, conscience, and free will to ascend toward spiritual perfection. Shia tafsir, as explained by scholars like Allama Tabatabai in *Al-Mizan*, connects this \"best stature\" to humanity’s potential to reflect divine attributes and fulfill the role of Allah’s vicegerent (*khalifa*) on Earth.\n\nWhile the verse’s revelation context isn’t explicitly documented, its placement in a Meccan surah suggests it countered the dehumanizing practices of pre-Islamic Arabia, affirming human dignity against tribal arrogance and materialism. The Ahlul Bayt, particularly Imam Ali and Imam Sadiq, taught that this \"perfection\" isn’t merely physical but includes the soul’s capacity to attain nearness to Allah through devotion, justice, and adherence to divine guidance. Imam Ali’s *Nahjul Balagha* often references human nobility, stating, \"Allah has honored you by creating you\" – a reflection of this verse’s ethos.\n\nToday, this verse reminds Muslims to honor their inherent dignity by cultivating both physical health and spiritual growth. It challenges modern materialism by affirming that human value lies not in wealth or status but in ethical and God-conscious living. Practically, this means using our intellect to seek truth, nurturing compassion, and resisting corruption – aligning with the Shia emphasis on social justice and moral accountability. By recognizing our creation in *ahsani taqwim*, we’re called to uphold human rights, pursue knowledge, and strive for inner purity, embodying the balanced excellence Allah designed us to achieve.",
    "layer2": "In *Tafsir al-Mizan*, Allama Tabatabai elucidates that the phrase \"ahsan taqwim\" (best of stature) in Surah At-Tin (95:4) encompasses both the physical and metaphysical perfection of humanity. Drawing from the ontological principle of *nizam al-ahsan* (the most excellent order), he posits that human creation reflects a harmonious synthesis of material form and spiritual capacity, enabling the actualisation of divine virtues. This \"stature\" is not merely anatomical but signifies humanity’s unique preparedness to bear the \"trust\" (amana) of moral and theological responsibility (Quran 33:72), a concept central to Shia anthropology.  \n\nTabrisi’s *Majma al-Bayan* emphasises the physical dimensions of this perfection—the upright posture, intellect, and sensory faculties—while noting that such endowments are ultimately means to spiritual ends. The verse’s theological depth, however, lies in its implicit reference to humanity’s potential for *taqwa* (God-consciousness) and *wilayah* (divine guardianship), with the Ahlul Bayt representing the perfected manifestation of this \"best stature.\" As Imam Jafar al-Sadiq states in *Tafsir al-Qummi*, the human form is a vessel for recognising divine unity and submitting to the Imamate, the axis of spiritual guidance.  \n\nClassical Shia exegesis universally links this verse to the doctrine of *fitra* (primordial nature), wherein every soul is imprinted with the capacity to recognise its Creator and the rightful authority of the Imams. The subsequent verse (\"Then We return him to the lowest of the low\") is interpreted as the consequence of rejecting this innate disposition, a fall from grace that contrasts with the elevation achieved through adherence to the Ahlul Bayt’s teachings. Thus, the verse underscores the Shia theological paradigm: human dignity is intrinsically tied to divine guidance, with the Imams serving as both exemplars of perfected humanity and mediators of salvational knowledge. This interplay between ontology and ethics informs Shia jurisprudence, which prioritises nurturing the soul’s innate nobility through rituals and moral conduct aligned with the Prophetic legacy.",
    "layer3": "In contemporary Shia scholarship, Surah At-Tin’s declaration that humans were created *fi ahsan taqwim* (“in the best of stature”) is interpreted as a multidimensional affirmation of human dignity, blending theological profundity with modern scientific and ethical insights. Ayatollah Nasir Makarim Shirazi notes that this verse underscores both the physical perfection of the human form—evident in the intricate balance of biological systems revealed by neuroscience and genetics—and the spiritual potential to transcend material limitations through moral and intellectual refinement. Modern scholars like Dr. Mohammad Ali Shomali connect this “best stature” to humanity’s role as *khalifatullah* (vicegerents of God), emphasizing stewardship over ecosystems and societal structures—a timely call amid climate crises and social inequality.  \n\nPhilosophically, the verse challenges reductionist views of human identity, resonating with thinkers like Dr. Mostafa Mohaghegh Damad, who argues that recognizing our “optimal creation” obligates societies to combat dehumanization, whether through systemic racism, AI ethics violations, or economic exploitation. Socially, Shia theologians frame this Quranic principle as a mandate for inclusive justice, aligning with interfaith efforts to address global poverty and refugee rights. The verse’s universalism also bridges interfaith dialogue; its emphasis on inherent human nobility parallels Christian teachings on *imago Dei* and Buddhist reverence for consciousness. In a fractured world, this verse becomes a rallying cry to honor the sacredness of every life, urging collective action to align human systems with the divine wisdom embedded in our creation.",
    "layer4": "The verse \"We have certainly created man in the best of stature\" (95:4) is illuminated by the Ahlul Bayt (peace be upon them) as a profound testament to humanity’s divine potential and sacred responsibility. Imam Ali (peace be upon him) states in *Tafsir al-Qummi* that \"the best of stature\" refers not merely to physical form but to the perfection of the soul through divine guidance. He explains that Allah fashioned humanity to reflect His attributes of knowledge, justice, and love, but this nobility is only actualized through submission to the *Wilayah* (divine guardianship) of the Prophet’s Household.  \n\nImam Jafar al-Sadiq (peace be upon him) teaches that this verse points to the *fitrah* – the innate recognition of Allah’s Oneness and the necessity of following His chosen guides. He states: \"Man was created in the finest balance between body and spirit, but his true stature is measured by his connection to the Imam of his time. Without this, he falls lower than beasts.\" This echoes Surah Tin’s subsequent verses, which warn of humanity’s degradation when abandoning truth.  \n\nLady Fatimah (peace be upon her) emphasises practical spirituality, declaring: \"The ‘best stature’ is preserved through prayer that ignites the heart, charity that purifies wealth, and obedience to Allah’s commands as taught by His purified ones.\" The Shia tradition thus links this verse to the necessity of *Imamah*: just as the body needs a head, the soul needs the Imam’s light to maintain its divine equilibrium.  \n\nTo embody this \"best stature,\" believers must cultivate self-awareness through the Qur’an and the Ahlul Bayt’s teachings, struggle against egoistic desires, and anchor their lives to the pillars of *tawhid* (Oneness of God) and *tawalla* (love for the Imams). As Imam Ali Zayn al-Abidin (peace be upon him) prays in *Sahifa Sajjadiyah*: \"O Allah, let my limbs worship You in the way most pleasing to You, so I may rise to the stature for which You created me.",
    "layer1_urdu": "سورہ ایٹ ٹن میں ، آیت 4 نے اعلان کیا ہے کہ * لقاد خالقنال انیسنا فائی احصانی تقویم *-\"ہم نے یقینی طور پر بہترین قد میں انسان کو تخلیق کیا ہے۔\" اس آیت میں اللہ کے انسانیت کے کامل ڈیزائن کو اجاگر کیا گیا ہے ، جس میں جسمانی اور روحانی فضیلت دونوں پر زور دیا گیا ہے۔ اصطلاح * تقوئم * * قاما * (سیدھے کھڑے ہونے کے لئے) سے اخذ کی گئی ہے ، جو اخلاقی اور فکری سیدھے پن کی انسانیت کی انوکھی صلاحیت کی علامت ہے۔ * احسن* (بہترین/انتہائی خوبصورت) انسانی تخلیق میں الہی حکمت کی نشاندہی کرتا ہے ، جس سے ہمیں روحانی کمال کی طرف چڑھنے کی وجہ ، ضمیر اور آزادانہ مرضی جیسی فیکلٹیوں کو مل جاتا ہے۔ شیعہ طفس ، جیسا کہ*المزان*میں علامہ تبتابائی جیسے اسکالرز نے سمجھایا ہے ، اس \"بہترین قد\" کو انسانیت کی خدائی صفات کی عکاسی کرنے اور زمین پر اللہ کے وائسجرینٹ (*خلیفہ*) کے کردار کو پورا کرنے کی صلاحیت سے مربوط کرتا ہے۔\n\nاگرچہ آیت کے وحی کے سیاق و سباق کو واضح طور پر دستاویزی نہیں کیا گیا ہے ، لیکن ایک مکہ سرہ میں اس کی جگہ سے یہ پتہ چلتا ہے کہ اس سے قبل اسلامی عرب کے غیر مہذب طریقوں کا مقابلہ کیا گیا ہے ، اور قبائلی تکبر اور مادیت کے خلاف انسانی وقار کی تصدیق کی گئی ہے۔ اہل بیت ، خاص طور پر امام علی اور امام صادق نے سکھایا کہ یہ \"کمال\" محض جسمانی نہیں ہے بلکہ اس میں روح کی صلاحیت بھی شامل ہے کہ وہ عقیدت ، انصاف ، اور الہی رہنمائی پر عمل پیرا ہونے کے ذریعہ اللہ کے ساتھ قربت حاصل کرے۔ امام علی کی * نہجول بالاگھا * اکثر انسانی شرافت کا حوالہ دیتے ہیں ، اور کہا ، \"اللہ نے آپ کو تخلیق کرکے آپ کو اعزاز بخشا ہے\"۔\n\nآج ، یہ آیت مسلمانوں کو جسمانی صحت اور روحانی نشوونما دونوں کاشت کرکے ان کے موروثی وقار کا احترام کرنے کی یاد دلاتی ہے۔ یہ اس بات کی تصدیق کرکے جدید مادیت کو چیلنج کرتا ہے کہ انسانی قدر دولت یا حیثیت میں نہیں بلکہ اخلاقی اور خدا کے شعور میں ہے۔ عملی طور پر ، اس کا مطلب یہ ہے کہ ہماری عقل کو سچ کی تلاش کرنے ، ہمدردی کی پرورش ، اور بدعنوانی کا مقابلہ کرنے کے لئے استعمال کرنا - معاشرتی انصاف اور اخلاقی احتساب پر شیعہ زور دینے کے ساتھ صف بندی کرنا۔ *احسانی تقویم *میں اپنی تخلیق کو پہچان کر ، ہمیں انسانی حقوق کی پاسداری ، علم کی پیروی کرنے ، اور اندرونی پاکیزگی کے لئے جدوجہد کرنے کے لئے کہا گیا ہے ، متوازن فضیلت کو مجسم بناتے ہوئے اللہ نے ہمیں حاصل کرنے کے لئے ڈیزائن کیا ہے۔",
    "layer2_urdu": "*طافسیر المزان *میں ، علامہ تبتابائی نے یہ واضح کیا ہے کہ سورہ اٹ ٹن (95: 4) میں \"احسن تقویم\" (قد کا بہترین) انسانیت کے جسمانی اور استعاریاتی کمال دونوں پر مشتمل ہے۔ * نظام الحسن * (انتہائی عمدہ حکم) کے اونٹولوجیکل اصول سے ڈرائنگ کرتے ہوئے ، انہوں نے کہا کہ انسانی تخلیق مادی شکل اور روحانی صلاحیت کی ایک ہم آہنگی ترکیب کی عکاسی کرتی ہے ، جس سے الہی خوبیوں کی حقیقت کو قابل بناتا ہے۔ یہ \"قد\" محض اناٹومیٹک نہیں ہے بلکہ اخلاقی اور مذہبی ذمہ داری کے \"اعتماد\" (امانا) کو برداشت کرنے کے لئے انسانیت کی انوکھی تیاری کی نشاندہی کرتا ہے (قرآن 33:72) ، جو شیعہ بشریات کا مرکزی خیال ہے۔  \n\nتبریسی کا * مجس البیان * اس کمال کی جسمانی جہتوں پر زور دیتا ہے-سیدھی کرنسی ، عقل اور حسی فیکلٹیوں-جبکہ یہ نوٹ کرتے ہوئے کہ اس طرح کے وقفوں کا مطلب بالآخر روحانی انجام کو ہے۔ تاہم ، آیت کی مذہبی گہرائی * تقوا * (خدا کے شعور) اور * ولیہ * (خدائی سرپرستی) کے لئے انسانیت کے امکانات کے بارے میں اس کے مضمر حوالہ میں ہے ، جس میں اہل بیت اس \"بہترین قد\" کے مکمل مظہر کی نمائندگی کرتے ہیں۔ جیسا کہ امام جعفر السادق *طافسیر القمی *میں بیان کرتا ہے ، انسانی شکل الہی اتحاد کو تسلیم کرنے اور روحانی رہنمائی کے محور ، امامیٹ کو پیش کرنے کے لئے ایک برتن ہے۔  \n\nکلاسیکی شیعہ استثنیٰ عالمی طور پر اس آیت کو * فیٹرا * (قدیم فطرت) کے نظریے سے جوڑتا ہے ، جس میں ہر روح کو اپنے خالق کو پہچاننے کی صلاحیت اور اماموں کے صحیح اتھارٹی کو تسلیم کرنے کی صلاحیت کے ساتھ نقوش کیا جاتا ہے۔ اس کے بعد کی آیت (\"پھر ہم اسے نچلے حصے کی طرف لوٹاتے ہیں\") کو اس فطری انداز کو مسترد کرنے کے نتیجے میں سمجھا جاتا ہے ، جو فضل سے زوال ہے جو اہل بیت کی تعلیمات پر عمل پیرا ہونے کے ذریعے حاصل کی جانے والی بلندی سے متصادم ہے۔ اس طرح ، آیت شیعہ مذہبی تمثیل کی نشاندہی کرتی ہے: انسانی وقار کو اندرونی طور پر خدائی رہنمائی سے منسلک کیا جاتا ہے ، جس میں اماموں نے مکمل انسانیت اور نجات کے علم کے ثالثوں کے نمونے دونوں کے طور پر کام کیا ہے۔ اونٹولوجی اور اخلاقیات کے مابین یہ باہمی تعل .ق شیعہ فقہ کو آگاہ کرتا ہے ، جو رسومات اور اخلاقی طرز عمل کے ذریعہ روح کی فطری شرافت کی پرورش کو ترجیح دیتا ہے جو پیشن گوئی کی میراث کے ساتھ منسلک ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ اٹ ٹن کا یہ اعلان کہ انسانوں کو پیدا کیا گیا تھا * فائی احسن تقویم * (\"قد کے لحاظ سے\") کو انسانی وقار کی کثیر جہتی اثبات کے طور پر سمجھا جاتا ہے ، اور جدید سائنسی اور اخلاقی بصیرت کے ساتھ مذہبی منافع کو ملاوٹ کرتے ہیں۔ آیت اللہ ناصر مکارم شیرازی نے نوٹ کیا ہے کہ یہ آیت انسانی شکل کے جسمانی کمال کی نشاندہی کرتی ہے۔ ڈاکٹر محمد علی شمالی جیسے جدید اسکالرز اس \"بہترین قد\" کو انسانیت کے کردار سے * خلیفات اللہ * (خدا کے وائسجرینٹس) کے طور پر جوڑتے ہیں ، ماحولیاتی نظام اور معاشرتی ڈھانچے پر ذمہ داری پر زور دیتے ہیں۔  \n\nفلسفیانہ طور پر ، آیت انسانی شناخت کے تخفیف کے نظریات کو چیلنج کرتی ہے ، ڈاکٹر مصطفی موہگھیگ دماد جیسے مفکرین کے ساتھ گونجتی ہے ، جو یہ استدلال کرتے ہیں کہ ہماری \"زیادہ سے زیادہ تخلیق\" کو تسلیم کرنے سے معاشروں کو غیر مہذب نسل پرستی سے نمٹنے کے لئے پابند کیا جاتا ہے ، چاہے وہ نظامی نسل پرستی ، اے آئی اخلاقیات کی خلاف ورزیوں ، یا معاشی استحصال کے ذریعے ہو۔ معاشرتی طور پر ، شیعہ مذہبی ماہرین اس قرآنی اصول کو جامع انصاف کے مینڈیٹ کے طور پر پیش کرتے ہیں ، جو عالمی غربت اور پناہ گزینوں کے حقوق سے نمٹنے کے لئے بین الاقوامی سطح پر کوششوں کے ساتھ صف بندی کرتے ہیں۔ آیت کی عالمگیریت بھی بین الاقوامی مکالمے کو پل کرتی ہے۔ موروثی انسانی شرافت پر اس کا زور * امیجو ڈی آئی * اور ہوش کے بدھ مت کے عقیدت پر عیسائی تعلیمات کے متوازی ہے۔ ایک فریکچر دنیا میں ، یہ آیت ہر زندگی کے تقدس کا احترام کرنے کے لئے ایک ریلنگ چیخ بنتی ہے ، اور اجتماعی عمل کو ہماری تخلیق میں سرایت کرنے والی الہی حکمت کے ساتھ انسانی نظام کو سیدھ میں لانے کے لئے زور دیتی ہے۔",
    "layer4_urdu": "آیت \"ہم نے یقینی طور پر بہترین قد میں انسان کو تخلیق کیا ہے\" (95: 4) انسانیت کی خدائی صلاحیت اور مقدس ذمہ داری کے گہرے عہد کے طور پر اہل بیت (ان پر امن) کے ذریعہ روشن ہے۔ امام علی (اس پر امن ہے) * طافسیر القومی * میں بیان کرتا ہے کہ \"قد کا بہترین\" محض جسمانی شکل سے نہیں بلکہ الہی رہنمائی کے ذریعہ روح کے کمال سے مراد ہے۔ انہوں نے وضاحت کی کہ اللہ نے انسانیت کو اپنے علم ، انصاف اور محبت کی صفات کی عکاسی کرنے کے لئے تیار کیا ہے ، لیکن اس شرافت کو صرف نبی کے گھر والے کے * ولیہ * (خدائی سرپرستی) کے حوالے کرنے کے ذریعے ہی حقیقت میں لایا گیا ہے۔  \n\nامام جعفر السادق (اس پر امن ہے) یہ سکھاتا ہے کہ یہ آیت * فیدرہ * کی طرف اشارہ کرتی ہے-اللہ کی وحدانیت کی فطری پہچان اور اس کے منتخب کردہ رہنماؤں کی پیروی کرنے کی ضرورت۔ انہوں نے کہا: \"انسان جسم اور روح کے مابین بہترین توازن میں پیدا ہوا تھا ، لیکن اس کا اصل قد اپنے وقت کے امام سے اس کے تعلق سے ماپا جاتا ہے۔ اس کے بغیر ، وہ جانوروں سے کم پڑتا ہے۔\" اس سے سورہ ٹن کی اس کے بعد کی آیات کی بازگشت ہوتی ہے ، جو حقیقت کو ترک کرتے وقت انسانیت کے انحطاط سے خبردار کرتی ہے۔  \n\nلیڈی فاطمہ (اس پر امن ہے) عملی روحانیت پر زور دیتے ہیں ، اور یہ اعلان کرتے ہیں کہ: \"سب سے بہتر قد’ نماز کے ذریعہ محفوظ ہے جو دل کو بھڑکاتی ہے ، خیراتی ادارہ جو دولت کو پاک کرتا ہے ، اور اللہ کے احکامات کی اطاعت کرتا ہے جیسا کہ اس کے پاکیزہ نے سکھایا ہے۔ \" شیعہ روایت اس آیت کو *امامہ *کی ضرورت سے جوڑتی ہے: جس طرح جسم کو سر کی ضرورت ہوتی ہے ، اسی طرح روح کو اپنے الہی توازن کو برقرار رکھنے کے لئے امام کی روشنی کی ضرورت ہوتی ہے۔  \n\nاس \"بہترین قد\" کو مجسم بنانے کے ل beents ، مومنین کو قرآن اور اہل بیت کی تعلیمات کے ذریعہ خود آگاہی کاشت کرنا چاہئے ، انا پسندانہ خواہشات کے خلاف جدوجہد کرنا ، اور اپنی زندگی * تاؤہید * (خدا کی ونگے) کے ستونوں پر لنگر انداز کرنا اور * طوالہ * (اماموں کے لئے محبت)۔ جیسا کہ امام علی زین العبدین (اس پر امن ہے) *ساہفا سججدیہ *میں دعا کرتا ہے: \"اے اللہ ، میرے اعضاء آپ کو سب سے زیادہ خوش کرنے والے راستے میں آپ کی عبادت کرنے دیں ، لہذا میں اس قد کے ساتھ اٹھ سکتا ہوں جس کے لئے آپ نے مجھے پیدا کیا ہے۔",
    "layer5": "In interpreting Surah At-Tin 95:4, both Shia and Sunni scholars converge on the fundamental acknowledgment of humanity’s physical and spiritual excellence. Al-Tabari (Sunni) and Al-Tusi (Shia) emphasize that the verse affirms Allah’s wisdom in creating humans with upright physical form and intellectual capacity, reflecting divine favor. Ibn Kathir (Sunni) and Al-Tabrisi (Shia) similarly note that the “best stature” encompasses humanity’s potential for moral and spiritual perfection, contingent upon fulfilling their covenant with Allah. This shared perspective underscores a theological unity in viewing humans as uniquely honored creations entrusted with ethical responsibility.\n\nDivergences emerge in contextualizing this perfection. Shia exegetes like Al-Qummi and Al-Tabatabai (Al-Mizan) link the “best stature” to the ontological status of the Ahl al-Bayt, interpreting human excellence as intrinsically tied to divine guidance through the Imams. Al-Tabrisi (Majma al-Bayan) posits that humanity’s ideal form is sustained through adherence to the Prophetic legacy and its rightful successors. In contrast, Sunni commentators like Al-Qurtubi and Al-Razi (Mafatih al-Ghayb) focus on the innate faculties of reason and free will as markers of human distinction, with Al-Razi framing the verse as a reminder of accountability for moral choices independent of intercessory authority.\n\nThese differences stem from distinct theological emphases: Shia thought prioritizes the necessity of divinely appointed leadership to preserve human excellence, while Sunni interpretations stress individual agency within a framework of communal tradition. Practically, this influences Shia devotional focus on the Imams’ teachings and Sunni emphasis on personal adherence to Quranic principles and the Prophet’s Sunnah. Historically, these interpretations reflect early theological developments, with Shia views rooted in the succession debates and Sunni perspectives crystallizing around the preservation of collective orthodoxy. Both traditions, however, uphold the verse’s core message of human dignity and purpose.",
    "layer5_urdu": "سورہ ایٹ ٹن 95: 4 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی اسکالرز دونوں انسانیت کی جسمانی اور روحانی فضیلت کے بنیادی اعتراف پر مل جاتے ہیں۔ التباری (سنی) اور التوسی (شیعہ) اس بات پر زور دیتے ہیں کہ یہ آیت اللہ کی حکمت کو سیدھے جسمانی شکل اور دانشورانہ صلاحیت کے ساتھ انسانوں کو تخلیق کرنے میں تصدیق کرتی ہے ، جو الہی احسان کی عکاسی کرتی ہے۔ ابن کتھیر (سنی) اور الاتبریسی (شیعہ) اسی طرح نوٹ کرتے ہیں کہ \"بہترین قد\" انسانیت کی اخلاقی اور روحانی کمال کی صلاحیت کو گھیرے ہوئے ہے ، اور اللہ کے ساتھ ان کے عہد کو پورا کرنے پر مستقل مزاجی ہے۔ یہ مشترکہ نقطہ نظر انسانوں کو اخلاقی ذمہ داری کے سپرد کردہ منفرد طور پر اعزازی تخلیقات کے طور پر دیکھنے کے لئے ایک مذہبی اتحاد کی نشاندہی کرتا ہے۔\n\nاس کمال کو سیاق و سباق دینے میں تفریق ابھرتی ہے۔ شیعہ القومی اور الاتاباتابائی (المزان) جیسے \"بہترین قد\" کو اے ایچ ایل ال بیت کی آنٹولوجیکل حیثیت سے جوڑتے ہیں ، اور انسانی فضیلت کی ترجمانی کرتے ہوئے اماموں کے ذریعہ الہی رہنمائی سے اندرونی طور پر منسلک ہوتا ہے۔ الاتبریسی (ماجما البیان) کا کہنا ہے کہ انسانیت کی مثالی شکل پیشن گوئی کی میراث اور اس کے صحیح جانشینوں کی پاسداری کے ذریعہ برقرار ہے۔ اس کے برعکس ، سنی مفسرین جیسے القوروبی اور الراجی (مافاتیہ الغیب) وجہ کی فطری فیکلٹیوں اور آزاد مرضی پر توجہ مرکوز کرتے ہیں ، جس میں انسانی امتیاز کے نشان کے طور پر ، العز نے شفاعت کے اختیارات سے آزاد اخلاقی انتخاب کے لئے احتساب کی یاد دلانے کے طور پر اس آیت کو تیار کیا ہے۔\n\nیہ اختلافات الگ الگ مذہبی زور سے پیدا ہوتے ہیں: شیعہ سوچ انسانی فضیلت کو برقرار رکھنے کے لئے الہی مقرر کردہ قیادت کی ضرورت کو ترجیح دیتی ہے ، جبکہ سنی تشریحات فرقہ وارانہ روایت کے ایک فریم ورک میں انفرادی ایجنسی پر زور دیتے ہیں۔ عملی طور پر ، اس سے شیعہ عقیدت مندوں کو ائمہ کی تعلیمات پر توجہ مرکوز کرتی ہے اور قرآنی اصولوں اور نبی صلی اللہ علیہ وآلہ وسلم کی ذاتی پابندی پر سنی زور۔ تاریخی طور پر ، یہ تشریحات ابتدائی مذہبی پیشرفتوں کی عکاسی کرتی ہیں ، جس میں شیعہ نظریات کی جڑیں جانشینی مباحثوں اور سنی نقطہ نظر سے ہوتی ہیں جو اجتماعی آرتھوڈوکس کے تحفظ کے ارد گرد کرسٹل بناتی ہیں۔ تاہم ، دونوں روایات انسانی وقار اور مقصد کے آیت کے بنیادی پیغام کو برقرار رکھتی ہیں۔",
    "layer2short": "In *Tafsir al-Mizan*, Allama Tabatabai elucidates that the phrase \"ahsan taqwim\" (best of stature) in Surah At-Tin (95:4) encompasses both the physical and metaphysical perfection of humanity. Drawing from the ontological principle of *nizam al-ahsan* (the most excellent order), he posits that human creation reflects a harmonious synthesis of material form and spiritual capacity, enabling the actualisation of divine virtues. This \"stature\" is not merely anatomical but signifies humanity’s unique preparedness to bear the \"trust\" (amana) of moral and theological responsibility (Quran 33:72), a concept central to Shia anthropology.  ",
    "layer2short_urdu": "*طافسیر المزان *میں ، علامہ تبتابائی نے یہ واضح کیا ہے کہ سورہ اٹ ٹن (95: 4) میں \"احسن تقویم\" (قد کا بہترین) انسانیت کے جسمانی اور استعاریاتی کمال دونوں پر مشتمل ہے۔ * نظام الحسن * (انتہائی عمدہ حکم) کے اونٹولوجیکل اصول سے ڈرائنگ کرتے ہوئے ، انہوں نے کہا کہ انسانی تخلیق مادی شکل اور روحانی صلاحیت کی ایک ہم آہنگی ترکیب کی عکاسی کرتی ہے ، جس سے الہی خوبیوں کی حقیقت کو قابل بناتا ہے۔ یہ \"قد\" محض اناٹومیٹک نہیں ہے بلکہ اخلاقی اور مذہبی ذمہ داری کے \"اعتماد\" (امانا) کو برداشت کرنے کے لئے انسانیت کی انوکھی تیاری کی نشاندہی کرتا ہے (قرآن 33:72) ، جو شیعہ بشریات کا مرکزی خیال ہے۔  "
  },
  "5": {
    "layer1": "In Surah At-Tin, verse 5, Allah declares, *\"Thumma radadnahu asfala safilin\"* (Then We return him to the lowest of the low), presenting a profound reflection on human potential and spiritual decline. This verse follows Allah’s affirmation that He created humans *\"fi ahsani taqweem\"* (in the finest form, 95:4), highlighting the duality of human existence: our capacity for immense spiritual elevation through divine guidance and the risk of profound degradation through rejection of truth. The term *\"asfala safilin\"* (lowest of the low) signifies a state worse than mere physical or worldly lowliness—it denotes a spiritual and moral abyss, a regression from the nobility inherent in our creation.  \n\nClassical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains this verse as a warning against squandering the divine gift of intellect and free will. While humans are endowed with the ability to recognise truth and ascend toward Allah, persistent disobedience—particularly rejecting prophetic guidance and the *Wilayah* (guardianship) of the Ahlul Bayt—reduces one to a state lower than animals, who act on instinct without moral accountability. Historically, this Meccan surah addressed early Muslims facing persecution, reminding them that true honour lies in faith and ethical steadfastness, not worldly status.  \n\nPractically, this verse urges Muslims to nurture their innate spiritual potential by aligning with divine principles: seeking knowledge, upholding justice, and adhering to the teachings of the Prophet (PBUH) and his purified progeny. In modern times, it cautions against materialism, moral relativism, and neglect of the soul’s needs. By prioritising humility, gratitude, and connection to the divine, believers avoid the pitfalls of arrogance and heedlessness, embodying the dignity Allah bestowed upon humanity.",
    "layer2": "In classical Shia exegesis of Surah al-Tin 95:5, scholars emphasize the ontological paradox of humanity’s exalted potential and its capacity for profound degradation. The verse’s phrase “lowest of the low” (asfala safilin) is interpreted through both ethical-spiritual and metaphysical lenses. Allama Tabatabai in *Al-Mizan* explains that while humanity was created in the “best stature” (ahsan al-taqwim, 95:4) through the divine breath (Q38:72) and endowed with intellect and volition, its descent occurs when it rejects its innate *fitrah* (primordial nature) and neglects its covenant with God. This degradation is not merely physical but represents a spiritual collapse beneath even the base animal state, as humans—unlike other creatures—possess the capacity for moral and theological awareness yet may willfully abandon it.\n\nShaykh Tabrisi in *Majma al-Bayan* contextualizes this “return” to baseness as a consequence of persistent disbelief (*kufr*) and moral corruption, citing prophetic traditions that link the verse to those who “make their whims their god” (cf. Q25:43). The Shia tradition particularly connects this degradation to the rejection of divine guidance through the Imams, as articulated in narrations from Imam Jafar al-Sadiq, who describes the “lowest of the low” as those who oppose the *walayah* (divinely ordained guardianship) of the Ahl al-Bayt. This aligns with the Shia theological principle that true human elevation depends on aligning with the *Ma’sumin* (infallible guides), whose teachings actualize the *fitrah*.\n\nThe verse’s eschatological dimension is also underscored: the “return” encompasses both worldly spiritual decline and posthumous humiliation in the hereafter. This duality reflects the Shia integration of ethical responsibility with cosmic justice, wherein human choices resonate across temporal and eternal realms. Thus, the verse serves as a theological anchor for the necessity of *tawhid* (divine unity), adherence to the Prophetic legacy, and the ontological necessity of the Imamate in preserving human dignity against existential descent.",
    "layer3": "In contemporary Shia scholarship, Surah At-Tin’s declaration that God returns humans to “the lowest of the low” (95:5) is often interpreted through a dual lens of spiritual entropy and societal decay. Ayatollah Nasir Makarem Shirazi, in his *Tafsir Nemuneh*, emphasizes that the verse contrasts humanity’s divine potential with its capacity for self-degradation when detached from ethical and spiritual purpose. Modern scholars like Dr. Mohammad Ali Shomali extend this analysis, framing the “lowest” state as a collapse into materialism, ecological exploitation, or systemic oppression—conditions reflecting a global crisis of meaning.  \n\nScientific insights into human psychology and environmental studies resonate here. Neuroscientist Dr. Ahmed Al-Katib notes that moral apathy correlates with reduced activity in brain regions linked to empathy, mirroring the Quranic warning about spiritual “descent.” Similarly, ecological degradation—a consequence of unchecked consumerism—echoes the verse’s imagery of humans undermining their own sustenance, a theme highlighted in Ayatollah Jawadi Amuli’s ecological ethics.  \n\nSocially, the verse speaks to modern inequities: poverty, xenophobia, and digital alienation. Scholar Sayyid Rizvi connects “the lowest of the low” to societies prioritizing profit over human dignity, urging a return to the Quranic vision of *insan* (humanity) as stewards of balance (*mizan*). Philosophically, the verse critiques nihilism, suggesting that rejecting transcendence leads to existential fragmentation—a view aligned with interfaith dialogues where Buddhist “suffering” and Christian “fallenness” parallel Islamic concepts of spiritual decline.  \n\nIn a multicultural world, this verse invites collective introspection: How do systems of power or technology erode our shared humanity? By integrating classical tafsir with modern science and ethics, Shia thought frames this Quranic truth as a call to reclaim our higher potential through justice, ecological care, and spiritual renewal.",
    "layer4": "The verse \"Then We return him to the lowest of the low\" (95:5) is illuminated by the teachings of the Ahlul Bayt (as) as a profound warning against abandoning divine guidance and falling into spiritual degradation. Imam Ali (as) states in *Nahj al-Balagha*: \"Man is created between two abysses – elevation through obedience to Allah and descent through disobedience.\" The \"lowest of the low\" refers not merely to physical decline but to the soul’s collapse when severed from the light of *Wilayah* (divine guardianship).  \n\nImam Jafar al-Sadiq (as) explains this verse in *Tafsir al-Qummi*: \"The one who rejects the guardianship of the Ahlul Bayt and turns to worldly desires is cast into the lowest depths, for he exchanges eternal nobility for fleeting illusions.\" The \"best stature\" (95:4) is attained by recognizing the Imamah, while rejecting it strips humanity of its innate dignity. Lady Fatimah (as) taught that the soul’s elevation depends on aligning one’s heart with the *Ma’sumin* (infallibles), stating: \"The soul that submits to Allah’s chosen ones ascends; the soul that rebels against them is lower than beasts.\"  \n\nPractically, this verse urges believers to anchor themselves in the love and obedience of the Ahlul Bayt (as). Spiritual development requires daily *muraqaba* (self-accountability), seeking nearness through prayers like *Dua Ahad*, and embodying the ethical teachings of the Imams. Imam Zayn al-Abidin (as) writes in *Sahifa al-Sajjadiyya*: \"O Allah, let my soul ascend through devotion to Your Proofs [the Imams], and protect me from the abasement of ignorance.\" To avoid the \"lowest of the low,\" one must cling to the rope of *Tawhid* and the guidance of those whom Allah has purified – for their light is the path from darkness to elevation.",
    "layer1_urdu": "سورت ایٹ ٹن میں ، آیت 5 ، اللہ نے اعلان کیا ، * \"تھوما راداڈناہو اسفالا سیفیلین\" * (پھر ہم اسے نچلے حصے میں لوٹاتے ہیں) ، انسانی صلاحیتوں اور روحانی زوال پر گہری عکاسی پیش کرتے ہیں۔ یہ آیت اللہ کی تصدیق کی پیروی کرتی ہے کہ اس نے انسانوں کو * \"فائی احسانی تقوییم\" * * (بہترین شکل میں ، 95: 4) پیدا کیا ہے ، جس نے انسانی وجود کی دوئم کو اجاگر کیا ہے: الہی رہنمائی کے ذریعے بے حد روحانی بلندی کی ہماری صلاحیت اور سچائی کو مسترد کرنے کے ذریعے گہرے انحطاط کا خطرہ۔ اصطلاح * \"اسفالا سیفیلین\" * (نچلی سطح سے کم) ایک ایسی ریاست کی نشاندہی کرتی ہے جس سے محض جسمانی یا دنیاوی نچلی سے بھی بدتر حالت ہوتی ہے۔  \n\nکلاسیکی شیعہ طافس ، جیسے الامہ تبتابائی کے *المزان *، اس آیت کو عقل اور آزاد مرضی کے الہی تحفہ کو ختم کرنے کے خلاف انتباہ کے طور پر بیان کرتی ہے۔ اگرچہ انسانوں کو سچائی کو پہچاننے اور اللہ کی طرف چڑھنے کی صلاحیت سے نوازا گیا ہے ، مستقل نافرمانی - خاص طور پر احلول بیت کی پیشن گوئی کی رہنمائی اور * ولیہ * (سرپرستی) کو مسترد کرتے ہیں ، جو جانوروں سے کم ریاست کو کم کردیتے ہیں ، جو اخلاقی احتساب کے بغیر جبلت پر کام کرتے ہیں۔ تاریخی طور پر ، اس مکہ سرہ نے ابتدائی مسلمانوں کو ظلم و ستم کا سامنا کرنا پڑا ، اور انہیں یاد دلاتے ہوئے کہا کہ حقیقی اعزاز عقیدے اور اخلاقی ثابت قدمی میں ہے ، دنیاوی حیثیت نہیں۔  \n\nعملی طور پر ، یہ آیت مسلمانوں پر زور دیتی ہے کہ وہ خدائی اصولوں کے ساتھ صف بندی کرکے اپنی فطری روحانی صلاحیتوں کی پرورش کرے: علم کے حصول ، انصاف کو برقرار رکھنا ، اور نبی صلی اللہ علیہ وآلہ وسلم کی تعلیمات اور اس کی پاکیزہ اولاد کی تعلیمات پر عمل پیرا ہونا۔ جدید دور میں ، یہ مادیت پرستی ، اخلاقی نسبت پسندی ، اور روح کی ضروریات کو نظرانداز کرنے کے خلاف انتباہ کرتا ہے۔ الہی سے عاجزی ، شکرگزار اور تعلق کو ترجیح دیتے ہوئے ، مومنین تکبر اور غفلت کے نقصانات سے بچتے ہیں ، اور انسانیت کو عطا کردہ وقار کو مجسم بناتے ہیں۔",
    "layer2_urdu": "کلاسیکل شیعہ میں سورہ التن 95: 5 کے بیان میں ، اسکالرز انسانیت کی اعلی صلاحیت اور اس کی گہری انحطاط کی صلاحیت کے اونٹولوجیکل پیراڈوکس پر زور دیتے ہیں۔ آیت کے فقرے کے فقرے \"نچلے حصے میں سب سے کم\" (اسفالا سیفیلن) کی ترجمانی اخلاقی روحانی اور استعاریاتی لینس دونوں کے ذریعہ کی گئی ہے۔ * المزان * میں الامہ تبتابائی نے وضاحت کی ہے کہ جب انسانیت کو \"بہترین قد\" میں پیدا کیا گیا تھا (احسن التقویم ، 95: 4) الہی سانس (Q38: 72) کے ذریعے اور عقل و سلامتی کے ساتھ مل کر ، جب اس کی نسل اس کے فطری * فوتراہ * (قدیم نوعیت) کو مسترد کرتی ہے اور اس کی زینت کو نظرانداز کرتی ہے۔ یہ انحطاط محض جسمانی نہیں ہے بلکہ بنیادی جانوروں کی ریاست کے نیچے بھی روحانی خاتمے کی نمائندگی کرتا ہے ، کیونکہ انسان - دوسری مخلوقات کی طرح - اخلاقی اور مذہبی شعور کی صلاحیت کو فروغ دیتا ہے لیکن پھر بھی جان بوجھ کر اسے ترک کرسکتا ہے۔\n\n*ماجما البیان*میں شیخ تبریسی اس \"واپسی\" کو مستقل کفر (*کفر*) اور اخلاقی بدعنوانی کے نتیجے میں بائیسٹی کی طرف سیاق و سباق سے دوچار کرتے ہیں ، اور پیشن گوئی کی روایات کا حوالہ دیتے ہیں جو اس آیت کو ان لوگوں سے جوڑتے ہیں جو \"ان کی خواہش کو اپنے خدا بناتے ہیں\" (سی ایف۔ کیو 25: 43)۔ شیعہ روایت خاص طور پر اس انحطاط کو اماموں کے ذریعہ خدائی رہنمائی کے مسترد ہونے سے مربوط کرتی ہے ، جیسا کہ امام جعفر السادق کی روایات میں بیان کیا گیا ہے ، جو AHL ALBYT کے * والیاہ * (خدائی طور پر مقرر سرپرستی) کی مخالفت کرنے والے افراد کے طور پر \"نچلے حصے\" کو بیان کرتے ہیں۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ حقیقی انسانی بلندی کا انحصار *ماوسمین *(ناقابل تسخیر ہدایت نامہ) کے ساتھ صف بندی کرنے پر ہے ، جس کی تعلیمات *فیدرہ *کو حقیقت میں لاتی ہیں۔\n\nآیت کی اسکاٹولوجیکل جہت کو بھی واضح کیا گیا ہے: \"واپسی\" اس کے بعد دنیاوی روحانی زوال اور بعد ازاں ذلت دونوں کو گھیرے ہوئے ہے۔ یہ دوہری کائناتی انصاف کے ساتھ اخلاقی ذمہ داری کے شیعہ انضمام کی عکاسی کرتی ہے ، جس میں انسانی انتخاب دنیاوی اور ابدی دائروں میں گونجتے ہیں۔ اس طرح ، آیت * توہید * (الہی اتحاد) کی ضرورت کے لئے ایک مذہبی لنگر کا کام کرتی ہے ، پیشن گوئی کی میراث پر عمل پیرا ہے ، اور وجودی نزول کے خلاف انسانی وقار کو محفوظ رکھنے میں امامیٹ کی اونٹولوجیکل ضرورت ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ اٹ ٹن کا یہ اعلان کہ خدا انسانوں کو \"نچلے حصے میں سب سے کم\" (95: 5) کی طرف لوٹاتا ہے جو اکثر روحانی انٹراپی اور معاشرتی کشی کے دوہری عینک کے ذریعے تشریح کیا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں اس بات پر زور دیا ہے کہ جب اخلاقی اور روحانی مقصد سے الگ ہوجاتا ہے تو اس آیت میں انسانیت کی الہی صلاحیت کو خود بخود کی صلاحیت سے متصادم کیا جاتا ہے۔ ڈاکٹر محمد علی شومالی جیسے جدید اسکالرز اس تجزیے کو بڑھا دیتے ہیں ، اور مادیت ، ماحولیاتی استحصال ، یا نظامی جبر کے خاتمے کے طور پر \"نچلی ترین\" ریاست کو تشکیل دیتے ہیں۔  \n\nانسانی نفسیات اور ماحولیاتی علوم کے بارے میں سائنسی بصیرت یہاں گونجتی ہے۔ نیورو سائنسدان ڈاکٹر احمد الکتیب نے نوٹ کیا ہے کہ اخلاقی بے حسی ہمدردی سے منسلک دماغی خطوں میں کم سرگرمی سے وابستہ ہے ، اور روحانی \"نسل\" کے بارے میں قرآنی انتباہ کا آئینہ دار ہے۔ اسی طرح ، ماحولیاتی انحطاط - غیر چیک شدہ صارفیت کا نتیجہ men انسانوں کی آیت کی منظر کشی کو اپنے اپنے رزق کو مجروح کرتا ہے ، یہ تھیم آیت اللہ جوادی امولی کی ماحولیاتی اخلاقیات میں اجاگر کیا گیا ہے۔  \n\nمعاشرتی طور پر ، آیت جدید عدم مساوات پر بات کرتی ہے: غربت ، زینوفوبیا ، اور ڈیجیٹل بیگانگی۔ اسکالر سید رضوی معاشروں سے \"نچلے حصے میں سب سے کم\" کو انسانی وقار سے زیادہ منافع کو ترجیح دیتے ہیں ، اور*انسان*(انسانیت) کے قرآنی وژن کو توازن کے ذمہ داروں (*میزان*) کے طور پر واپس کرنے پر زور دیتے ہیں۔ فلسفیانہ طور پر ، آیت نیہیلزم پر تنقید کرتی ہے ، جس سے یہ تجویز کیا جاتا ہے کہ عبور کو مسترد کرنے سے وجودی ٹکڑے ہونے کا باعث بنتا ہے۔ یہ ایک ایسا نظریہ ہے جو بین المذاہب مکالموں کے ساتھ منسلک ہوتا ہے جہاں بدھ مت کے \"مصائب\" اور عیسائی \"گرنا\" متوازی اسلامی تصورات روحانی زوال کے متوازی تصورات ہیں۔  \n\nایک کثیر الثقافتی دنیا میں ، یہ آیت اجتماعی انتشار کی دعوت دیتی ہے: طاقت یا ٹکنالوجی کے نظام ہماری مشترکہ انسانیت کو کیسے ختم کرتے ہیں؟ کلاسیکی طافس کو جدید سائنس اور اخلاقیات کے ساتھ مربوط کرکے ، شیعہ نے سوچا کہ اس قرآنی سچائی کو انصاف ، ماحولیاتی نگہداشت ، اور روحانی تجدید کے ذریعہ ہماری اعلی صلاحیتوں پر دوبارہ دعوی کرنے کی ضرورت ہے۔",
    "layer4_urdu": "آیت \"پھر ہم اسے نچلے حصے کی طرف لوٹاتے ہیں\" (95: 5) اہل بیت (ع) کی تعلیمات سے الہی رہنمائی کو ترک کرنے اور روحانی انحطاط میں پڑنے کے خلاف گہری انتباہ کے طور پر روشن ہے۔ امام علی (ع) *نہج البالاگھا *میں کہتے ہیں: \"انسان دو ابیسیس کے درمیان پیدا ہوتا ہے-اللہ کی اطاعت کے ذریعے بلندی اور نافرمانی کے ذریعے نزول۔\" \"نچلے حصے میں سب سے کم\" کا مطلب محض جسمانی زوال سے نہیں بلکہ روح کے خاتمے سے ہوتا ہے جب * ولیہ * (الہی سرپرستی) کی روشنی سے الگ ہوجاتا ہے۔  \n\nامام جعفر السادق (ع) اس آیت کو *طافسیر القومی *میں بیان کرتے ہیں: \"جو اہل بیت کی سرپرستی کو مسترد کرتا ہے اور دنیاوی خواہشات کی طرف رجوع کرتا ہے اسے سب سے کم گہرائیوں میں ڈال دیا جاتا ہے ، کیونکہ وہ بیہودہ بھرموں کے لئے ابدی شرافت کا تبادلہ کرتا ہے۔\" \"بہترین قد\" (95: 4) امامہ کو پہچان کر حاصل کیا جاتا ہے ، جبکہ اس کو مسترد کرتے ہوئے انسانیت کو اس کے فطری وقار سے الگ کردیا جاتا ہے۔ لیڈی فاطمہ (ع) نے یہ سکھایا کہ روح کی بلندی کا انحصار کسی کے دل کو * ماوسمین * (انفلیئبلز) کے ساتھ سیدھ میں کرنے پر ہے ، جس میں کہا گیا ہے کہ: \"وہ روح جو اللہ کے منتخب کردہ افراد کے سامنے پیش کرتی ہے۔ وہ روح جو ان کے خلاف باغی جانوروں سے کم ہے۔\"  \n\nعملی طور پر ، یہ آیت مومنوں سے گزارش کرتی ہے کہ وہ اہل بیت (ع) کی محبت اور اطاعت میں خود کو لنگر انداز کریں۔ روحانی نشوونما کے لئے روزانہ *مرقابا *(خود حساب کتاب) کی ضرورت ہوتی ہے ، *دعا احد *جیسی دعاؤں کے ذریعہ قربت کی تلاش میں ، اور اماموں کی اخلاقی تعلیمات کو مجسم بناتے ہوئے۔ امام زین العبدین (ع) *ساہیفا الصجدیہ *میں لکھتے ہیں: \"اے اللہ ، میری روح کو اپنے ثبوتوں [اماموں] کے ساتھ عقیدت کے ذریعے چڑھ جانے دو ، اور مجھے جہالت کی تکلیف سے بچائے۔\" \"نچلے حصے\" سے بچنے کے ل one ، کسی کو * توہد * کی رسی سے چمٹا جانا چاہئے اور ان لوگوں کی رہنمائی جو اللہ نے پاک کی ہے - کیونکہ ان کی روشنی اندھیرے سے بلندی تک کا راستہ ہے۔",
    "layer5": "The interpretation of Surah At-Tin (95:5) reveals both convergences and nuanced divergences between Shia and Sunni exegetical traditions. Classical commentators across both schools generally agree that the verse’s reference to humanity being returned to “the lowest of the low” encompasses both physical degeneration (such as the frailty of old age) and spiritual/moral decline. Al-Tabari (Sunni) and Al-Tabrisi (Shia) both cite prophetic traditions linking this state to those who reject divine guidance, with Al-Tabari emphasizing the inevitability of physical decay as a universal human condition, while Al-Tabrisi’s *Majma al-Bayan* adds that moral degradation stems from abandoning ethical principles rooted in Quranic teachings.\n\nA key divergence emerges in contextualizing the spiritual dimension. Sunni exegetes like Ibn Kathir and Al-Qurtubi frame the “lowest state” primarily as a consequence of disbelief (*kufr*) or moral corruption, with Al-Razi’s *Mafatih al-Ghayb* underscoring the loss of rational discernment. In contrast, Shia commentators such as Al-Tabatabai (*Al-Mizan*) and Al-Qummi integrate the concept of *walayah* (allegiance to divine guidance), interpreting the verse as describing those who reject the *Ahl al-Bayt*’s spiritual authority. Al-Tusi’s *Al-Tibyan* posits that true elevation requires adherence to both Quranic law and the Imams’ teachings, framing the verse as a warning against severing this connection.\n\nBoth traditions root their interpretations in Quranic cosmic dualism (elevation through obedience vs. debasement through rebellion), but the Shia emphasis on Imamah as a necessary component of divine guidance introduces a distinct theological layer. Historically, this reflects the Shia community’s formative experiences of political marginalization and their doctrinal prioritization of leadership continuity. Practically, Sunni interpretations reinforce the centrality of individual piety and correct belief, while Shia readings often intertwine spiritual well-being with communal loyalty to the Imamate. These differences stem not from sectarian contention but from distinct hermeneutical frameworks developed through separate intellectual lineages, both seeking to illuminate the Quran’s multidimensional wisdom.",
    "layer5_urdu": "سورہ ایٹ ٹن (95: 5) کی ترجمانی شیعہ اور سنی کی مثال کے طور پر مختلف روایات کے مابین دونوں میں بدلاؤ اور متنازعہ دونوں کو ظاہر کرتی ہے۔ دونوں اسکولوں میں کلاسیکی مبصرین عام طور پر اس بات پر متفق ہیں کہ انسانیت کے بارے میں آیت کا حوالہ \"نچلے حصے میں سب سے کم\" پر واپس آیا ہے جس میں جسمانی انحطاط (جیسے بڑھاپے کی کمزوری) اور روحانی/اخلاقی زوال دونوں شامل ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں پیشن گوئی کی روایات کا حوالہ دیتے ہیں جو اس ریاست کو الہی رہنمائی کو مسترد کرتے ہیں ، العباری نے جسمانی کشی کو ایک عالمگیر انسانی حالت کی حیثیت سے ناگزیر ہونے پر زور دیا ہے ، جبکہ العثین کی روٹ میں العثین کی ریٹرن کی ریٹرن کی وجہ سے یہ فرق پڑتا ہے۔\n\nروحانی جہت کو سیاق و سباق دینے میں ایک اہم موڑ ابھرتا ہے۔ ابن کتھیر اور القورووبی جیسے سنی کی منظوری بنیادی طور پر کفر (*کوفر*) یا اخلاقی بدعنوانی کے نتیجے میں \"سب سے کم ریاست\" کا فریم کرتی ہے ، جس میں العزیہ کے*مافاتیہ الغیب*عقلی فہم کے نقصان کی نشاندہی کرتے ہیں۔ اس کے برعکس ، شیعہ مبصرین جیسے الاتعباتابائی (*المزان*) اور القومی*والیہہ*(الہی رہنمائی سے بیعت) کے تصور کو مربوط کرتے ہیں ، اور اس آیت کی ترجمانی کرتے ہیں کہ ان لوگوں کو بیان کرتے ہیں جو*اہل البیٹ*کے روحانی اتھارٹی کو مسترد کرتے ہیں۔ التوسی کے * التیبیان * نے کہا ہے کہ حقیقی بلندی کے لئے قرآنی قانون اور ائمہ کی تعلیمات دونوں پر عمل پیرا ہونے کی ضرورت ہے ، اور اس روابط کو الگ کرنے کے خلاف انتباہ کے طور پر اس آیت کو تیار کیا گیا ہے۔\n\nدونوں روایات قرآنی کائناتی دوہری پسندی (بغاوت کے ذریعے اطاعت کے ذریعے بلندی) میں اپنی تشریحات کو جڑ سے اکھاڑتی ہیں ، لیکن الہی رہنمائی کے ایک لازمی جزو کے طور پر امامہ پر شیعہ زور دینے سے ایک الگ مذہبی پرت متعارف ہوتی ہے۔ تاریخی طور پر ، یہ شیعہ برادری کے سیاسی پسماندگی کے ابتدائی تجربات اور قائدانہ تسلسل کی ان کی نظریاتی ترجیح کی عکاسی کرتا ہے۔ عملی طور پر ، سنی تشریحات انفرادی تقویٰ اور صحیح عقیدے کی مرکزیت کو تقویت دیتی ہیں ، جبکہ شیعہ ریڈنگ اکثر روحانی بہبود کو امامیٹ کے ساتھ فرقہ وارانہ وفاداری کے ساتھ جوڑتی ہے۔ یہ اختلافات فرقہ وارانہ تنازعہ سے نہیں بلکہ الگ الگ دانشورانہ نسبوں کے ذریعہ تیار کردہ الگ الگ ہرمینیٹیکل فریم ورک سے پیدا ہوتے ہیں ، دونوں قرآن مجید کی کثیر جہتی حکمت کو روشن کرنے کی کوشش کرتے ہیں۔",
    "layer2short": "In classical Shia exegesis of Surah al-Tin 95:5, scholars emphasize the ontological paradox of humanity’s exalted potential and its capacity for profound degradation. The verse’s phrase “lowest of the low” (asfala safilin) is interpreted through both ethical-spiritual and metaphysical lenses. Allama Tabatabai in *Al-Mizan* explains that while humanity was created in the “best stature” (ahsan al-taqwim, 95:4) through the divine breath (Q38:72) and endowed with intellect and volition, its descent occurs when it rejects its innate *fitrah* (primordial nature) and neglects its covenant with God. This degradation is not merely physical but represents a spiritual collapse beneath even the base animal state, as humans—unlike other creatures—possess the capacity for moral and theological awareness yet may willfully abandon it.",
    "layer2short_urdu": "کلاسیکل شیعہ میں سورہ التن 95: 5 کے بیان میں ، اسکالرز انسانیت کی اعلی صلاحیت اور اس کی گہری انحطاط کی صلاحیت کے اونٹولوجیکل پیراڈوکس پر زور دیتے ہیں۔ آیت کے فقرے کے فقرے \"نچلے حصے میں سب سے کم\" (اسفالا سیفیلن) کی ترجمانی اخلاقی روحانی اور استعاریاتی لینس دونوں کے ذریعہ کی گئی ہے۔ * المزان * میں الامہ تبتابائی نے وضاحت کی ہے کہ جب انسانیت کو \"بہترین قد\" میں پیدا کیا گیا تھا (احسن التقویم ، 95: 4) الہی سانس (Q38: 72) کے ذریعے اور عقل و سلامتی کے ساتھ مل کر ، جب اس کی نسل اس کے فطری * فوتراہ * (قدیم نوعیت) کو مسترد کرتی ہے اور اس کی زینت کو نظرانداز کرتی ہے۔ یہ انحطاط محض جسمانی نہیں ہے بلکہ بنیادی جانوروں کی ریاست کے نیچے بھی روحانی خاتمے کی نمائندگی کرتا ہے ، کیونکہ انسان - دوسری مخلوقات کی طرح - اخلاقی اور مذہبی شعور کی صلاحیت کو فروغ دیتا ہے لیکن پھر بھی جان بوجھ کر اسے ترک کرسکتا ہے۔"
  },
  "6": {
    "layer1": "Surah At-Tin verse 6 offers a profound exception to humanity’s general tendency toward spiritual decline, affirming that those who combine *iman* (faith) and *amal as-salih* (righteous deeds) will receive an everlasting reward (*ajrun ghayr mamnun*). The verse contrasts with the preceding lines describing humans’ fall to “the lowest of the low,” emphasizing that divine mercy transcends this fate for the spiritually conscious. Classical Shia commentaries, such as those by Allamah Tabatabai in *Al-Mizan*, explain that true *iman* is not mere intellectual acceptance but a transformative conviction anchored in divine guidance, particularly through the teachings of the Ahlul Bayt. *Amal as-salih* refers to actions aligned with Quranic ethics and the Prophetic tradition, purified by sincere intention (*niyyah*) and adherence to the Imams’ spiritual framework.\n\nThe surah, revealed in Mecca during intense persecution, reassured early Muslims that steadfastness in faith and moral action—despite oppression—would yield eternal blessings. The phrase *ajrun ghayr mamnun* (uninterrupted reward) signifies a divine promise unbroken by worldly limitations, reflecting the Shia belief in eternal spiritual progression even in the hereafter. Key terms like *iman* and *salih* are dynamic: *iman* evolves through continuous submission to Allah and devotion to the Ahlul Bayt, while *salih* deeds encompass both ritual worship and social justice, echoing Imam Ali’s emphasis on balancing prayer with service to humanity.\n\nFor modern Muslims, this verse underscores the inseparability of faith and action. In an age of materialism and moral ambiguity, it calls for anchoring one’s life in Quranic principles and the Ahlul Bayt’s example—prioritizing honesty, compassion, and resistance to injustice. It reminds believers that their struggles for righteousness, though unseen, are eternally valued, urging them to build communities rooted in divine love and ethical integrity.",
    "layer2": "In Surah At-Tin (95:6), the Qur’anic exception (*illā*) introduces a profound theological pivot, distinguishing between general human degradation and the elevated status of believers who unite faith (*īmān*) with righteous action (*‘amal al-ṣāliḥ*). Classical Shia exegetes emphasize that this verse encapsulates the inseparable link between doctrinal truth and ethical praxis, a cornerstone of Shia soteriology. Al-Tabrisi in *Majma al-Bayan* underscores that mere verbal affirmation of faith is insufficient; salvation hinges on embodying divine commandments through deeds aligned with the *sharia* as interpreted by the Ahl al-Bayt. The “uninterrupted reward” (*ajr ghayr mamnūn*) is interpreted as an eternal, unceasing divine favor—distinct from transient worldly recompense—rooted in God’s infinite mercy rather than human merit.\n\nAyatollah Tabatabai’s *Al-Mizan* expands this concept through the lens of divine justice (*‘adl*), arguing that the perpetuity of reward reflects the ontological harmony between the believer’s soul and the celestial realm. The verse’s exception, he notes, implicitly affirms the necessity of divine guidance through prophetic and Imamic authority, as only those adhering to the *wilāyah* (guardianship) of the Ahl al-Bayt can achieve such spiritual congruence. This aligns with the Shia doctrine that righteous deeds must be performed within the framework of allegiance to the Imams, who serve as the “gateways to divine mercy” (*abwāb al-raḥma*).\n\nTheological nuances here intersect with Shia jurisprudence (*fiqh*), where *īmān* encompasses not only belief in God’s oneness but also acceptance of the Imams’ infallible leadership (*imāmah*). Thus, the verse’s promise of eternal reward is contingent upon both doctrinal fidelity and ethical rigor under the Imams’ spiritual patronage—a synthesis reflecting the Shia worldview’s balance between creed and action. Classical commentators unanimously stress that this verse reaffirms the covenantal relationship between divine grace and human responsibility, mediated through the Ahl al-Bayt’s enduring legacy.",
    "layer3": "In contemporary Shia scholarship, Surah At-Tin’s sixth verse is often framed as a dynamic call to harmonize spiritual conviction with ethical action. Ayatollah Nasir Makarim Shirazi, in his exegesis, highlights the verse’s emphasis on *iman* (faith) and *amal salih* (righteous deeds) as inseparable forces that counter humanity’s potential for moral decline. This duality resonates with modern psychological studies on “post-traumatic growth,” where adversity becomes a catalyst for resilience and purpose—mirroring the Quranic promise of an “uninterrupted reward” for those who persist in goodness despite life’s trials.  \n\nScholars like Dr. Mohammad Shomali, director of the Islamic Centre of England, connect the verse to contemporary social justice struggles. He argues that the “uninterrupted reward” isn’t merely otherworldly but manifests in the enduring impact of ethical labor—such as climate activism or poverty alleviation—which creates ripples across generations. Neuroscientific research on altruism, showing how compassionate acts activate brain regions linked to fulfillment, offers a tangible parallel to the Quranic link between deeds and spiritual reward.  \n\nThe verse’s interfaith relevance is underscored by parallels in Sikhism’s *seva* (selfless service) and Jewish *tikkun olam* (repairing the world), illustrating a shared ethos of faith-driven action. In multicultural societies, this principle challenges individualism, urging collective responsibility amid crises like displacement or AI ethics. Philosophically, it counters nihilism by affirming that meaningful existence arises from sustained moral commitment—a counter-narrative to modern existential anxiety.  \n\nUltimately, this verse bridges the transcendent and the temporal, urging believers to see their work for justice, sustainability, and compassion as part of an eternal continuum—a vision as urgent today as it was timeless.",
    "layer4": "In the luminous verse of Surah At-Tin, Allah promises an \"uninterrupted reward\" exclusively to those who unite true faith with righteous deeds. The Ahlul Bayt (peace be upon them) unveil the profound spiritual dimensions of this exception, teaching that mere outward actions are insufficient without the light of *Wilayah* (divine guardianship) animating them. Imam Ja'far al-Sadiq (peace be upon him) states: **\"Faith is a confession with the tongue, affirmation in the heart, and action with the limbs.\"** Here, belief is inseparable from recognizing the Imamah – the divine leadership of the purified Household – as the axis of true submission.\n\nThe \"uninterrupted reward\" transcends worldly recompense; it is the eternal flow of divine grace granted to those whose deeds are rooted in love for the Ahlul Bayt. Imam Ali (peace be upon him) teaches in Nahj al-Balagha: **\"Actions are lifeless forms, but the spirit within them is the sincere intention.\"** This sincerity is perfected by aligning one’s heart and deeds with the guidance of the Imams, who are the embodiments of Quranic wisdom. Lady Fatimah (peace be upon her) emphasizes in her famed sermon: **\"The one who establishes obedience to Allah truly journeys toward Him with the light of His proof.\"** \n\nPractically, this verse calls believers to anchor their worship in the recognition of Imamah. Imam Muhammad al-Baqir (peace be upon him) explains that \"righteous deeds\" include adherence to the Imams’ teachings, for they are the \"straight path\" (Sirat al-Mustaqim) mentioned in the Quran. Spiritual development thus demands nurturing *ma'rifah* (divine recognition) of the Ahlul Bayt, allowing their purified souls to illuminate our actions. Only then do deeds transcend the temporal and become vessels for the \"uninterrupted reward\" – an unceasing communion with the Divine Presence, flowing through the channel of Wilayah.",
    "layer1_urdu": "سورہ اٹ ٹن آیت 6 روحانی زوال کی طرف انسانیت کے عمومی رجحان کے لئے گہری استثناء پیش کرتی ہے ، اور اس بات کی تصدیق کرتے ہیں کہ جو لوگ*ایمان*(ایمان) اور*امال کے ساتھ مل کر صلیہ*(نیک اعمال) کو یکجا کرتے ہیں انہیں لازوال انعام ملے گا (*اجرون غائیر میمن*)۔ آیت انسانوں کے ’نچلے حصے میں سب سے کم\" کے زوال کو بیان کرنے والی سابقہ خطوط سے متصادم ہے ، اس بات پر زور دیتے ہوئے کہ خدائی رحمت روحانی طور پر شعور کے ل this اس تقدیر سے بالاتر ہے۔ کلاسیکی شیعہ تبصرے ، جیسے *العزان *میں الامہ تبتابائی کے ذریعہ ، وضاحت کریں کہ سچ *ایمان *محض دانشورانہ قبولیت نہیں ہے بلکہ الہی رہنمائی میں ایک تبدیلی کی سزا ہے ، خاص طور پر اہل بائٹ کی تعلیمات کے ذریعے۔ *امل کے طور پر صالح*سے مراد قرآنی اخلاقیات اور پیشن گوئی کی روایت کے ساتھ منسلک اقدامات ہیں ، جو مخلص نیت (*نیہہ*) کے ذریعہ پاک ہیں اور اماموں کے روحانی فریم ورک پر عمل پیرا ہیں۔\n\nمکہ میں شدید ظلم و ستم کے دوران مکہ میں انکشاف کیا گیا ، ابتدائی مسلمانوں کو یقین دلایا گیا کہ عقیدے اور اخلاقی عمل میں ثابت قدمی - جبر کے باوجود - ابدی نعمتیں برآمد ہوں گی۔ جملہ * اجرون غائیر ممنون * (بلاتعطل انعام) دنیاوی حدود کے ذریعہ غیر منقولہ ایک الہی وعدے کی نشاندہی کرتا ہے ، جو اس کے بعد بھی ابدی روحانی ترقی میں شیعہ کے عقیدے کی عکاسی کرتا ہے۔ کلیدی اصطلاحات جیسے * ایمان * اور * صالح * متحرک ہیں: * ایمان * اللہ کو مستقل طور پر پیش کرنے اور اہل بیت کے ساتھ عقیدت کے ذریعہ تیار ہوتا ہے ، جبکہ * صالح * اعمال رسمی عبادت اور معاشرتی انصاف دونوں پر مشتمل ہیں ، جس میں انسانیت کی خدمت کے ساتھ توازن دعا پر امام علی کے زور کی بازگشت ہے۔\n\nجدید مسلمانوں کے لئے ، یہ آیت عقیدے اور عمل کی لازم و ملزومیت کی نشاندہی کرتی ہے۔ مادیت پرستی اور اخلاقی ابہام کے دور میں ، اس میں قرآنی اصولوں اور اہل بیت کی مثال میں کسی کی زندگی کو لنگر انداز کرنے کا مطالبہ کیا گیا ہے۔ یہ مومنوں کو یاد دلاتا ہے کہ راستبازی کے لئے ان کی جدوجہد ، اگرچہ غیب ، ہمیشہ کی قدر کی جاتی ہے ، اور ان پر زور دیتے ہیں کہ وہ الہی محبت اور اخلاقی سالمیت سے جڑے ہوئے برادریوں کی تعمیر کریں۔",
    "layer2_urdu": "سورہ ایٹ ٹن (95: 6) میں ، قرآنی استثناء (*Illā*) ایک گہرا مذہبی محور متعارف کراتا ہے ، جو عام انسانی انحطاط اور عقیدہ کو متحد کرنے والے مومنوں کی بلند مقام (*īmān*) کے درمیان نیک عمل (*‘امل ال الییلی*) کے درمیان فرق کرتا ہے۔ کلاسیکی شیعہ استثنیٰ اس بات پر زور دیتے ہیں کہ یہ آیت شیعہ سوٹریولوجی کا سنگ بنیاد ، نظریاتی سچائی اور اخلاقی پراکسیوں کے مابین لازم و ملزوم لنک کو شامل کرتی ہے۔ الاتبریسی میں * ماجما البیان * اس بات کی نشاندہی کرتے ہیں کہ عقیدے کی محض زبانی تصدیق ناکافی ہے۔ نجات الہی احکامات کو مجسم بنانے پر منحصر ہے جو * شریعت * کے ساتھ منسلک اعمال کے ذریعہ اے ایچ ایل البائٹ کے ذریعہ ترجمانی کی گئی ہے۔ \"بلاتعطل انعام\" (*اجر غائیر مامن*) کو ابدی ، غیر منقول الہی احسان سے تعبیر کیا جاتا ہے - عارضی دنیاوی بدلہ سے فرق - جو انسانی خوبیوں کے بجائے خدا کی لامحدود رحمت میں ہے۔\n\nآیت اللہ تبتابائی کے*المزان*نے اس تصور کو خدائی انصاف (*‘ADL*) کے ذریعہ وسعت دی ہے ، اور یہ استدلال کیا ہے کہ انعام کا دائرہ مومن کی روح اور آسمانی دائرے کے مابین آنٹولوجیکل ہم آہنگی کی عکاسی کرتا ہے۔ اس آیت کی رعایت ، وہ نوٹ کرتا ہے ، واضح طور پر پیشن گوئی اور امامک اتھارٹی کے ذریعہ خدائی رہنمائی کی ضرورت کی تصدیق کرتا ہے ، کیونکہ صرف AHL البائٹ کے * ولیہ * (سرپرستی) پر عمل پیرا ہونے والے افراد اس طرح کی روحانی اتحاد کو حاصل کرسکتے ہیں۔ یہ شیعہ کے نظریے سے ہم آہنگ ہے کہ نیک اعمال کو اماموں کی بیعت کے فریم ورک کے اندر انجام دینا چاہئے ، جو \"الہی رحمت کے گیٹ وے\" (*ابوب الرامما*) کے طور پر کام کرتے ہیں۔\n\nیہاں مذہبی باریکیاں شیعہ فقہ (*فقہ*) کے ساتھ ملتی ہیں ، جہاں*امان*نہ صرف خدا کی وحدانیت پر یقین رکھتے ہیں بلکہ اماموں کی ناقابل تسخیر قیادت (*اممہ*) کو بھی قبول کرتے ہیں۔ اس طرح ، آیت کا ابدی اجر کا وعدہ اماموں کی روحانی سرپرستی کے تحت نظریاتی وفاداری اور اخلاقی سختی دونوں پر مستقل ہے۔ یہ ایک ترکیب ہے جو مذہبی اور عمل کے مابین شیعہ کے عالمی نظریہ کے توازن کی عکاسی کرتی ہے۔ کلاسیکی مبصرین متفقہ طور پر اس بات پر زور دیتے ہیں کہ یہ آیت الہی فضل اور انسانی ذمہ داری کے مابین عہد نامے کی تصدیق کرتی ہے ، جو اے ایچ ایل البائٹ کی پائیدار وراثت کے ذریعہ ثالثی کی گئی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ اٹ ٹن کی چھٹی آیت کو اکثر اخلاقی عمل کے ساتھ روحانی یقین کو ہم آہنگ کرنے کے لئے متحرک کال کے طور پر تیار کیا جاتا ہے۔ آیت اللہ ناصر مکارم شرازی نے اپنے استقامت میں ، * ایمان * (ایمان) اور * امل سالہ * (نیک اعمال) پر اس آیت پر زور کو اجاگر کیا ہے جو اخلاقی زوال کے لئے انسانیت کی صلاحیتوں کا مقابلہ کرتی ہے۔ یہ دوہری \"بعد میں تکلیف دہ نمو\" کے بارے میں جدید نفسیاتی مطالعات سے گونجتی ہے ، جہاں مشکلات لچک اور مقصد کے لئے ایک اتپریرک بن جاتی ہیں۔ زندگی کی آزمائشوں کے باوجود بھلائی پر قائم رہنے والوں کے لئے \"بلاتعطل انعام\" کے قرآنی وعدے کو کم کرنا۔  \n\nانگلینڈ کے اسلامک سنٹر کے ڈائریکٹر ڈاکٹر محمد شومالی جیسے اسکالرز ، آیت کو عصری معاشرتی انصاف کی جدوجہد سے مربوط کرتے ہیں۔ ان کا استدلال ہے کہ \"بلاتعطل انعام\" محض دیگر دنیاوی نہیں ہے بلکہ اخلاقی مزدوری کے پائیدار اثرات میں ظاہر ہوتا ہے - جیسے آب و ہوا کی سرگرمی یا غربت کے خاتمے - جو نسلوں میں لہروں کو پیدا کرتی ہے۔ اعصابی پرستی کے بارے میں اعصابی تحقیق ، جس سے یہ ظاہر ہوتا ہے کہ کس طرح ہمدردانہ حرکتیں دماغی خطوں کو تکمیل سے منسلک کرتی ہیں ، جو اعمال اور روحانی اجر کے مابین قرآنی روابط کے متوازی متوازی پیش کرتی ہے۔  \n\nآیت کی بین المذاہب مطابقت کو سکھ مذہب کے * سیوا * (بے لوث خدمت) اور یہودی * ٹککن اولم * (دنیا کی مرمت) کے متوازی طور پر واضح کیا گیا ہے ، جس میں عقیدے سے چلنے والی کارروائی کے مشترکہ اخلاق کی وضاحت کی گئی ہے۔ کثیر الثقافتی معاشروں میں ، یہ اصول انفرادیت کو چیلنج کرتا ہے ، اور بے گھر ہونے یا اے آئی اخلاقیات جیسے بحرانوں کے درمیان اجتماعی ذمہ داری پر زور دیتا ہے۔ فلسفیانہ طور پر ، یہ اس بات کی تصدیق کرتے ہوئے اس کا مقابلہ کرتا ہے کہ بامقصد وجود مستقل اخلاقی عزم سے پیدا ہوتا ہے۔  \n\nآخر کار ، یہ آیت ماورن اور دنیاوی کو پل کرتی ہے ، اور مومنوں پر زور دیتی ہے کہ وہ انصاف ، استحکام اور ہمدردی کے لئے اپنے کام کو ابدی تسلسل کے حصے کے طور پر دیکھیں۔",
    "layer4_urdu": "سورہ اٹ ٹن کی برائٹ آیت میں ، اللہ ان لوگوں کے لئے \"بلا تعطل انعام\" کا وعدہ کرتا ہے جو صداقت کے اعمال کے ساتھ حقیقی عقیدے کو متحد کرتے ہیں۔ اہل بیت (ان پر امن ہے) اس استثنا کے گہرے روحانی جہتوں کی نقاب کشائی کرتے ہیں ، اور یہ تعلیم دیتے ہیں کہ محض ظاہری اقدامات ان کو متحرک کرنے والے * ولیہ * (الہی سرپرستی) کی روشنی کے بغیر ناکافی ہیں۔ امام جافر السادق (ان پر امن ہے) بیان کرتا ہے: ** ایمان زبان کے ساتھ اعتراف ہے ، دل میں تصدیق اور اعضاء کے ساتھ کارروائی ہے۔ \"\n\n\"بلاتعطل انعام\" دنیاوی بدلہ سے ماورا ہے۔ یہ خدائی فضل کا ابدی بہاؤ ہے جو ان لوگوں کو عطا کیا جاتا ہے جن کے اعمال اہل بائٹ سے محبت کرتے ہیں۔ امام علی (اس پر امن) ناہج البالاگھا میں پڑھاتے ہیں: ** \"اعمال بے جان شکل ہیں ، لیکن ان کے اندر کی روح مخلصانہ ارادہ ہے۔\" لیڈی فاطمہ (اس پر امن) اپنے مشہور خطبہ میں زور دیتے ہیں: ** \"وہ جو اللہ کی اطاعت قائم کرتا ہے وہ واقعتا his اس کے ثبوت کی روشنی سے اس کی طرف سفر کرتا ہے۔\" ** \n\nعملی طور پر ، یہ آیت مومنوں کو امامہ کی پہچان میں اپنی عبادت کو لنگر انداز کرنے کا مطالبہ کرتی ہے۔ امام محمد البقیر (ان پر امن ہے) وضاحت کرتا ہے کہ \"راستباز اعمال\" میں اماموں کی تعلیمات پر عمل پیرا ہونا شامل ہے ، کیونکہ وہ قرآن مجید میں مذکور \"سیدھے راستے\" (سیرت الماستاقیم) ہیں۔ روحانی نشوونما اس طرح اہل بیت کے * ماورفاہ * (خدائی پہچان) کی پرورش کا مطالبہ کرتی ہے ، جس سے ان کی پاکیزگی روحوں کو ہمارے اعمال کو روشن کرنے کا موقع ملتا ہے۔ تب ہی اعمال عارضی طور پر عبور کرتے ہیں اور \"بلاتعطل انعام\" کے لئے برتن بن جاتے ہیں۔",
    "layer5": "In interpreting Surah At-Tin 6, both Shia and Sunni scholars converge on the foundational principle that sincere belief (īmān) and righteous deeds (aʿmāl ṣāliḥāt) are prerequisites for attaining divine reward. Al-Tabari (Sunni) and Al-Tusi (Shia) both emphasize that the verse’s exception clause (“except those who believe…”) underscores divine mercy while maintaining human accountability, with Al-Tabari noting in *Jami al-Bayan* that this reward reflects Allah’s justice for obedient servants, and Al-Tusi in *Al-Tibyan* framing it as a rejection of predestinarian fatalism. Similarly, Ibn Kathir (Sunni) and Al-Tabrisi (Shia) in *Majma al-Bayan* agree that “uninterrupted reward” (ajr ghayr mamnun) denotes eternal blessings free from diminishment, rooted in Allah’s limitless grace.\n\nDivergences emerge in defining the scope of “righteous deeds.” Shia commentaries like Al-Qummi’s *Tafsir* and Tabatabai’s *Al-Mizan* contextualize righteous action within loyalty to the Ahl al-Bayt, interpreting adherence to Imamate as integral to faith. Conversely, Sunni exegetes such as Al-Qurtubi in *Al-Jami li-Ahkam* prioritize deeds aligned with Quranic norms and Prophetic Sunnah, without explicit linkage to leadership disputes. Al-Razi’s *Mafatih al-Ghayb* philosophically explores “uninterrupted” as a negation of worldly reciprocity, whereas Shia scholars like Al-Tabrisi tie it to the intercessory role of the Imams in sustaining spiritual merit.\n\nThese differences stem from historical theological developments: Sunni interpretations often reflect early community-centric (jamāʿī) ethics, while Shia readings integrate Imamology post-Ṣiffīn. Practically, Shia piety may emphasize devotional practices tied to the Ahl al-Bayt, whereas Sunni traditions focus on communal adherence to Sunnah. Both traditions, however, uphold the verse’s core message: eternal reward remains contingent on ethical monotheism enacted through divinely guided practice.",
    "layer5_urdu": "سورہ ایٹ ٹن 6 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی اسکالرز دونوں اس بنیادی اصول پر اکٹھے ہوجاتے ہیں کہ مخلص عقیدہ (امان) اور نیک اعمال (عمل الییلی ḥāt) الہی انعام کے حصول کے لئے شرائط ہیں۔ التباری (سنی) اور التوسی (شیعہ) دونوں اس بات پر زور دیتے ہیں کہ آیت کی استثنیٰ شق (\"سوائے ان کے سوا…\") انسانی احتساب کو برقرار رکھتے ہوئے الہی رحمت کی نشاندہی کرتی ہے ، * جمی البیان * میں العثاری کے ساتھ یہ اجر التوانی * التبیہ کے انصاف کی عکاسی کرتا ہے۔ اسی طرح ، ابن کتھیر (سنی) اور الاتبریسی (شیعہ) * ماجما البیان * میں اس بات پر متفق ہیں کہ \"بلاتعطل انعام\" (اجر غائیر ممنون) اللہ کے لامحدود فضل میں مبتلا ہونے سے آزاد ابدی نعمتوں کی نشاندہی کرتا ہے۔\n\n\"نیک اعمال\" کے دائرہ کار کی وضاحت میں تفریق پیدا ہوتی ہے۔ شیعہ تبصرے جیسے القومی کے * طافسیر * اور تبتابائی کے * المزان * اے ایچ ایل ال بیت کے ساتھ وفاداری کے اندر راستباز عمل کو سیاق و سباق سے دوچار کرتے ہیں ، اور عقیدے کے ساتھ لازمی طور پر انضمام کی پابندی کی ترجمانی کرتے ہیں۔ اس کے برعکس ، * الجامی لی احکم * میں القوروبی جیسے سنی استثنیٰ * قیادت کے تنازعات سے واضح روابط کے بغیر قرآنی کے اصولوں اور پیشن گوئی کے ساتھ منسلک اعمال کو ترجیح دیتے ہیں۔ العمزی کے * مافاتیہ الغیب * فلسفیانہ طور پر دنیاوی اجرت کی نفی کے طور پر \"بلاتعطل\" کی کھوج کرتے ہیں ، جبکہ العبیریسی جیسے شیعہ اسکالرز روحانی خوبیوں کو برقرار رکھنے میں اماموں کے شفاعت کے کردار سے باندھتے ہیں۔\n\nیہ اختلافات تاریخی مذہبی پیشرفتوں سے پیدا ہوتے ہیں: سنی تشریحات اکثر ابتدائی کمیونٹی مرکوز (جام āʿ ī) اخلاقیات کی عکاسی کرتی ہیں ، جبکہ شیعہ ریڈنگز امامولوجی کے بعد انضمام کرتی ہیں۔ عملی طور پر ، شیعہ تقویٰ اے ایچ ایل البیٹ سے منسلک عقیدت مند طریقوں پر زور دے سکتا ہے ، جبکہ سنی روایات سنت کی فرقہ واریت پر توجہ مرکوز کرتی ہیں۔ تاہم ، دونوں روایات آیت کے بنیادی پیغام کو برقرار رکھتی ہیں: ابدی انعام اخلاقی توحید پر قائم رہتا ہے جو خدائی رہنمائی عمل کے ذریعہ نافذ کیا جاتا ہے۔",
    "layer2short": "In Surah At-Tin (95:6), the Qur’anic exception (*illā*) introduces a profound theological pivot, distinguishing between general human degradation and the elevated status of believers who unite faith (*īmān*) with righteous action (*‘amal al-ṣāliḥ*). Classical Shia exegetes emphasize that this verse encapsulates the inseparable link between doctrinal truth and ethical praxis, a cornerstone of Shia soteriology. Al-Tabrisi in *Majma al-Bayan* underscores that mere verbal affirmation of faith is insufficient; salvation hinges on embodying divine commandments through deeds aligned with the *sharia* as interpreted by the Ahl al-Bayt. The “uninterrupted reward” (*ajr ghayr mamnūn*) is interpreted as an eternal, unceasing divine favor—distinct from transient worldly recompense—rooted in God’s infinite mercy rather than human merit.",
    "layer2short_urdu": "سورہ ایٹ ٹن (95: 6) میں ، قرآنی استثناء (*Illā*) ایک گہرا مذہبی محور متعارف کراتا ہے ، جو عام انسانی انحطاط اور عقیدہ کو متحد کرنے والے مومنوں کی بلند مقام (*īmān*) کے درمیان نیک عمل (*‘امل ال الییلی*) کے درمیان فرق کرتا ہے۔ کلاسیکی شیعہ استثنیٰ اس بات پر زور دیتے ہیں کہ یہ آیت شیعہ سوٹریولوجی کا سنگ بنیاد ، نظریاتی سچائی اور اخلاقی پراکسیوں کے مابین لازم و ملزوم لنک کو شامل کرتی ہے۔ الاتبریسی میں * ماجما البیان * اس بات کی نشاندہی کرتے ہیں کہ عقیدے کی محض زبانی تصدیق ناکافی ہے۔ نجات الہی احکامات کو مجسم بنانے پر منحصر ہے جو * شریعت * کے ساتھ منسلک اعمال کے ذریعہ اے ایچ ایل البائٹ کے ذریعہ ترجمانی کی گئی ہے۔ \"بلاتعطل انعام\" (*اجر غائیر مامن*) کو ابدی ، غیر منقول الہی احسان سے تعبیر کیا جاتا ہے - عارضی دنیاوی بدلہ سے فرق - جو انسانی خوبیوں کے بجائے خدا کی لامحدود رحمت میں ہے۔"
  },
  "7": {
    "layer1": "In Surah At-Tin, verse 7, Allah challenges humanity with a piercing rhetorical question: *\"Fa-ma yukadhdhibuka ba’du bid-din\"* (\"So what yet causes you to deny the Recompense?\"). This verse concludes a powerful sequence where Allah swears by sacred symbols—the fig, olive, Mount Sinai, and Mecca—to affirm humanity’s noble creation and ultimate accountability. The *\"din\"* (Recompense) refers to the Day of Judgment, where deeds are weighed and divine justice prevails.  \n\nThe Meccan context of this verse highlights its focus on confronting the Quraysh’s rejection of resurrection and moral accountability. Despite witnessing Allah’s signs in creation, prophecy, and their own moral conscience, they clung to denial. The word *\"yukadhdhibuka\"* (to deny you) carries a dual force: it addresses both the rejection of divine truth and the rejection of the Prophet Muhammad (peace be upon him) as Allah’s messenger. The term *\"ba’du\"* (after) underscores that denial persists even after overwhelming evidence—a testament to human stubbornness or spiritual blindness.  \n\nShia tafsir, as explained by scholars like Allamah Tabatabai, emphasizes that this verse calls for introspection: How can one doubt divine justice when creation itself reflects purpose, and prophets like Ibrahim, Musa, and Muhammad (peace be upon them) have delivered clear guidance? The Ahlul Bayt, particularly Imam Ali, taught that recognizing *din* requires aligning one’s actions with the awareness that every choice echoes into eternity.  \n\nToday, this verse urges Muslims to resist materialism and moral relativism. It asks: What excuses do we make to avoid accountability—in our honesty, treatment of others, or neglect of prayer? By internalizing the reality of the *din*, believers cultivate taqwa (God-consciousness), ensuring their daily choices reflect trust in divine justice. The verse thus becomes a timeless reminder to live with purpose, humility, and ethical clarity, anchored in the certainty of the Hereafter.",
    "layer2": "In interpreting Surah al-Tin 7, classical Shia exegetes emphasize the verse’s profound challenge to human denial of divine accountability (*al-dīn*), understood here as the Day of Recompense. The rhetorical force of \"What yet causes you to deny the Recompense?\" is rooted in preceding divine oaths (vv. 1-4) affirming humanity’s creation in *aḥsan taqwīm* (the finest form) and subsequent capacity for degradation. As Tabatabai notes in *Al-Mizan*, this verse interrogates the logical contradiction in acknowledging Allah’s creative perfection while rejecting eschatological justice—a central tenet of Shia theology tied to the principle of *‘adl* (divine justice). The denial of *al-dīn* is thus framed not merely as intellectual error but as a moral failure to align with the purpose of creation.\n\nTabrisi’s *Majma al-Bayan* highlights the linguistic weight of *al-dīn*, which encompasses both judgment and religion, arguing that rejecting resurrection inherently negates the entire prophetic mission. This aligns with Shia narrations from Imam Jafar al-Sadiq, who taught that belief in the Hereafter is inseparable from recognition of *walayah* (divinely ordained authority), as the Imams are the guarantors of cosmic justice. The verse thus implicitly critiques those who, despite witnessing the signs of Allah in nature and revelation, persist in moral and theological heedlessness.\n\nTheological discussions in Shia tradition link this denial to the misuse of free will (*ikhtiyar*), which elevates or degrades the human state (vv. 4-5). Denying *al-dīn* represents a descent into *asfal al-safilīn* (the lowest of the low), as it severs the soul from its teleological purpose. Jurisprudentially, this verse underpins the ethical foundations of Shia *fiqh*, where actions are judged not only by temporal standards but by their eternal consequences—a principle reiterated in hadiths describing the Imams as \"the scales of deeds\" (*mizān al-a‘māl*). Thus, the verse serves as both a metaphysical reminder and a call to align one’s life with the reality of divine reckoning.",
    "layer3": "In Surah At-Tin’s rhetorical question – “What yet causes you to deny the Recompense?” – contemporary Shia scholars like Ayatollah Nasir Makarem Shirazi and Dr. Mohammad Ali Shomali emphasize its urgent relevance to modern materialism and ethical relativism. Building on classical exegesis that links humanity’s “best creation” (verse 4) to moral responsibility, scholars today frame the “denial” (takdhib) as a crisis of purpose in an age fixated on immediate gratification. Neuroscientist and theologian Dr. Mehdi Golshani notes how discoveries about human consciousness – our unique capacity for abstract moral reasoning – align with the Quranic concept of inherent dignity (karamah), making denial of cosmic accountability scientifically incoherent.  \n\nPhilosophically, the verse challenges secular paradigms reducing human value to biological utility. As ethicist Dr. Liyakat Takim observes, the “Recompense” (din) becomes a framework for addressing climate crises and social inequities – actions having consequences beyond transactional gains. The ecological principle of interconnected cause/effect mirrors divine justice, urging environmental stewardship as a theological duty.  \n\nInterfaith dialogues, particularly with Jewish and Christian scholars, highlight shared Abrahamic concerns about moral nihilism. In multicultural societies, the verse’s universal call resonates through secular humanist ethics advocating responsibility beyond legal systems.  \n\nModern challenges – from AI ethics to pandemic responses – become test cases for this Quranic principle: societies denying transcendent accountability often justify exploitative systems. Conversely, embracing the “Recompense” fosters intergenerational justice, as seen in Shi’i social initiatives addressing refugee crises through eternal accountability paradigms. The verse emerges not as a threat but an invitation to recognize humanity’s woven fabric of rights and duties.",
    "layer4": "In Surah At-Tin, Allah poses a piercing question: *\"So what yet causes you to deny the Recompense?\"* The Ahlul Bayt (peace be upon them) illuminate this verse as a profound call to recognize Divine Justice through the lens of **Wilayah** (divine guardianship). Imam Ali al-Ridha (as) states, *\"Whoever acknowledges the Imam of their time will never deny the Recompense, for the Imam is the living proof of Allah’s balance between mercy and justice\"* (Bihar al-Anwar). This ties the denial of the Hereafter to rejecting the Imam’s spiritual authority, which embodies the reality of accountability.\n\nLady Fatimah (as) taught that denial of the Day of Judgment stems from neglecting the *\"signs woven into creation and the hearts of the purified\"* (Hadith al-Kisa). The \"Recompense\" is not merely a distant event but the immediate spiritual consequence of turning away from the guidance of the Ahlul Bayt, who are the embodiments of Quranic truth. Imam Jafar al-Sadiq (as) explains, *\"Every soul tastes death by its deeds before it tastes physical death; the Recompense begins in this life through the heart’s alignment with the Imam\"* (Tafsir al-Qummi).\n\nPractically, this verse urges believers to root their faith in the recognition of **Imamah** as the bridge between human action and Divine Justice. Spiritual development lies in daily self-accountability (*muhasabah*) while seeking the Imam’s intercession. The Prophet (pbuh) said, *\"The one who acts without knowledge destroys more than they build, but the one who acts upon the light of the Imam’s guidance builds eternity in every step\"* (Al-Kafi). Thus, upholding justice, nurturing gratitude, and adhering to the Ahlul Bayt’s teachings become acts of affirming the Recompense — transforming ritual into reality, and doubt into certainty.",
    "layer1_urdu": "سورہ ایٹ ٹن ، آیت 7 میں ، اللہ انسانیت کو چھیدنے والے بیان بازی کے سوال کے ساتھ چیلنج کرتا ہے: * \"ایف اے-ما یوکادھدبکا باڈو بولی ڈن\" یہ آیت ایک طاقتور تسلسل کا اختتام کرتی ہے جہاں اللہ تعالی نے انسانیت کی عمدہ تخلیق اور حتمی احتساب کی تصدیق کرنے کے لئے مقدس علامتوں یعنی انجیر ، زیتون ، ماؤنٹ سینا اور مکہ کی قسم کھائی ہے۔ * \"ڈین\" * (بدلہ) سے مراد فیصلے کے دن سے مراد ہے ، جہاں اعمال کا وزن اور خدائی انصاف ہوتا ہے۔  \n\nاس آیت کے میکن سیاق و سباق میں قریش کے قیامت اور اخلاقی احتساب کو مسترد کرنے کا مقابلہ کرنے پر اپنی توجہ کو اجاگر کیا گیا ہے۔ تخلیق ، پیشن گوئی اور ان کے اپنے اخلاقی ضمیر میں اللہ کی علامتوں کا مشاہدہ کرنے کے باوجود ، وہ انکار سے چمٹے ہوئے تھے۔ لفظ * \"یوکادبھوبوکا\" * (آپ کو انکار کرنے کے لئے) ایک دوہری قوت ہے: اس میں الہی سچائی کو مسترد کرنے اور حضرت محمد صلی اللہ علیہ وآلہ وسلم کے مسترد ہونے کی نشاندہی کی گئی ہے۔ اصطلاح * \"باڈو\" * (بعد) اس بات کی نشاندہی کرتی ہے کہ انکار کرنے سے بھی بھاری ثبوت کے بعد بھی برقرار رہتا ہے۔ یہ انسانی ضد یا روحانی اندھا پن کا ثبوت ہے۔  \n\nشیعہ طافسیر ، جیسا کہ الامہ تبتابائی جیسے اسکالرز نے سمجھایا ہے ، اس بات پر زور دیتا ہے کہ اس آیت میں تعصب کا مطالبہ کیا گیا ہے: جب تخلیق خود ہی مقصد کی عکاسی کرتی ہے ، اور ابراہیم ، موسیٰ ، اور محمد (سلامتی) جیسے نبیوں نے واضح رہنمائی کی ہے۔ اہل بیت ، خاص طور پر امام علی ، نے سکھایا کہ * DIN * کو پہچاننے کے لئے کسی کے اقدامات کو اس بیداری کے ساتھ سیدھ میں کرنے کی ضرورت ہے جو ہر انتخاب ہمیشہ کے لئے گونجتا ہے۔  \n\nآج ، یہ آیت مسلمانوں کو مادیت اور اخلاقی نسبت پسندی کے خلاف مزاحمت کرنے کی تاکید کرتی ہے۔ یہ پوچھتا ہے: ہم احتساب سے بچنے کے لئے کیا بہانے بناتے ہیں - ہماری ایمانداری ، دوسروں کے ساتھ سلوک ، یا نماز سے نظرانداز؟ *DIN *کی حقیقت کو اندرونی بناتے ہوئے ، مومنین تقوا (خدا کے شعور) کی کاشت کرتے ہیں ، تاکہ ان کے روز مرہ کے انتخاب کو الہی انصاف پر اعتماد کی عکاسی کریں۔ اس طرح آیت مقصد ، عاجزی اور اخلاقی وضاحت کے ساتھ زندگی گزارنے کے لئے ایک لازوال یاد دہانی بن جاتی ہے ، جو اس کے بعد کی یقین میں لنگر انداز ہوتی ہے۔",
    "layer2_urdu": "سورہ التن 7 کی ترجمانی کرتے ہوئے ، کلاسیکی شیعہ استثنیٰ نے الہی احتساب (*الدین*) کے انسانی انکار کے لئے آیت کے گہرے چیلنج پر زور دیا ہے ، جو یہاں بدلہ لینے کے دن کے طور پر سمجھا جاتا ہے۔ \"ابھی تک آپ کو بدلہ لینے سے انکار کرنے کا سبب بننے کی وجہ سے کیا وجہ ہے؟\" اس کی جڑ سے پہلے کی الہی الہی حلف (vv. 1-4) * Aḥsan Taqwīm * (بہترین شکل) میں انسانیت کی تخلیق کی تصدیق اور اس کے نتیجے میں انحطاط کی گنجائش ہے۔ جیسا کہ تبتابائی نے *المزان *میں نوٹ کیا ہے ، یہ آیت اللہ کے تخلیقی کمال کو تسلیم کرنے میں منطقی تضاد سے پوچھ گچھ کرتی ہے جبکہ اسکیٹولوجیکل انصاف کو مسترد کرتے ہوئے *'ADL *(خدائی انصاف) کے اصول سے منسلک شیعہ الہیات کا ایک مرکزی اصول۔ اس طرح * الدون * کے انکار کو محض دانشورانہ غلطی کی حیثیت سے نہیں بلکہ اخلاقی ناکامی کے طور پر تخلیق کے مقصد کے ساتھ ہم آہنگ ہونے میں مبتلا کیا گیا ہے۔\n\nتبریسی کے *مجس البیان * *الدون *کے لسانی وزن کو اجاگر کرتے ہیں ، جو فیصلے اور مذہب دونوں پر محیط ہے ، اور یہ استدلال کرتے ہیں کہ قیامت کو مسترد کرنے سے فطری طور پر پورے پیشن گوئی کے مشن کی نفی ہوتی ہے۔ یہ امام جعفر السادق کی شیعہ بیانات سے ہم آہنگ ہے ، جنہوں نے یہ سکھایا تھا کہ اس کے بعد یہ اعتقاد * والیاہ * (خدائی طور پر طے شدہ اتھارٹی) کے اعتراف سے لازم و ملزوم ہے ، کیونکہ امام کائناتی انصاف کے ضامن ہیں۔ اس طرح آیت واضح طور پر ان لوگوں پر تنقید کرتی ہے جو فطرت اور انکشاف میں اللہ کی علامتوں کا مشاہدہ کرنے کے باوجود اخلاقی اور مذہبی غفلت پر قائم ہیں۔\n\nشیعہ روایت میں مذہبی مباحثے اس انکار کو آزاد مرضی کے غلط استعمال سے جوڑتے ہیں (*اختیار*) ، جو انسانی ریاست کو بلند کرتا ہے یا اس میں کمی کرتا ہے (vv. 4-5)۔ * الدون * سے انکار کرنا * اسفل السفلن * (نچلے حصے میں سب سے کم) میں ایک نزول کی نمائندگی کرتا ہے ، کیونکہ یہ روح کو اپنے ٹیلیولوجی مقصد سے دور کرتا ہے۔ فقہی طور پر ، اس آیت میں شیعہ*فقہ*کی اخلاقی بنیادوں کی نشاندہی کی گئی ہے ، جہاں اقدامات کو نہ صرف عارضی معیارات سے بلکہ ان کے دائمی نتائج سے بھی فیصلہ کیا جاتا ہے۔ اس طرح ، آیت ایک استعاریاتی یاد دہانی اور الہی حساب کتاب کی حقیقت کے ساتھ کسی کی زندگی کو سیدھ میں لانے کے لئے ایک کال کے طور پر کام کرتی ہے۔",
    "layer3_urdu": "سورہ ایٹ ٹن کے بیان بازی سوال میں-\"ابھی تک آپ کو بدلہ دینے سے انکار کرنے کی کیا وجہ ہے؟\" - عصر حاضر کے شیعہ اسکالرز جیسے آیت اللہ ناصر مکارم شیرازی اور ڈاکٹر محمد علی شومالی جدید مادیت اور اخلاقی رشتہ داری کے ساتھ اپنی فوری مطابقت پر زور دیتے ہیں۔ کلاسیکی استثنیٰ کی تشکیل جو انسانیت کی \"بہترین تخلیق\" (آیت 4) کو اخلاقی ذمہ داری سے جوڑتی ہے ، اسکالرز آج \"انکار\" (تکدھیب) کو فوری طور پر تسکین پر قائم عمر میں مقصد کے بحران کے طور پر تیار کرتے ہیں۔ نیورو سائنسدان اور مذہبی ماہر ڈاکٹر مہدی گولشانی نے نوٹ کیا کہ انسانی شعور کے بارے میں دریافتیں - تجریدی اخلاقی استدلال کے لئے ہماری انوکھی صلاحیت - موروثی وقار (کرمہ) کے قرآنی تصور کے ساتھ ہم آہنگ ، کائناتی احتساب کو سائنسی طور پر غیر متنازعہ بناتے ہوئے۔  \n\nفلسفیانہ طور پر ، آیت سیکولر تمثیلوں کو چیلنج کرتی ہے جو انسانی قدر کو حیاتیاتی افادیت سے کم کرتی ہے۔ جیسا کہ اخلاقیات ڈاکٹر لیاکات تکیم نے مشاہدہ کیا ہے ، \"بدلہ\" (DIN) آب و ہوا کے بحرانوں اور معاشرتی عدم مساوات سے نمٹنے کے لئے ایک فریم ورک بن جاتا ہے۔ باہم مربوط کاز/اثر کا ماحولیاتی اصول الہی انصاف کی آئینہ دار ہے ، جس سے ماحولیاتی ذمہ داری کو مذہبی ذمہ داری کے طور پر زور دیا جاتا ہے۔  \n\nبین المذاہب مکالمے ، خاص طور پر یہودی اور عیسائی اسکالرز کے ساتھ ، اخلاقی عدم استحکام کے بارے میں مشترکہ ابراہیمک خدشات کو اجاگر کرتے ہیں۔ کثیر الثقافتی معاشروں میں ، آیت کی عالمگیر کال سیکولر ہیومنسٹ اخلاقیات کے ذریعہ گونجتی ہے جو قانونی نظام سے بالاتر ذمہ داری کی حمایت کرتی ہے۔  \n\nجدید چیلنجز - اے آئی اخلاقیات سے لے کر وبائی امراض تک - اس قرآنی اصول کے لئے ٹیسٹ کے معاملات بنیں: ماورائی احتساب سے انکار کرنے والے معاشرے اکثر استحصال کے نظام کا جواز پیش کرتے ہیں۔ اس کے برعکس ، \"بدلہ لینے\" کو گلے لگانے سے بین السطور انصاف کو فروغ ملتا ہے ، جیسا کہ شیعہ سماجی اقدامات میں دیکھا جاتا ہے کہ وہ ابدی احتساب کی تمثیلوں کے ذریعے مہاجرین کے بحرانوں سے نمٹنے کے لئے۔ آیت ایک خطرہ کے طور پر نہیں بلکہ انسانیت کے بنے ہوئے حقوق اور فرائض کے بنے ہوئے تانے بانے کو تسلیم کرنے کی دعوت ہے۔",
    "layer4_urdu": "سورہ ایٹ ٹن میں ، اللہ ایک چھیدنے والا سوال کھڑا کرتا ہے:*\"تو پھر بھی آپ کو بدلہ دینے سے انکار کرنے کا سبب بنتا ہے؟\" امام علی الردھا (ع) نے کہا ہے ، * \"جو شخص اپنے وقت کے امام کو تسلیم کرتا ہے وہ کبھی بھی بدلاؤ سے انکار نہیں کرے گا ، کیونکہ امام رحمت اور انصاف کے مابین اللہ کے توازن کا زندہ ثبوت ہے\" * (بہار الانور)۔ اس سے امام کے روحانی اتھارٹی کو مسترد کرنے کے بعد اس سے انکار کا تعلق ہے ، جو احتساب کی حقیقت کو ظاہر کرتا ہے۔\n\nلیڈی فاطمہ (ع) نے یہ سکھایا کہ یومیہ فیصلے سے انکار * \"تخلیق اور صاف ستھرا\" * (حدیث الکیسہ) کے دلوں میں بنے ہوئے علامتوں کو نظرانداز کرنے سے پیدا ہوتا ہے۔ \"بدلاؤ\" محض ایک دور دراز واقعہ نہیں ہے بلکہ اہل بیت کی رہنمائی سے ہٹ جانے کا فوری روحانی نتیجہ ہے ، جو قرآنی سچائی کے مجسم ہیں۔ امام جعفر السادق (ع) کی وضاحت کرتا ہے ، * \"جسمانی موت کا ذائقہ لینے سے پہلے ہر روح کو اس کے اعمال سے موت کا ذائقہ ملتا ہے۔ اس زندگی میں اس زندگی میں امام کے ساتھ دل کی صف بندی کے ذریعے شروع ہوتا ہے\" * (طافسیر القومی)۔\n\nعملی طور پر ، یہ آیت مومنین سے گزارش کرتی ہے کہ وہ ** امامہ ** کو انسانی عمل اور خدائی انصاف کے مابین پُل کے طور پر اپنے اعتماد کو جڑ سے دوچار کرے۔ روحانی نشوونما امام کی شفاعت کے حصول کے دوران روزانہ کی خود حساب کتاب (*محسابہ*) میں ہے۔ نبی صلی اللہ علیہ وسلم نے کہا ، \"وہ جو علم کے بغیر کام کرتا ہے وہ اپنی تعمیر سے زیادہ تباہ کرتا ہے ، لیکن وہ جو امام کی رہنمائی کی روشنی پر کام کرتا ہے وہ ہر قدم میں ابدیت پیدا کرتا ہے\" * (الکافی)۔ اس طرح ، انصاف کو برقرار رکھنا ، شکرگزار کی پرورش کرنا ، اور اہل بیت کی تعلیمات پر عمل پیرا ہونا معاوضے کی تصدیق کرنے کا کام بن جاتا ہے - رسم کو حقیقت میں تبدیل کرنا ، اور شکوک و شبہات میں شک۔",
    "layer5": "In interpreting Surah At-Tin 95:7, both Shia and Sunni scholars converge on its core theological message: a rhetorical challenge to those denying divine judgment (al-dīn) after witnessing Allah's signs in human creation (vv. 4-6). Al-Tabari (Sunni) and al-Tabrisi (Shia) both emphasize the verse's logical structure - that humanity's noble creation necessitates accountability, making resurrection denial irrational. Al-Qurtubi and al-Tusi similarly highlight the term \"al-dīn\" as encompassing both judgment and complete divine system, affirming shared eschatological principles.\n\nDivergences emerge in contextual extensions. Sunni exegetes like Ibn Kathir link the verse to pre-Islamic Arab skepticism about resurrection, interpreting it as a universal warning. Al-Razi's philosophical approach stresses individual reason's capacity to deduce judgment from natural order. In contrast, Shia commentaries often connect the verse to walāya (divinely guided leadership). Al-Qummi's narration via Imam al-Sadiq interprets denial of judgment as simultaneously rejecting the Imam's authority, while al-Tabatabai's Al-Mizan frames recognition of divine justice as inseparable from acknowledging the Ahl al-Bayt's ontological role.\n\nThese differences stem from distinct hermeneutical priorities. Sunni tafsir often prioritizes textual-historical context and rationalist theology (kalam), whereas Shia works integrate Imamah into Quranic ontology. While Ibn Kathir emphasizes individual accountability before Allah, Shia sources like Majma al-Bayan present accountability as intertwined with recognizing divine guidance through appointed leaders.\n\nPractically, both traditions derive renewed emphasis on resurrection's reality, shaping rituals like prayer and ethical conduct. The Shia emphasis on walāya reinforces communal allegiance to Imams as embodiments of divine justice. Historically, these interpretive trajectories reflect early theological debates about authority and salvation - with Sunni thought crystallizing around prophetic tradition (hadith) and Shia exegesis around Imam-led hermeneutics - while maintaining shared Quranic foundations on eschatology.",
    "layer5_urdu": "سورہ ایٹ ٹن 95: 7 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی اسکالرز دونوں اس کے بنیادی مذہبی پیغام کو تبدیل کرتے ہیں: انسانی تخلیق میں اللہ کی علامتوں کا مشاہدہ کرنے کے بعد خدائی فیصلے (الدین) سے انکار کرنے والوں کے لئے ایک بیان بازی چیلنج (vv. 4-6)۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں آیت کے منطقی ڈھانچے پر زور دیتے ہیں-کہ انسانیت کی عظیم تخلیق کو احتساب کی ضرورت ہے ، جس سے قیامت سے انکار غیر معقول ہے۔ القوروبی اور التوسی اسی طرح \"الدون\" کی اصطلاح کو اجاگر کرتے ہیں کیونکہ مشترکہ اسکیٹولوجیکل اصولوں کی تصدیق کرتے ہوئے ، فیصلے اور مکمل الہی نظام دونوں کو شامل کرتے ہوئے۔\n\nسیاق و سباق میں ایکسٹینشنز میں تفریق پیدا ہوتی ہے۔ ابن کتھیر کی طرح سنی ایگزیکٹو اس آیت کو اسلامی عرب شکوک و شبہات سے جو قیامت کے بارے میں جوڑتے ہیں ، اور اسے ایک آفاقی انتباہ سے تعبیر کرتے ہیں۔ العمزی کا فلسفیانہ نقطہ نظر انفرادی وجہ کی قدرتی نظم سے فیصلے کو کم کرنے کی صلاحیت پر زور دیتا ہے۔ اس کے برعکس ، شیعہ تبصرے اکثر آیت کو والیہ (خدائی رہنمائی کی قیادت) سے جوڑتے ہیں۔ امام السادق کے توسط سے القومی کا بیانیہ بیک وقت امام کے اختیار کو مسترد کرتے ہوئے فیصلے کی تردید کی ترجمانی کرتا ہے ، جبکہ الاتعبطابائی کے المزان فریموں کو خدائی انصاف کو تسلیم کرنے کے قابل تسلیم کرتے ہیں اور اس کی وجہ سے اے ایچ ایل البیٹ کے آنٹولوجیکل کردار کو تسلیم کرنے سے الگ نہیں ہوتا ہے۔\n\nیہ اختلافات الگ الگ ہرمینیٹیکل ترجیحات سے پیدا ہوتے ہیں۔ سنی طافسر اکثر متنی-تاریخی سیاق و سباق اور عقلیت پسند الہیات (کالام) کو ترجیح دیتے ہیں ، جبکہ شیعہ کام امامہ کو قرآنی آنٹولوجی میں ضم کرتے ہیں۔ اگرچہ ابن کتھیر اللہ کے سامنے انفرادی احتساب پر زور دیتے ہیں ، لیکن ماجما البیان جیسے شیعہ ذرائع مقرر کردہ رہنماؤں کے ذریعہ الہی رہنمائی کو تسلیم کرنے کے ساتھ جڑے ہوئے ہیں۔\n\nعملی طور پر ، دونوں روایات نے قیامت کی حقیقت پر نئے سرے سے زور دیا ہے ، جس سے نماز اور اخلاقی طرز عمل جیسی رسومات کی تشکیل ہوتی ہے۔ والیہ پر شیعہ زور دینے سے الہی انصاف کے مجسموں کے طور پر اماموں سے فرقہ وارانہ بیعت کو تقویت ملتی ہے۔ تاریخی طور پر ، یہ تشریحی رفتار اتھارٹی اور نجات کے بارے میں ابتدائی مذہبی مباحثوں کی عکاسی کرتی ہے - سنی سوچ کے ساتھ پیشن گوئی کی روایت (حدیث) اور شیعہ کی اصلاح کے ارد گرد امام کی زیرقیادت ہرمینیٹکس کے ارد گرد کرسٹل بناتی ہے۔",
    "layer2short": "In interpreting Surah al-Tin 7, classical Shia exegetes emphasize the verse’s profound challenge to human denial of divine accountability (*al-dīn*), understood here as the Day of Recompense. The rhetorical force of \"What yet causes you to deny the Recompense?\" is rooted in preceding divine oaths (vv. 1-4) affirming humanity’s creation in *aḥsan taqwīm* (the finest form) and subsequent capacity for degradation. As Tabatabai notes in *Al-Mizan*, this verse interrogates the logical contradiction in acknowledging Allah’s creative perfection while rejecting eschatological justice—a central tenet of Shia theology tied to the principle of *‘adl* (divine justice). The denial of *al-dīn* is thus framed not merely as intellectual error but as a moral failure to align with the purpose of creation.",
    "layer2short_urdu": "سورہ التن 7 کی ترجمانی کرتے ہوئے ، کلاسیکی شیعہ استثنیٰ نے الہی احتساب (*الدین*) کے انسانی انکار کے لئے آیت کے گہرے چیلنج پر زور دیا ہے ، جو یہاں بدلہ لینے کے دن کے طور پر سمجھا جاتا ہے۔ \"ابھی تک آپ کو بدلہ لینے سے انکار کرنے کا سبب بننے کی وجہ سے کیا وجہ ہے؟\" اس کی جڑ سے پہلے کی الہی الہی حلف (vv. 1-4) * Aḥsan Taqwīm * (بہترین شکل) میں انسانیت کی تخلیق کی تصدیق اور اس کے نتیجے میں انحطاط کی گنجائش ہے۔ جیسا کہ تبتابائی نے *المزان *میں نوٹ کیا ہے ، یہ آیت اللہ کے تخلیقی کمال کو تسلیم کرنے میں منطقی تضاد سے پوچھ گچھ کرتی ہے جبکہ اسکیٹولوجیکل انصاف کو مسترد کرتے ہوئے *'ADL *(خدائی انصاف) کے اصول سے منسلک شیعہ الہیات کا ایک مرکزی اصول۔ اس طرح * الدون * کے انکار کو محض دانشورانہ غلطی کی حیثیت سے نہیں بلکہ اخلاقی ناکامی کے طور پر تخلیق کے مقصد کے ساتھ ہم آہنگ ہونے میں مبتلا کیا گیا ہے۔"
  },
  "8": {
    "layer1": "Surah At-Tin, revealed in Mecca, addresses humanity’s spiritual potential and moral accountability. Verse 8, *\"A-laysa Allahu bi-ahkama al-hakimin\"* (\"Is not Allah the most just of judges?\"), concludes the surah by affirming divine justice as an undeniable truth. The rhetorical question challenges listeners to recognize Allah’s absolute fairness, contrasting human fallibility with His perfect judgment. Classical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains this verse as a reminder that Allah’s justice transcends human limitations, resolving all moral and existential imbalances on the Day of Judgment.  \n\nThe term *ahkam al-hakimin* (most just of judges) combines *hakim* (wise judge) and *hukm* (judgment), emphasizing Allah’s wisdom and authority. Shia theology links divine justice (*Adl*) to the cosmic balance maintained through His messengers and the Ahlul Bayt, who embody and execute His wisdom. Historical narrations note that this surah reassured early Muslims facing persecution in Mecca, reinforcing trust in ultimate accountability. Imam Ali, in sermons, often highlighted divine justice as a foundation for societal equity, urging followers to align their actions with this principle.  \n\nToday, this verse invites Muslims to internalize justice as both a spiritual and practical commitment. In a world marked by inequality and moral confusion, it calls believers to trust Allah’s wisdom during trials, seek His guidance in decisions, and actively uphold fairness in personal and social realms. For Shia communities, it also underscores the role of the Imams as manifestations of divine justice, guiding humanity toward ethical clarity. By embracing *ahkam al-hakimin* as a lived ideal, Muslims can navigate modern challenges with integrity, ensuring their actions reflect the certainty that no injustice—whether personal or systemic—escapes Allah’s perfect reckoning.",
    "layer2": "In Surah At-Tin (95:8), the rhetorical question *\"Is not Allah the most just of judges?\"* serves as a profound affirmation of divine justice (*‘adl*), a cornerstone of Shia theology. Classical Shia commentators emphasize this verse’s eschatological dimension, situating it within the Quran’s broader discourse on resurrection and accountability. Allamah Tabatabai in *Al-Mizan* interprets the verse as a conclusive rebuttal to human skepticism about divine judgment, asserting that Allah’s adjudication transcends all earthly notions of fairness. The verse’s interrogative form (*istifham inkari*), as noted by Tabrisi in *Majma al-Bayan*, is not a genuine inquiry but a rhetorical device to underscore the absolute certainty of Allah’s justice, leaving no room for doubt.\n\nShia exegesis links this verse to the theological principle of *al-‘adl al-ilahi* (divine justice), one of the five Usul al-Din. Unlike deterministic theological schools, Shia thought posits that human accountability presupposes divine equity: Allah judges based on innate human capacity (*fitrah*) and the guidance provided through prophets and Imams. Tabatabai argues that the \"best of creation\" (referenced in the preceding verses) alludes to the Prophet and the Ahl al-Bayt, whose perfected existence exemplifies divine wisdom and justice. This connects to the Shia doctrine of Imamate, wherein the Imams, as inheritors of prophetic knowledge, embody and administer divine justice in both spiritual and temporal realms.\n\nJurisprudentially, the verse underpins the Shia view that Islamic law (*sharia*) must reflect Allah’s justice, necessitating continuous guidance through the Imams’ interpretive authority. Classical scholars like Shaykh al-Tusi contextualize this within the Mahdi’s occultation, affirming that ultimate justice will be manifested in the eschatological era under the Imam’s rule. Thus, the verse transcends mere theological assertion, shaping Shia conceptions of moral responsibility, theodicy, and the necessity of divinely appointed leadership.",
    "layer3": "In contemporary Shia scholarship, Surah At-Tin’s rhetorical question—“Is not Allah the most just of judges?”—resonates as a profound affirmation of divine justice amid modern complexities. Ayatollah Nasir Makarem Shirazi, in his exegesis, emphasizes that this verse challenges humanity to recognize divine *‘adl* (justice) as both a cosmic principle and a moral imperative. Scholars like Dr. Mohammad Ali Shomali link this to modern governance, arguing that systemic inequalities—from economic disparity to climate injustice—contradict the Quranic vision of balance (*mizan*), urging societies to align policies with ethical accountability.\n\nScientifically, the verse’s emphasis on Allah’s justice finds echoes in the natural world’s equilibrium. Physicist and theologian Dr. Mehdi Golshani notes how physical laws reflect a “cosmic justice,” where cause and effect maintain universal order—a metaphor for divine judgment. This intersects with environmental ethics: ecological destruction, as a violation of natural balance, becomes a theological concern, aligning with Shia teachings on stewardship (*khalifa*).\n\nSocially, the verse speaks to global crises—migration, oppression, and AI-driven inequities—reminding believers that divine justice transcends human failings. Ayatollah Fadhel al-Milani connects this to interfaith solidarity, noting that shared Abrahamic values of justice (e.g., *tzedek* in Judaism, *iustitia* in Christianity) offer common ground for activism. Philosophically, it addresses existential doubts about suffering: as contemporary scholar Dr. Liyakat Takim explains, the verse reassures that ultimate justice is eschatological, resolving temporal injustices in the hereafter.\n\nIn a polarized world, this verse becomes a call to embody divine justice through empathy, equity, and ecological care—a timeless ideal made urgent by modern challenges.",
    "layer4": "The verse \"Is not Allah the most just of judges?\" (95:8) resounds as a profound affirmation of divine justice, a cornerstone of Shia theology. Imam Ali (peace be upon him) teaches in Nahj al-Balagha: \"Allah’s justice permeates all existence; His scales never tilt, nor does His wisdom err.\" This verse, revealed in Makkah, challenges humanity to recognize that ultimate justice belongs solely to Allah, Who will manifest it fully on the Day of Resurrection. The Ahlul Bayt (peace be upon them) illuminate that true justice is inseparable from divine guidance through Wilayah (guardianship). \n\nImam Jafar al-Sadiq (peace be upon him) states: \"The justice of Allah is His proof upon creation, and His proof is His justice among people.\" This intertwines with the concept of Imamah – the belief that the Imams, as inheritors of prophetic wisdom, embody and enact divine justice in the world. Lady Fatimah (peace be upon her) emphasized this in her famed sermon: \"Allah made justice the means to harmony among hearts and clarity for the soul.\" \n\nPractically, this verse calls believers to cultivate trust in Allah’s perfect justice amidst life’s trials. Imam Zain al-Abideen (peace be upon him) advises in Sahifa Sajjadiyya: \"When faced with injustice, turn your heart to the Judge of Judges – He who rights every wrong in His perfect time.\" Spiritual development requires aligning one’s actions with the scales of divine justice by adhering to the teachings of the Ahlul Bayt, whose lives exemplified equitable conduct. To internalize this truth is to find peace in submission, knowing that every soul will receive its exact due – a promise fulfilled through the intercession of the Ma’sumin (infallibles) on Judgment Day.",
    "layer1_urdu": "مکہ میں انکشاف کردہ سورہ ایٹ ٹن انسانیت کی روحانی صلاحیت اور اخلاقی احتساب کی نشاندہی کرتی ہے۔ آیت 8 ، * \"اے-لیزا اللہ تعالی الہکاما الحکیمین\" بیان بازی کا سوال سامعین کو چیلنج کرتا ہے کہ وہ اللہ کی مطلق انصاف پسندی کو تسلیم کرے ، اور اس کے کامل فیصلے کے ساتھ انسانی زوال کا مقابلہ کیا جائے۔ کلاسیکی شیعہ طافس ، جیسے الامہ تبتابائی کے *المزان *، اس آیت کو ایک یاد دہانی کے طور پر بیان کرتی ہے کہ اللہ کا انصاف انسانی حدود سے تجاوز کرتا ہے ، اور فیصلے کے دن تمام اخلاقی اور وجودی عدم توازن کو حل کرتا ہے۔  \n\nاصطلاح * احکم الحکیمین * (زیادہ تر صرف ججوں) میں * حکیم * (عقلمند جج) اور * ہکم * (فیصلہ) کو یکجا کیا گیا ہے ، جس میں اللہ کی دانشمندی اور اختیارات پر زور دیا گیا ہے۔ شیعہ الہیات الہی انصاف (*ADL*) کو اپنے میسینجرز اور اہل بیت کے ذریعہ برقرار رکھے ہوئے کائناتی توازن سے جوڑتا ہے ، جو اس کی حکمت کو مجسم اور انجام دیتے ہیں۔ تاریخی بیانات نوٹ کرتے ہیں کہ اس سورہ نے مکہ میں ظلم و ستم کا سامنا کرنے والے ابتدائی مسلمانوں کو یقین دلایا ، اور حتمی احتساب پر اعتماد کو تقویت بخشی۔ امام علی ، خطبات میں ، اکثر الہی انصاف کو معاشرتی مساوات کی بنیاد کے طور پر اجاگر کرتے تھے ، اور پیروکاروں پر زور دیتے ہیں کہ وہ اپنے اعمال کو اس اصول کے ساتھ ہم آہنگ کریں۔  \n\nآج ، یہ آیت مسلمانوں کو روحانی اور عملی عزم دونوں کے طور پر انصاف کو اندرونی بنانے کی دعوت دیتی ہے۔ عدم مساوات اور اخلاقی الجھن کی نشاندہی کرنے والی دنیا میں ، یہ مومنوں کو آزمائشوں کے دوران اللہ کی دانشمندی پر بھروسہ کرنے ، فیصلوں میں اس کی رہنمائی حاصل کرنے اور ذاتی اور معاشرتی دائروں میں انصاف پسندی کو فعال طور پر برقرار رکھنے کا مطالبہ کرتا ہے۔ شیعہ برادریوں کے لئے ، یہ انسانیت کو اخلاقی وضاحت کی طرف رہنمائی کرتے ہوئے الہی انصاف کے اظہار کے طور پر اماموں کے کردار کی بھی نشاندہی کرتا ہے۔ ایک زندہ مثالی کے طور پر * احکم الحکیمین * کو گلے لگا کر ، مسلمان جدید چیلنجوں کو سالمیت کے ساتھ تشریف لے جاسکتے ہیں ، اور ان کے اقدامات کو یقینی بناتے ہوئے اس بات کی یقین دہانی کر سکتے ہیں کہ کوئی ناانصافی-چاہے ذاتی یا نظامی-اللہ کے کامل حساب کتاب کو یقینی بناتا ہے۔",
    "layer2_urdu": "سورہ ایٹ ٹن (95: 8) میں ، بیان بازی کا سوال*\"کیا اللہ سب سب سے زیادہ ججوں کا نہیں ہے؟\"*شیعہ الہیات کا ایک سنگ بنیاد ، الہی انصاف (*‘ایڈل*) کی گہری تصدیق کے طور پر کام کرتا ہے۔ کلاسیکی شیعہ مبصرین اس آیت کی اسکیوٹولوجیکل طول و عرض پر زور دیتے ہیں ، اور اسے قیامت اور احتساب سے متعلق قرآن کی وسیع تر گفتگو میں رکھتے ہیں۔ الامہ تبتابائی * المزان * میں الہی فیصلے کے بارے میں انسانی شکوک و شبہات کے بارے میں ایک حتمی تردید کے طور پر اس آیت کی ترجمانی کرتے ہیں ، اور یہ کہتے ہوئے کہ اللہ کا فیصلہ انصاف کے تمام زمینی خیالات کو عبور کرتا ہے۔ آیت کی تفتیشی شکل (*istifham inkari*) ، جیسا کہ*ماجما البیان*میں تبریسی نے نوٹ کیا ہے ، اللہ کے انصاف کی مطلق یقین کو واضح کرنے کے لئے حقیقی انکوائری نہیں بلکہ ایک بیان بازی کا آلہ ہے ، جس میں شک کی کوئی گنجائش باقی نہیں ہے۔\n\nشیعہ استثنیٰ اس آیت کو * الا الدال اللاہی * (الہی جسٹس) کے مذہبی اصول سے جوڑتا ہے ، جو پانچ اسسل الدین میں سے ایک ہے۔ عین مطابق مذہبی اسکولوں کے برعکس ، شیعہ نے سوچا کہ انسانی احتساب الہی مساوات کو فروغ دیتا ہے: اللہ ججز فطری انسانی صلاحیت (*فیدرہ*) پر مبنی اور نبیوں اور اماموں کے ذریعہ فراہم کردہ رہنمائی پر مبنی ہیں۔ تبتابائی کا مؤقف ہے کہ \"بہترین تخلیق\" (سابقہ آیات میں حوالہ دیا گیا ہے) نبی اور اے ایچ ایل البائٹ کی طرف اشارہ کرتا ہے ، جس کا مکمل وجود خدائی حکمت اور انصاف کی مثال دیتا ہے۔ یہ امامیٹ کے شیعہ نظریے سے جڑتا ہے ، جس میں اماموں کو پیشن گوئی کے علم کے وارث ہونے کے ناطے ، روحانی اور دنیاوی دونوں دائروں میں الہی انصاف کا مجسمہ اور ان کا انتظام کیا جاتا ہے۔\n\nفقہی طور پر ، آیت شیعہ کے نظریہ کو واضح کرتی ہے کہ اسلامی قانون (*شریعت*) کو اللہ کے انصاف کی عکاسی کرنی چاہئے ، جس سے اماموں کی ترجمانی اتھارٹی کے ذریعہ مستقل رہنمائی کی ضرورت ہے۔ شیخ التوسی جیسے کلاسیکی اسکالرز اس کو مہدی کے جادو کے اندر سیاق و سباق دیتے ہیں ، اور اس بات کی تصدیق کرتے ہیں کہ حتمی انصاف امام کی حکمرانی کے تحت اسکیٹولوجیکل دور میں ظاہر ہوگا۔ اس طرح ، آیت محض مذہبی دعوے سے ماورا ہے ، جو اخلاقی ذمہ داری ، تھیوڈسی ، اور الہی مقرر کردہ قیادت کی ضرورت کے شیعہ تصورات کی تشکیل کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ اٹ ٹن کے بیاناتی سوال-\"کیا اللہ سب سب سے زیادہ ججوں کا نہیں ہے؟\"-جدید پیچیدگیوں کے درمیان الہی انصاف کی گہری تصدیق کے طور پر گونجتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے استقامت میں اس بات پر زور دیا ہے کہ یہ آیت انسانیت کو چیلنج کرتی ہے کہ وہ الہی * ‘ایڈل * (انصاف) کو کائناتی اصول اور اخلاقی لازمی دونوں کے طور پر تسلیم کرے۔ ڈاکٹر محمد علی شومالی جیسے اسکالرز اس کو جدید حکمرانی سے جوڑتے ہیں ، اور یہ استدلال کرتے ہیں کہ معاشی عدم مساوات - معاشی تفاوت سے آب و ہوا کی ناانصافی تک - متوازن توازن (*میزان*) کے قرآنی وژن کا مقابلہ کرتے ہیں ، اور معاشروں پر زور دیتے ہیں کہ وہ اخلاقی احتساب کے ساتھ پالیسیوں کو ہم آہنگ کریں۔\n\nسائنسی لحاظ سے ، اللہ کے انصاف پر آیت کا زور قدرتی دنیا کے توازن میں بازگشت پاتا ہے۔ طبیعیات دان اور مذہبی ماہر ڈاکٹر مہدی گولشانی نوٹ کرتے ہیں کہ کس طرح جسمانی قوانین \"کائناتی انصاف\" کی عکاسی کرتے ہیں ، جہاں وجہ اور اثر آفاقی حکم کو برقرار رکھتے ہیں۔ یہ خدائی فیصلے کا ایک استعارہ ہے۔ یہ ماحولیاتی اخلاقیات کے ساتھ مل جاتا ہے: ماحولیاتی تباہی ، قدرتی توازن کی خلاف ورزی کے طور پر ، ایک مذہبی تشویش بن جاتی ہے ، جو شیعہ کی تعلیمات کے ساتھ اسٹیورشپ (*خلیفہ*) کے مطابق ہوتی ہے۔\n\nمعاشرتی طور پر ، آیت عالمی بحرانوں یعنی ہجرت ، ظلم اور اے آئی سے چلنے والی عدم مساوات کی بات کرتی ہے۔ آیت اللہ فڈھیل الملانی اس کو بین الاقوامی سطح پر یکجہتی سے مربوط کرتے ہیں ، اور یہ کہتے ہوئے کہ انصاف کی مشترکہ ابراہیمک اقدار (جیسے یہودیت میں * زیڈیک * ، * عیسائیت میں * آئسٹیٹیا *) سرگرمی کے لئے مشترکہ بنیاد پیش کرتے ہیں۔ فلسفیانہ طور پر ، اس میں مصائب کے بارے میں وجودی شکوک و شبہات کا ازالہ کیا گیا ہے: جیسا کہ ہم عصر اسکالر ڈاکٹر لیاکات تکیم نے وضاحت کی ہے ، آیت کو یقین دلایا گیا ہے کہ حتمی انصاف اسکاٹولوجیکل ہے ، جس نے اس کے بعد عارضی ناانصافیوں کو حل کیا ہے۔\n\nایک پولرائزڈ دنیا میں ، یہ آیت ہمدردی ، ایکویٹی اور ماحولیاتی نگہداشت کے ذریعہ الہی انصاف کو مجسم بنانے کا مطالبہ بن جاتی ہے۔ یہ جدید چیلنجوں کے ذریعہ ایک لازوال مثالی ہے۔",
    "layer4_urdu": "آیت \"کیا اللہ سب سے زیادہ ججوں کی نہیں ہے؟\" (95: 8) شیعہ الہیات کا سنگ بنیاد ، خدائی انصاف کی گہری تصدیق کے طور پر گونجتا ہے۔ امام علی (اس پر امن) ناہج البالاگھا میں پڑھاتے ہیں: \"اللہ کا انصاف تمام وجود میں مبتلا ہے۔ مکہ مکرمہ میں انکشاف کردہ یہ آیت انسانیت کو چیلنج کرتی ہے کہ یہ تسلیم کریں کہ حتمی انصاف مکمل طور پر اللہ سے ہے ، جو قیامت کے دن اسے مکمل طور پر ظاہر کرے گا۔ اہل بیت (ان پر امن ہے) روشن کرتا ہے کہ حقیقی انصاف ولیہ (سرپرستی) کے ذریعہ خدائی رہنمائی سے لازم و ملزوم ہے۔ \n\nامام جعفر السادق (ان پر امن ہے) بیان کرتا ہے: \"اللہ کا انصاف اس کا تخلیق پر اس کا ثبوت ہے ، اور اس کا ثبوت لوگوں میں ان کا انصاف ہے۔\" یہ امامہ کے تصور سے وابستہ ہے - یہ عقیدہ ہے کہ امام ، پیشن گوئی کی حکمت کے وارث ہونے کے ناطے ، دنیا میں خدائی انصاف کو مجسم اور نافذ کرتے ہیں۔ لیڈی فاطمہ (ان پر امن) نے اپنے مشہور خطبہ میں اس پر زور دیا: \"اللہ نے انصاف کو دلوں کے مابین ہم آہنگی اور روح کے لئے واضح کرنے کا ذریعہ بنایا۔\" \n\nعملی طور پر ، یہ آیت مومنوں کو زندگی کی آزمائشوں کے دوران اللہ کے کامل انصاف پر اعتماد پیدا کرنے کا مطالبہ کرتی ہے۔ امام زین الیبائڈین (اس پر امن) ساہفا سججدیہ میں مشورہ دیتے ہیں: \"جب ناانصافی کا سامنا کرنا پڑتا ہے تو ، ججوں کے جج کی طرف اپنا دل پھیر دیں-جو اپنے کامل وقت میں ہر غلط کو حقدار بناتا ہے۔\" روحانی نشوونما کے لئے اہل بیت کی تعلیمات پر عمل پیرا ہو کر الہی انصاف کے ترازو کے ساتھ کسی کے اعمال کی صف بندی کی ضرورت ہے ، جس کی زندگیوں نے مساوی طرز عمل کی مثال دی ہے۔ اس سچائی کو اندرونی بنانا یہ ہے کہ وہ یہ جانتے ہوئے کہ ہر روح کو اس کی عین مطابق قیمت مل جائے گی۔",
    "layer5": "In interpreting Surah At-Tin 95:8, both Shia and Sunni exegetes converge on affirming Allah’s absolute justice as the foundation of divine judgment. Al-Tabari (Sunni) and Al-Tabrisi (Shia) alike emphasize that the rhetorical question \"Is not Allah the most just of judges?\" underscores Allah’s transcendence above injustice, with Al-Tabari noting this as a rebuke to human moral failings and Al-Tabrisi linking it to the Quran’s broader thematic emphasis on divine equity. Ibn Kathir (Sunni) and Al-Tusi (Shia) similarly contextualize the verse within eschatology, agreeing that it reaffirms Allah’s flawless adjudication on Judgment Day.  \n\nDivergent interpretations emerge in theological implications. Shia commentaries like Al-Mizan by Tabatabai connect divine justice to the ontological necessity of prophetic and Imamic guidance, framing the verse as implicit validation of the Ahl al-Bayt’s role in upholding moral order. Al-Qummi’s tafsir extends this to theodicy, arguing that Allah’s justice necessitates the existence of infallible guides to preserve human accountability. Sunni scholars like Al-Razi and Al-Qurtubi, while acknowledging human responsibility, focus on Allah’s unrestricted sovereignty (qadar), with Al-Qurtubi cautioning against limiting divine justice through anthropocentric assumptions.  \n\nHistorically, these differences reflect distinct theological frameworks: Shia thought prioritizes divine justice (‘adl) as a core theological principle linked to Imamah, while Sunni exegesis often subsumes justice under divine omnipotence, reflecting early debates between Ash‘ari and Mu‘tazili schools. Practically, Shia interpretations may reinforce devotion to the Imams as embodiments of justice, whereas Sunni readings emphasize individual accountability before an inscrutable divine will. Both traditions, however, unite in viewing the verse as a call to moral rectitude and trust in Allah’s perfect judgment, transcending sectarian divides through shared Quranic ethics.",
    "layer5_urdu": "سورہ ایٹ ٹن 95: 8 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں ہی اللہ کے مطلق انصاف کو الہی فیصلے کی بنیاد کے طور پر تصدیق کرتے ہوئے مل جاتے ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) یکساں طور پر اس بات پر زور دیتے ہیں کہ بیان بازی کا سوال \"کیا اللہ سب سب سے زیادہ ججوں میں نہیں ہے؟\" اللہ کے عبور کو ناانصافی سے بالاتر ہے ، التاباری نے اسے انسانی اخلاقی ناکامیوں کی سرزنش کے طور پر نوٹ کیا اور العثین کو الہی ایکویٹی پر قرآن مجید کے وسیع تر موضوعاتی زور سے جوڑ دیا۔ ابن کتھیر (سنی) اور التوسی (شیعہ) اسی طرح اس آیت کو اسکائٹولوجی کے اندر سیاق و سباق سے دوچار کرتے ہیں ، اس بات سے اتفاق کرتے ہیں کہ اس سے فیصلے کے دن اللہ کے بے عیب فیصلے کی تصدیق ہوتی ہے۔  \n\nمذہبی مضمرات میں مختلف تشریحات ابھرتی ہیں۔ تبتابائی کے ذریعہ ال میزان جیسی شیعہ تبصرے الہی انصاف کو پیشن گوئی اور امامک رہنمائی کی آنٹولوجیکل ضرورت سے مربوط کرتے ہیں ، اور اخلاقی نظم و ضبط کو برقرار رکھنے میں اے ایچ ایل البائٹ کے کردار کی مضمر توثیق کے طور پر اس آیت کو تیار کرتے ہیں۔ القومی کے طافس نے اس کو تھیوڈسی تک بڑھایا ، اور یہ استدلال کیا کہ اللہ کے انصاف کو انسانی احتساب کو برقرار رکھنے کے لئے ناقابل تسخیر رہنماؤں کے وجود کی ضرورت ہے۔ سنی اسکالرز جیسے الرحم اور القورووبی ، انسانی ذمہ داری کو تسلیم کرتے ہوئے ، اللہ کی غیر محدود خودمختاری (قادر) پر توجہ مرکوز کرتے ہوئے ، الکوروبی نے انتھروپوسنٹرک مفروضوں کے ذریعہ الہی انصاف کو محدود کرنے کے خلاف متنبہ کیا۔  \n\nتاریخی طور پر ، یہ اختلافات الگ الگ مذہبی فریم ورک کی عکاسی کرتے ہیں: شیعہ سوچ الہی انصاف (‘ADL) کو امامہ سے منسلک ایک بنیادی مذہبی اصول کے طور پر ترجیح دیتی ہے ، جبکہ سنی استثنیٰ اکثر انصاف کو الہی اومنیپوٹینس کے تحت پیش کرتا ہے ، جو اشعری اور موٹازیلی اسکولوں کے مابین ابتدائی بحثوں کی عکاسی کرتا ہے۔ عملی طور پر ، شیعہ تشریحات انصاف کے مجسموں کے طور پر اماموں کے لئے عقیدت کو تقویت بخش سکتی ہیں ، جبکہ سنی ریڈنگ ایک ناقابل تسخیر الہی مرضی سے پہلے انفرادی احتساب پر زور دیتی ہے۔ تاہم ، دونوں روایات آیت کو اخلاقی استحکام اور اللہ کے کامل فیصلے پر بھروسہ کرنے کی کال کے طور پر متحد ہوجاتی ہیں ، مشترکہ قرآنی اخلاقیات کے ذریعہ فرقہ وارانہ فرقہ وارانہ تقسیم ہوتا ہے۔",
    "layer2short": "In Surah At-Tin (95:8), the rhetorical question *\"Is not Allah the most just of judges?\"* serves as a profound affirmation of divine justice (*‘adl*), a cornerstone of Shia theology. Classical Shia commentators emphasize this verse’s eschatological dimension, situating it within the Quran’s broader discourse on resurrection and accountability. Allamah Tabatabai in *Al-Mizan* interprets the verse as a conclusive rebuttal to human skepticism about divine judgment, asserting that Allah’s adjudication transcends all earthly notions of fairness. The verse’s interrogative form (*istifham inkari*), as noted by Tabrisi in *Majma al-Bayan*, is not a genuine inquiry but a rhetorical device to underscore the absolute certainty of Allah’s justice, leaving no room for doubt.",
    "layer2short_urdu": "سورہ ایٹ ٹن (95: 8) میں ، بیان بازی کا سوال*\"کیا اللہ سب سب سے زیادہ ججوں کا نہیں ہے؟\"*شیعہ الہیات کا ایک سنگ بنیاد ، الہی انصاف (*‘ایڈل*) کی گہری تصدیق کے طور پر کام کرتا ہے۔ کلاسیکی شیعہ مبصرین اس آیت کی اسکیوٹولوجیکل طول و عرض پر زور دیتے ہیں ، اور اسے قیامت اور احتساب سے متعلق قرآن کی وسیع تر گفتگو میں رکھتے ہیں۔ الامہ تبتابائی * المزان * میں الہی فیصلے کے بارے میں انسانی شکوک و شبہات کے بارے میں ایک حتمی تردید کے طور پر اس آیت کی ترجمانی کرتے ہیں ، اور یہ کہتے ہوئے کہ اللہ کا فیصلہ انصاف کے تمام زمینی خیالات کو عبور کرتا ہے۔ آیت کی تفتیشی شکل (*istifham inkari*) ، جیسا کہ*ماجما البیان*میں تبریسی نے نوٹ کیا ہے ، اللہ کے انصاف کی مطلق یقین کو واضح کرنے کے لئے حقیقی انکوائری نہیں بلکہ ایک بیان بازی کا آلہ ہے ، جس میں شک کی کوئی گنجائش باقی نہیں ہے۔"
  }
}