{
  "1": {
    "layer1": "In the name of Allah, the Most Gracious, the Most Merciful. Surah Al-Humaza, a powerful Meccan revelation, opens with a divine warning: *\"Woe to every scorner and mocker\" (Quran 104:1)*. The term *wayl* signifies a severe punishment or calamity, reserved here for those who engage in *humaza* and *lumaza*. These Arabic words carry nuanced meanings: *humaza* refers to one who mocks, scoffs, or belittles others through speech or gestures, while *lumaza* denotes those who actively seek out faults in others, often through gossip, slander, or malicious criticism. Together, they paint a portrait of arrogance and moral corruption, targeting individuals who weaponize their words or actions to demean others.  \n\nHistorical accounts suggest this verse condemned the Quraysh elites who ridiculed the Prophet Muhammad (peace be upon him) and early Muslims, mocking their faith and socioeconomic status. Figures like Walid ibn al-Mughira, known for his scornful remarks, epitomized the *humaza* mentality, using their influence to undermine truth and dignity. The verse serves as a timeless reminder that such behavior is not merely a social vice but a spiritual disease that invites divine reckoning.  \n\nIn contemporary life, this verse challenges Muslims to reflect on how *humaza* and *lumaza* manifest today—whether through online trolling, gossip circles, or casual disrespect. The Ahlul Bayt (as) emphasized guarding the tongue; Imam Ali (as) warned, *\"The tongue is a beast—if let loose, it tears apart.\"* Practically, this calls for self-accountability: avoiding mockery, resisting the urge to demean others, and cultivating empathy. In a world where ridicule is often normalized, this verse urges believers to uphold *adab* (etiquette) and *ihsan* (moral excellence), recognizing that every word and action is observed by Allah. True faith, as taught by the Quran and the Imams, demands not just ritual worship but also ethical integrity in our interactions.",
    "layer2": "In classical Shia exegesis, Surah al-Humazah 1 serves as a profound admonition against moral and social vices that corrode communal harmony and spiritual integrity. The verse’s opening invocation of “woe” (وَيْلٌ) carries eschatological gravity, signaling divine chastisement for those who engage in *humazah* (scorn) and *lumazah* (mockery). Tabrisi, in *Majma al-Bayan*, distinguishes between these terms: *humazah* denotes overt derision through speech or action, while *lumazah* implies covert criticism, such as disparaging others through subtle gestures or facial expressions. Both acts are rooted in arrogance and a failure to recognize the inherent dignity of others, violating the Quranic principle of *ihsan* (moral excellence) and the Prophetic emphasis on guarding the tongue.\n\nTabatabai, in *Al-Mizan*, situates this verse within the broader Quranic framework of *tazkiyat al-nafs* (soul purification), arguing that mockery reflects a corrupted inner state that distances one from divine mercy. He underscores that such behavior contradicts the Shia ethos of *wilayah* (allegiance to divine guidance), as the Ahl al-Bayt consistently modeled humility and compassion. The sixth Imam, Jafar al-Sadiq, is reported to have linked habitual mockery to a hardened heart incapable of perceiving truth—a spiritual blindness with consequences in both worldly interactions and the hereafter.\n\nJurisprudentially, classical Shia scholars classify persistent scorn as a *ma’siyah* (disobedience) requiring repentance, given its potential to fracture social unity—a principle enshrined in Islamic communal ethics. The verse also resonates with the Shia theological emphasis on *adl* (divine justice), as mockery constitutes an injustice against the mocked, whose rights to honor are divinely protected. Thus, the verse transcends mere prohibition; it calls for cultivating *taqwa* (God-consciousness) that permeates speech, conduct, and intention, aligning the believer with the luminous example of the Ma’sumin (infallibles)",
    "layer3": "In contemporary Shia scholarship, Surah Al-Humazah’s opening verse is often contextualized as a timeless warning against social behaviors that erode human dignity. Modern scholars like Ayatollah Naser Makarem Shirazi emphasize that *humazah* (scorn) and *lumazah* (mockery) extend beyond literal backbiting to include systemic injustices, cyberbullying, and dehumanizing rhetoric in digital spaces. The verse’s condemnation of those who “reduce others through words or actions” resonates in an era where social media amplifies ridicule and polarization.  \n\nPsychologists like Dr. Gabor Maté have highlighted how verbal aggression and public shaming trigger trauma, linking the Quranic warning to mental health crises exacerbated by online toxicity. Contemporary thinkers, including Shia philosopher Dr. Liyakat Takim, connect the verse to social justice frameworks, arguing that mockery perpetuates classism, racism, and sectarian divides—issues the Ahlul Bayt actively opposed through their teachings on *adl* (justice) and *ihsan* (compassion).  \n\nThe verse also invites interfaith reflection: Buddhist teachings on “right speech,” Jewish ethics of *lashon hara* (harmful speech), and Christian calls to “love thy neighbor” all echo its moral core. In a world grappling with cancel culture and misinformation, the verse urges societies to prioritize restorative dialogue over punitive scorn.  \n\nUltimately, this ayah challenges modern believers to combat dehumanization in all forms—whether through viral hate speech, workplace discrimination, or geopolitical othering—by embodying the Quranic ideal of *rahma* (mercy) as a counterforce to division.",
    "layer4": "In the name of Allah, the Most Merciful, the Most Compassionate. The opening verse of Surah al-Humazah serves as a profound warning against the spiritual disease of belittling others. The Ahlul Bayt (peace be upon them) taught that \"humazah\" (scorning) and \"lumazah\" (mocking) are manifestations of arrogance and envy, which corrode the soul and sever one’s connection to divine mercy. Imam Ali (as) states in *Nahj al-Balagha*: \"The tongue of a believer lies behind his heart; when he wishes to speak, he first consults his heart. But the heart of a hypocrite lies behind his tongue; he speaks before consulting his heart.\" This verse condemns those who weaponize speech without spiritual discernment, reflecting a heart detached from the light of Wilayah (divine guardianship).\n\nThe Sixth Imam, Ja'far al-Sadiq (as), explained that mockery stems from ignorance of human dignity: \"Whoever mocks a believer has mocked the truth, and whoever mocks the truth has mocked Allah.\" The Ahlul Bayt emphasized that every soul carries the potential for divine proximity; to scorn others is to scorn the sacred essence Allah has placed within creation. Lady Fatimah (as) taught that humility before Allah necessitates humility before His creation: \"The most beloved of you to Allah are those who lower their wings [in kindness] to the people.\"\n\nPractically, this verse calls believers to purify their hearts through self-accountability. Before speaking, one must ask: Does this uplift or diminish the honor of a believer? The Imams linked such sins to weak faith in Imamah, for recognizing the divine light in the Guides necessitates recognizing it in all humanity. To heal this spiritual ailment, recite *Salawat* daily, seeking the intercession of the Ahlul Bayt to replace arrogance with compassion. As Imam Zayn al-Abidin (as) prayed in *Sahifa Sajjadiyya*: \"O Allah, bless Muhammad and his family, and adorn me with the crown of modesty and the garment of integrity.\" True faith is reflected in speech that unites hearts, not divides them.",
    "layer1_urdu": "اللہ کے نام پر ، سب سے زیادہ احسان مند ، سب سے زیادہ مہربان۔ میکن کا ایک طاقتور انکشاف ، سورہ الحومازا ایک الہی انتباہ کے ساتھ کھلتا ہے: *\"ہر اسکورر اور مذاق سے افسوس ہے\" (قرآن 104: 1) *۔ اصطلاح *وےل *ایک سخت سزا یا تباہی کی نشاندہی کرتی ہے ، جو یہاں *ہمازا *اور *لومازا *میں مشغول ہونے والوں کے لئے مختص ہے۔ یہ عربی الفاظ متناسب معنی رکھتے ہیں: * ہمازہ * اس سے مراد ہے جو تقریر یا اشاروں کے ذریعہ دوسروں کا مذاق اڑاتا ہے ، طنز کرتا ہے یا اس سے دوچار ہوتا ہے ، جبکہ * لومازا * ان لوگوں کی نشاندہی کرتا ہے جو دوسروں میں فعال طور پر غلطیاں تلاش کرتے ہیں ، اکثر گپ شپ ، بہتان یا بدنیتی پر مبنی تنقید کے ذریعے۔ ایک ساتھ ، وہ تکبر اور اخلاقی بدعنوانی کا ایک تصویر پینٹ کرتے ہیں ، اور ان افراد کو نشانہ بناتے ہیں جو دوسروں کو بدنام کرنے کے لئے اپنے الفاظ یا اعمال کو اسلحہ بناتے ہیں۔  \n\nتاریخی اکاؤنٹس سے پتہ چلتا ہے کہ اس آیت نے قریش کے اشرافیہ کی مذمت کی ہے جنہوں نے حضرت محمد صلی اللہ علیہ وآلہ وسلم اور ابتدائی مسلمانوں کا مذاق اڑایا ، اور ان کے عقیدے اور معاشرتی معاشی حیثیت کا مذاق اڑایا۔ والڈ ابن المغیرا جیسے اعداد و شمار ، جو اپنے طعنہ زنی کے ریمارکس کے لئے مشہور ہیں ، نے سچائی اور وقار کو مجروح کرنے کے لئے اپنے اثر و رسوخ کا استعمال کرتے ہوئے * ہمازا * ذہنیت کا مظہر کیا۔ آیت ایک لازوال یاد دہانی کا کام کرتی ہے کہ اس طرح کا سلوک محض ایک معاشرتی نائب نہیں بلکہ ایک روحانی بیماری ہے جو الہی حساب کتاب کی دعوت دیتا ہے۔  \n\nعصری زندگی میں ، یہ آیت مسلمانوں کو چیلنج کرتی ہے کہ وہ اس بات پر غور کریں کہ آج کس طرح * ہمازہ * اور * لومازا * ظاہر ہوتا ہے - چاہے آن لائن ٹرولنگ ، گپ شپ حلقوں ، یا آرام دہ اور پرسکون بے عزتی کے ذریعے۔ اہل بائٹ (ع) نے زبان کی حفاظت پر زور دیا۔ امام علی (ع) نے متنبہ کیا ، * \"زبان ایک درندہ ہے-اگر اس کو ڈھیلے چھوڑ دیں تو ، اس سے آنسو نکل جاتے ہیں۔\" * عملی طور پر ، اس سے خود بخود پن کا مطالبہ کیا جاتا ہے: طنز سے گریز کرنا ، دوسروں کو بدنام کرنے کی خواہش کی مزاحمت کرنا ، اور ہمدردی کاشت کرنا۔ ایسی دنیا میں جہاں طنز کو اکثر معمول بنایا جاتا ہے ، یہ آیت مومنوں کو * اڈاب * (آداب) اور * Ihsan * (اخلاقی فضیلت) کو برقرار رکھنے کی تاکید کرتی ہے ، اور یہ تسلیم کرتے ہوئے کہ اللہ کے ذریعہ ہر لفظ اور عمل کا مشاہدہ کیا جاتا ہے۔ سچا عقیدہ ، جیسا کہ قرآن اور اماموں نے سکھایا ہے ، نہ صرف رسمی عبادت کا مطالبہ کرتا ہے بلکہ ہماری بات چیت میں اخلاقی سالمیت کا بھی مطالبہ کرتا ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الحومازاہ 1 اخلاقی اور معاشرتی برائیوں کے خلاف گہری نصیحت کے طور پر کام کرتی ہے جو فرقہ وارانہ ہم آہنگی اور روحانی سالمیت کو ختم کرتی ہے۔ آیت کی \"WOE\" (وِل ْ ٌ ٌ) کی افتتاحی درخواست میں اسکیٹولوجیکل کشش ثقل ہے ، جو ان لوگوں کے لئے الہی عذاب کا اشارہ کرتا ہے جو * ہمازہ * (طنز) اور * لومازاہ * (طنز) میں مشغول ہیں۔ تبریسی ، *مجسما البیان *میں ، ان شرائط کے مابین تمیز کرتے ہیں: *ہمازہ *تقریر یا عمل کے ذریعہ واضح طنز کی نشاندہی کرتا ہے ، جبکہ *لومازاہ *خفیہ تنقید کا مطلب ہے ، جیسے لطیف اشاروں یا چہرے کے تاثرات کے ذریعے دوسروں کو ناپسند کرنا۔ دونوں کاموں کی جڑ تکبر اور دوسروں کے موروثی وقار کو تسلیم کرنے میں ناکامی ، * Ihsan * (اخلاقی فضیلت) کے قرآنی اصول کی خلاف ورزی اور زبان کی حفاظت پر پیشن گوئی پر زور دینے میں ناکامی۔\n\nتبتابائی ، *المزان *میں ، اس آیت کو *تزکیت النفس *(روح طہارت) کے وسیع تر قرآنی فریم ورک کے اندر پیش کرتا ہے ، اور یہ استدلال کرتا ہے کہ طنزیہ ایک بدعنوان داخلی حالت کی عکاسی کرتا ہے جو ایک کو الہی رحم سے دور کرتا ہے۔ انہوں نے اس بات کی نشاندہی کی کہ اس طرح کے طرز عمل * ولیہ * (الہی رہنمائی سے بیعت) کے شیعہ اخلاقیات سے متصادم ہے ، کیونکہ اے ایچ ایل البائٹ نے مستقل طور پر عاجزی اور ہمدردی کی ماڈلنگ کی۔ چھٹا امام ، جعفر السادق ، کے بارے میں بتایا جاتا ہے کہ اس نے عادت کے طنز کو سخت دل سے جوڑ دیا ہے جو سچائی کو سمجھنے سے قاصر ہے۔\n\nفقہی طور پر ، کلاسیکی شیعہ اسکالرز مستقل طور پر طعنہ زنی کو ایک * مایسیہ * (نافرمانی) کے طور پر درجہ بندی کرتے ہیں جس میں توبہ کی ضرورت ہوتی ہے ، اس کو معاشرتی اتحاد کو فریکچر کرنے کی صلاحیت کے پیش نظر۔ یہ ایک اصول اسلامی فرقہ وارانہ اخلاقیات میں شامل ہے۔ یہ آیت * ADL * (الہی انصاف) پر شیعہ مذہبی زور سے بھی گونجتی ہے ، کیونکہ طنز مذاق کے خلاف ایک ناانصافی تشکیل دیتا ہے ، جس کے اعزاز کے حقوق کو خدائی طور پر محفوظ کیا جاتا ہے۔ اس طرح ، آیت محض ممانعت سے بالاتر ہے۔ اس میں * تقوا * (خدا کے شعور) کی کاشت کرنے کا مطالبہ کیا گیا ہے جو تقریر ، طرز عمل اور ارادے سے دوچار ہوتا ہے ، مومن کو ماوسمین (انفالبلز) کی برائٹ مثال کے ساتھ سیدھ میں کرتا ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ الحومازاہ کی افتتاحی آیت اکثر معاشرتی طرز عمل کے خلاف لازوال انتباہ کے طور پر سیاق و سباق کی جاتی ہے جو انسانی وقار کو ختم کرتی ہے۔ آیت اللہ ناصر مکریم شیرازی جیسے جدید اسکالرز اس بات پر زور دیتے ہیں کہ * ہمازہ * (طعنہ زنی) اور * لومازاہ * (طنزیہ) ڈیجیٹل خالی جگہوں میں نظامی ناانصافیوں ، سائبر دھونس ، اور ڈیجیٹل خالی جگہوں میں غیر مہذب بیان بازی کو شامل کرنے کے ل lite لفظی بیکنگ سے آگے بڑھتے ہیں۔ آیت کی ان لوگوں کی مذمت جو \"الفاظ یا اعمال کے ذریعہ دوسروں کو کم کرتی ہے\" ایک ایسے دور میں گونجتی ہے جہاں سوشل میڈیا طنز اور پولرائزیشن کو بڑھا دیتا ہے۔  \n\nڈاکٹر گابر میٹا جیسے ماہرین نفسیات نے اس بات پر روشنی ڈالی ہے کہ کس طرح زبانی جارحیت اور عوامی شرمناک ٹرگر صدمے سے ، قرآنی انتباہ کو ذہنی صحت کے بحرانوں سے جوڑتے ہوئے آن لائن زہریلا سے بڑھ جاتا ہے۔ عصری مفکرین ، بشمول شیعہ کے فلسفی ڈاکٹر لییاکات تکیم ، اس آیت کو معاشرتی انصاف کے فریم ورک سے مربوط کرتے ہیں ، اور یہ استدلال کرتے ہیں کہ طنزیہ طبقاتی ، نسل پرستی اور فرقہ وارانہ تقسیم کو برقرار رکھتا ہے۔ احلول بیت نے * ADL * (انصاف) اور * Ihsan * (ہمدردی) کے بارے میں اپنی تعلیمات کے ذریعے فعال طور پر مخالفت کی ہے۔  \n\nیہ آیت بین المذاہب کی عکاسی بھی کی دعوت دیتی ہے: \"صحیح تقریر\" پر بدھ مت کی تعلیمات ، * لاشون ہارا * (نقصان دہ تقریر) کی یہودی اخلاقیات ، اور عیسائی سب کو \"اپنے پڑوسی سے پیار کرنے\" کا مطالبہ کرتا ہے۔ منسوخ ثقافت اور غلط معلومات کے ساتھ مل کر دنیا میں ، آیت سوسائٹیوں پر زور دیتی ہے کہ وہ تعزیراتی طعنہ زنی پر بحالی مکالمے کو ترجیح دیں۔  \n\nبالآخر ، یہ آیہ جدید مومنین کو چیلنج کرتا ہے کہ وہ ہر شکل میں غیر مہذب ہونے کا مقابلہ کریں - چاہے وائرل نفرت انگیز تقریر ، کام کی جگہ کی امتیازی سلوک ، یا جیو پولیٹیکل دوسرے اور جیو پولیٹیکل دیگر - جو تقسیم کے لئے ایک کاؤنٹر فورس کے طور پر * رحما * (رحمت) کے قرآنی مثالی کو مجسم بناتے ہیں۔",
    "layer4_urdu": "اللہ کے نام پر ، انتہائی مہربان ، انتہائی ہمدرد۔ سورہ الحومازاہ کی ابتدائی آیت دوسروں کو شکست دینے کی روحانی بیماری کے خلاف گہری انتباہ کا کام کرتی ہے۔ اہل بیت (ان پر امن ہے) نے یہ سکھایا کہ \"ہمازہ\" (اسکورنگ) اور \"لومازہ\" (مذاق) تکبر اور حسد کا مظہر ہیں ، جو روح کو ختم کرتے ہیں اور الہی رحمت سے کسی کا تعلق ختم کردیتے ہیں۔ امام علی (ع) *ناہج البالاگھا *میں بیان کرتے ہیں: \"ایک مومن کی زبان اس کے دل کے پیچھے رہتی ہے۔ جب وہ بولنا چاہتا ہے تو وہ پہلے اپنے دل سے مشورہ کرتا ہے۔ لیکن ایک منافق کا دل اس کی زبان کے پیچھے ہے۔ وہ اپنے دل سے مشورہ کرنے سے پہلے بولتا ہے۔\" یہ آیت ان لوگوں کی مذمت کرتی ہے جو روحانی تفہیم کے بغیر تقریر کو ہتھیار ڈالتے ہیں ، جو ولیہ (الہی سرپرستی) کی روشنی سے الگ دل کی عکاسی کرتے ہیں۔\n\nچھٹا امام ، جافر السادق (ع) ، نے وضاحت کی کہ طنز انسانی وقار سے لاعلمی سے ہوتا ہے: \"جس نے بھی کسی مومن کا مذاق اڑایا ہے اس نے سچائی کا مذاق اڑایا ہے ، اور جس نے بھی سچائی کا مذاق اڑایا ہے اس نے اللہ کا مذاق اڑایا ہے۔\" اہل بیت نے اس بات پر زور دیا کہ ہر روح الہی قربت کی صلاحیت رکھتی ہے۔ دوسروں کو طعنہ زنی کرنا اللہ نے تخلیق کے اندر رکھے ہوئے مقدس جوہر کو طنز کرنا ہے۔ لیڈی فاطمہ (ع) نے اللہ سے پہلے ہی عاجزی کو اپنی تخلیق سے پہلے ہی عاجزی کی ضرورت کی تھی: \"اللہ کے لئے آپ کا سب سے محبوب وہ لوگ ہیں جو اپنے پروں کو [مہربانی سے] لوگوں کے ساتھ کم کرتے ہیں۔\"\n\nعملی طور پر ، یہ آیت مومنوں کو خود محاسبیت کے ذریعہ اپنے دلوں کو پاک کرنے کا مطالبہ کرتی ہے۔ بولنے سے پہلے ، کسی سے پوچھنا چاہئے: کیا یہ کسی مومن کے اعزاز کو ترقی یا کم کرتا ہے؟ اماموں نے اس طرح کے گناہوں کو امامہ میں کمزور عقیدے سے جوڑ دیا ، کیونکہ ہدایت ناموں میں الہی روشنی کو پہچاننے کے لئے اسے پوری انسانیت میں پہچاننے کی ضرورت ہے۔ اس روحانی بیماری کو ٹھیک کرنے کے لئے ، روزانہ * صلاحوات * کی تلاوت کریں ، اور تکبر کو ہمدردی کے ساتھ تبدیل کرنے کے لئے اہل بائٹ کی شفاعت کے خواہاں ہیں۔ جیسا کہ امام زین الیبدین (ع) نے *ساہفا سججدیہ *میں دعا کی تھی: \"اے اللہ ، محمد اور اس کے اہل خانہ کو برکت دو ، اور مجھے شائستگی کے تاج اور سالمیت کے لباس سے آراستہ کیا۔\" حقیقی عقیدہ تقریر میں جھلکتا ہے جو دلوں کو متحد کرتا ہے ، انہیں تقسیم نہیں کرتا ہے۔",
    "layer5": "In examining Surah al-Humaza 104:1, Shia and Sunni exegetical traditions converge in identifying the verse’s core ethical warning against disparagement and mockery. Both schools, as noted in Tabari’s *Jami al-Bayan* and Tabatabai’s *Al-Mizan*, interpret *humaza* (scorner) and *lumaza* (mocker) as condemnations of malicious speech and character assassination, rooted in Quranic ethics of social harmony. Ibn Kathir and Tabrisi’s *Majma al-Bayan* similarly emphasize the universality of this rebuke, linking it to prophetic traditions condemning backbiting (*ghiba*) and arrogance (*kibr*).  \n\nDivergences emerge in contextual framing. Sunni commentaries like Qurtubi’s *Al-Jami* often historicize the verse as addressing specific Meccan detractors of the Prophet, such as Walid ibn Mughira, while Fakhr al-Din Razi’s *Mafatih al-Ghayb* explores psychological dimensions of mockery as a symptom of spiritual disease. Shia sources, particularly Tusi’s *At-Tibyan* and Qummi’s *Tafsir*, extend the critique to include political slander against the Ahl al-Bayt, interpreting the verse as a timeless censure of those who undermine divinely appointed leadership. This reflects the Shia theological emphasis on *walaya* (allegiance to the Imams) as integral to moral conduct.  \n\nPractically, both traditions reinforce avoiding gossip and fostering communal respect. However, Shia interpretations may accentuate vigilance against disparaging religious authorities, whereas Sunni applications often stress individual accountability in speech. Historically, these differences stem from distinct post-prophetic community experiences: Sunni exegesis developed within broader discussions of public ethics, while Shia tafsir evolved alongside narratives of persecution faced by the Prophet’s household.  \n\nSuch variations illustrate how shared ethical principles adapt to theological priorities without contradicting the verse’s unambiguous moral imperative—a testament to Islam’s multifaceted exegetical heritage.",
    "layer5_urdu": "سورہ الحومازا 104: 1 کی جانچ پڑتال کرتے ہوئے ، شیعہ اور سنی ایکسیجیکل روایات بدعنوانی اور طنز کے خلاف آیت کی بنیادی اخلاقی انتباہ کی نشاندہی کرنے میں ملتی ہیں۔ دونوں اسکول ، جیسا کہ تباری کے *جامی البیان *اور تبتابائی کے *المزان *میں نوٹ کیا گیا ہے ، *ہمسازا *(اسکورنر) اور *لومازا *(مذاق) کی تشریح کریں ، بدنیتی پر مبنی تقریر اور کردار کے قتل کی مذمت کے طور پر ، جو معاشرتی ہم آہنگی کی قرآنی اخلاقیات میں ہے۔ ابن کتھیر اور تبریسی کے*مجمہ البیان*اسی طرح اس سرزنش کی عالمگیریت پر زور دیتے ہیں ، اور اسے پیشن گوئی کی روایات سے جوڑتے ہیں جو بیکنگ (*غیبہ*) اور تکبر (*کیبر*) کی مذمت کرتے ہیں۔  \n\nسیاق و سباق کے فریمنگ میں تفریق پیدا ہوتی ہے۔ سنی تبصرے جیسے قربانی * الجامی * اکثر اس آیت کو تاریخی بناتے ہیں جیسے نبی of کے مخصوص مکہ مکرمین ، جیسے ولید ابن مغروہ سے خطاب کرتے ہیں ، جبکہ فاکر الدین رازی کی * مافاتیہ الغیب * روحانی بیماری کی علامت کے طور پر مذاق کے نفسیاتی طول و عرض کی کھوج کرتی ہے۔ شیعہ ذرائع ، خاص طور پر توسی کے *ایٹ تبیان *اور قمی کے *طافسیر *، اے ایچ ایل ال بیت کے خلاف سیاسی بہتان کو شامل کرنے کے لئے تنقید کو بڑھا دیتے ہیں ، اور اس آیت کو ان لوگوں کی ایک لازوال سنسنی کے طور پر ترجمانی کرتے ہیں جنہوں نے الہامی طور پر مقرر کردہ قیادت کو مجروح کیا تھا۔ اس سے اخلاقی طرز عمل سے لازمی طور پر * والیا * (اماموں کی بیعت) پر شیعہ مذہبی زور کی عکاسی ہوتی ہے۔  \n\nعملی طور پر ، دونوں روایات گپ شپ سے گریز کرنے اور فرقہ وارانہ احترام کو فروغ دینے کو تقویت دیتی ہیں۔ تاہم ، شیعہ تشریحات مذہبی حکام کو ناپسند کرنے کے خلاف چوکسی کو بڑھا سکتی ہیں ، جبکہ سنی ایپلی کیشنز اکثر تقریر میں انفرادی احتساب پر زور دیتے ہیں۔ تاریخی طور پر ، یہ اختلافات بعد کے متناسب معاشرے کے مختلف تجربات سے پیدا ہوئے ہیں: سنی استثنیٰ عوامی اخلاقیات کے وسیع تر مباحثوں میں تیار ہوا ، جبکہ شیعہ طافسر نے نبی ame کے گھرانوں کو درپیش ظلم و ستم کے بیانیے کے ساتھ ساتھ تیار کیا۔  \n\nاس طرح کی مختلف حالتوں میں یہ واضح کیا گیا ہے کہ مشترکہ اخلاقی اصول آیت کی غیر واضح اخلاقی لازمی لازمی طور پر مذہبی ترجیحات کے مطابق کس طرح اپناتے ہیں۔",
    "summary": "In analyzing this verse, Allama Tabatabai highlights that situates this verse within the broader Quranic framework of *tazkiyat al-nafs* (soul purification), arguing that mockery reflects a corrupted inner state that distances one from divine mercy. In the name of Allah, the Most Gracious, the Most Merciful. Surah Al-Humaza, a powerful Meccan revelation, opens with a divine warning: *\"Woe to every scorner and mocker\" (Quran 104:1)*. The term *wayl* signifies a severe punishment or calamity, reserved here for those who engage in *humaza* and *lumaza*. Imam Ali (as) states in *Nahj al-Balagha*: \"The tongue of a believer lies behind his heart; when he wishes to speak, he first consults his heart. True faith, as taught by the Quran and the Imams, demands not just ritual worship but also ethical integrity in our interactions.",
    "layer2short": "In classical Shia exegesis, Surah al-Humazah 1 serves as a profound admonition against moral and social vices that corrode communal harmony and spiritual integrity. The verse’s opening invocation of “woe” (وَيْلٌ) carries eschatological gravity, signaling divine chastisement for those who engage in *humazah* (scorn) and *lumazah* (mockery). Tabrisi, in *Majma al-Bayan*, distinguishes between these terms: *humazah* denotes overt derision through speech or action, while *lumazah* implies covert criticism, such as disparaging others through subtle gestures or facial expressions. Both acts are rooted in arrogance and a failure to recognize the inherent dignity of others, violating the Quranic principle of *ihsan* (moral excellence) and the Prophetic emphasis on guarding the tongue.",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الحومازاہ 1 اخلاقی اور معاشرتی برائیوں کے خلاف گہری نصیحت کے طور پر کام کرتی ہے جو فرقہ وارانہ ہم آہنگی اور روحانی سالمیت کو ختم کرتی ہے۔ آیت کی \"WOE\" (وِل ْ ٌ ٌ) کی افتتاحی درخواست میں اسکیٹولوجیکل کشش ثقل ہے ، جو ان لوگوں کے لئے الہی عذاب کا اشارہ کرتا ہے جو * ہمازہ * (طنز) اور * لومازاہ * (طنز) میں مشغول ہیں۔ تبریسی ، *مجسما البیان *میں ، ان شرائط کے مابین تمیز کرتے ہیں: *ہمازہ *تقریر یا عمل کے ذریعہ واضح طنز کی نشاندہی کرتا ہے ، جبکہ *لومازاہ *خفیہ تنقید کا مطلب ہے ، جیسے لطیف اشاروں یا چہرے کے تاثرات کے ذریعے دوسروں کو ناپسند کرنا۔ دونوں کاموں کی جڑ تکبر اور دوسروں کے موروثی وقار کو تسلیم کرنے میں ناکامی ، * Ihsan * (اخلاقی فضیلت) کے قرآنی اصول کی خلاف ورزی اور زبان کی حفاظت پر پیشن گوئی پر زور دینے میں ناکامی۔"
  },
  "2": {
    "layer1": "Surah al-Humazah, revealed in Mecca, condemns those consumed by materialism and arrogance. Verse 2 – *\"alladhi jama'a malan wa 'addadahu\"* – criticizes the obsessive accumulation and constant counting of wealth. The term *jama'a* (to gather/hoard) implies a compulsive collecting of *mal* (wealth or possessions), while *'addadahu* (counting it repeatedly) highlights a preoccupation with worldly status. This verse, according to Shia tafsir scholars like Allamah Tabatabai in *Al-Mizan*, targets individuals who substitute spiritual poverty for material excess, treating wealth as an eternal security rather than a temporary trust from Allah.\n\nHistorically, this verse rebuked wealthy Meccan elites like Walid ibn Mughirah or Uqba ibn Abi Mu'ayt, who mocked the Prophet (PBUH) and oppressed early Muslims while boasting of their riches. The Ahlul Bayt, particularly Imam Ali in *Nahj al-Balagha*, warned that such attachment to wealth breeds greed, blinds one to divine purpose, and fuels social inequality. The Quranic critique isn’t against lawful earnings but the *ghaflah* (heedlessness) of prioritizing wealth over spiritual growth and communal responsibility.\n\nIn modern contexts, this verse challenges Muslims to examine their relationship with money. The act of \"counting wealth\" today might manifest as obsessive stock-checking, social media-driven materialism, or valuing net worth over ethical integrity. Shia teachings urge believers to view wealth as a tool for ihsan (beneficence) – supporting families, giving zakat, and aiding the vulnerable – rather than an end goal. Imam Sadiq (AS) taught that true richness lies in contentment (qana’ah) and detachment from worldly illusions. By balancing halal efforts with gratitude and generosity, Muslims can avoid the spiritual ruin warned in this verse, aligning their hearts with the eternal rewards of the Hereafter.",
    "layer2": "In classical Shia exegesis, Surah al-Humazah 104:2 is interpreted as a profound condemnation of materialism and the spiritual corruption arising from obsessive attachment to worldly wealth. The verse’s focus on one who \"collects wealth and [continuously] counts it\" is understood not merely as a critique of greed but as a reflection of a diseased heart (qalbun marīḍ) that substitutes transient possessions for eternal truths. Al-Tabrisi in *Majma al-Bayan* emphasizes the psychological dimension: the act of \"counting\" (ʿaddada) signifies a preoccupation with accumulation as an end in itself, reflecting arrogance (istikbār) and a delusion of permanence. This aligns with Imam Ali’s teachings in *Nahj al-Balagha*, where he warns that wealth becomes a \"trial\" (fitnah) when it distracts from accountability before Allah.\n\nAl-Tabtabai’s *Al-Mizan* expands this ethically, linking the verse to the Shia theological principle of *tawḥīd al-afʿāl* (divine unity in acts): the miser’s belief that wealth is acquired and sustained through personal effort, rather than divine providence, constitutes a subtle form of polytheism (shirk khafī). The verse thus condemns the ontological error of attributing autonomy to material means. Classical commentators also connect this to the Imams’ emphasis on *infaq* (charitable spending) as a spiritual antidote. For instance, Imam Jafar al-Sadiq states in *Bihar al-Anwar* that \"counting wealth\" reflects a heart closed to the rights of others, violating the Quranic mandate to \"spend from what He has made you trustees over\" (57:7). \n\nJuridically, Shia scholars contextualize this verse within obligations like *zakat* and *khums*, framing hoarding as a rejection of socioeconomic justice integral to Wilayah (allegiance to the Ahl al-Bayt’s guidance). The eschatological warning in subsequent verses (\"He will be thrown into the Crusher,\" 104:4) underscores the Shiʿi concept of *maʿād* (return to Allah), where wealth becomes a witness against, not for, the soul. This synthesis of ethical, theological, and legal dimensions reflects the holistic Shia approach to Quranic hermeneutics.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Humazah’s condemnation of obsessive wealth accumulation resonates powerfully in an age defined by materialism and economic inequality. Ayatollah Naser Makarem Shirazi, in his *Tafsir Nemuneh*, emphasizes that the verse critiques not wealth itself but the *psychology of greed*—a fixation on hoarding and tallying possessions that distracts from spiritual and ethical duties. Modern scholars like Dr. Mohammad Ali Shomali connect this to today’s consumerist culture, where social media and advertising fuel endless desires, turning wealth into a false measure of self-worth.  \n\nNeuroscientific studies, such as those cited in *Psychology Today*, reveal that materialism correlates with lower life satisfaction, echoing the Quranic warning that such pursuits leave the soul “empty” (104:4). Philosophically, thinkers like Dr. Reza Shah-Kazemi frame this verse as a call to balance material and spiritual economies, urging Muslims to redirect energy from accumulation to community welfare—a theme central to Shia ethics, where concepts like *khums* institutionalize wealth redistribution.  \n\nGlobally, this verse speaks to crises like climate change (driven by overconsumption) and the widening wealth gap, where the top 1% own nearly half the world’s assets. Interfaith parallels emerge here: Pope Francis’ critiques of “the economy of exclusion” and Buddhist teachings on detachment mirror the Quran’s caution against wealth-worship. Multicultural activism, such as universal basic income trials or ethical banking movements, aligns with the verse’s underlying message: true security lies not in stacked riches but in shared prosperity and trust in divine provision.  \n\nIn essence, this verse remains a timeless critique of human vulnerability to greed, urging societies to prioritize equity and purpose over profit—a vision as urgent today as in 7th-century Arabia.",
    "layer4": "The verse condemns those consumed by material accumulation, a spiritual disease the Ahlul Bayt (as) identified as a barrier to recognizing divine truth. Imam Ali (as) warns, *\"The greedy is in perpetual poverty, even if he possesses the world’s treasures\"* (Ghurar al-Hikam). This \"poverty\" is not financial but a soul’s starvation for eternal purpose. The act of \"counting wealth\" reflects an obsessive attachment to transient possessions, blinding one to the reality that true value lies in preparing for the Hereafter through devotion and service.  \n\nLady Fatimah (as), in her famed sermon, declared, *\"Allah made faith your purification from polytheism, and prayer a means to repel arrogance\"* (Bihar al-Anwar). Here, the \"polytheism\" of the heart manifests as prioritizing wealth over Allah’s remembrance. The verse’s condemned individual embodies a soul enslaved by worldly metrics, neglecting the Imamah’s call to measure life by righteousness, not riches. Imam Sadiq (as) taught, *\"The love of this world is the root of every sin\"* (al-Kafi), emphasizing that material obsession corrupts intention and severs one from Wilayah – the divine guardianship of the Imams.  \n\nPractically, the Ahlul Bayt (as) urge believers to transform wealth into a tool for spiritual growth: give charity to purify the soul, support the oppressed, and fund acts that uphold the message of the Imams. Regular recitation of *\"Hasbunallahu wa ni’mal Wakeel\"* (Allah suffices us, and He is the Best Disposer of affairs) dismantles reliance on material security. True \"counting\" is the daily audit of deeds in light of the scales of justice on Qiyamah, a concept Imam Zayn al-Abidin (as) invokes in Du’a Abu Hamza Thumali: *\"Make me content with what You’ve allotted me, and let me not plead before You for what You’ve given others.\"* Wealth becomes blessed only when it fuels the journey toward the Divine, not when it becomes the destination.",
    "layer1_urdu": "مکہ میں انکشاف کردہ سورہ الحومازاہ ، مادیت اور تکبر کے ذریعہ استعمال ہونے والوں کی مذمت کرتے ہیں۔ آیت 2 - * \"اللادھی جمعہ ملان وا 'اڈاداہو\" * - جنونی جمع اور دولت کی مستقل گنتی پر تنقید کرتا ہے۔ اصطلاح * جماما * (جمع کرنے/جمع کرنے کے لئے) * مال * (دولت یا مال) کی ایک زبردستی جمع کرنے کا مطلب ہے ، جبکہ * 'ایڈاداہو * (بار بار گنتی) دنیاوی حیثیت کے ساتھ مشغولیت کو اجاگر کرتا ہے۔ یہ آیت ، شیعہ طافسیر اسکالرز جیسے *العزان *میں الامہ تبتابائی جیسے اسکالرز کے مطابق ، ایسے افراد کو نشانہ بناتی ہے جو مادی زیادتی کے لئے روحانی غربت کو تبدیل کرتے ہیں ، اور دولت کو اللہ کی طرف سے عارضی اعتماد کے بجائے ابدی سلامتی کے طور پر سلوک کرتے ہیں۔\n\nتاریخی طور پر ، اس آیت نے والڈ ابن مغیرہ یا اذبا ابن ابی مائیوٹ جیسے دولت مند میکن کے اشرافیہ کو سرزنش کی ، جنہوں نے نبی (صلی اللہ علیہ وآلہ وسلم) کا مذاق اڑایا اور ابتدائی مسلمانوں پر ظلم کیا جبکہ اپنی دولتوں پر فخر کرتے ہوئے۔ احلول بیت ، خاص طور پر امام علی *نہج البالاگھا *میں ، نے متنبہ کیا ہے کہ دولت سے اس طرح کے منسلک ہونے سے لالچ پیدا ہوتا ہے ، کسی کو الہی مقصد سے اندھا ہوجاتا ہے ، اور معاشرتی عدم مساوات کو ایندھن ملتا ہے۔ قرآنی نقاد قانونی طور پر کمائی کے خلاف نہیں ہے بلکہ روحانی نشوونما اور فرقہ وارانہ ذمہ داری سے زیادہ دولت کو ترجیح دینے کے * غفلہ * (غفلت) ہے۔\n\nجدید سیاق و سباق میں ، یہ آیت مسلمانوں کو چیلنج کرتی ہے کہ وہ پیسوں کے ساتھ ان کے تعلقات کا جائزہ لیں۔ آج \"دولت کی گنتی\" کا عمل جنونی اسٹاک چیکنگ ، سوشل میڈیا سے چلنے والی مادیت پرستی ، یا اخلاقی سالمیت سے زیادہ مالیت کی قدر کی حیثیت سے ظاہر ہوسکتا ہے۔ شیعہ کی تعلیمات مومنین سے گزارش کرتی ہیں کہ وہ دولت کو IHSAN (فائدہ) کے لئے ایک آلے کے طور پر دیکھیں - خاندانوں کی مدد کرنا ، زکوٰ کو دینا ، اور کمزوروں کی مدد کرنا - حتمی مقصد کے بجائے۔ امام صادق (ع) نے سکھایا کہ حقیقی دولت قناعت (قانا ’اور دنیاوی وہموں سے لاتعلقی میں مضمر ہے۔ شکریہ اور سخاوت کے ساتھ حلال کوششوں کو متوازن کرکے ، مسلمان اس آیت میں خبردار کرنے والے روحانی بربادی سے بچ سکتے ہیں ، اور اپنے دلوں کو اس کے بعد کے دائمی انعامات کے ساتھ جوڑتے ہیں۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الحومازاہ 104: 2 کو مادیت کی گہری مذمت اور دنیاوی دولت سے جنونی وابستگی سے پیدا ہونے والی روحانی بدعنوانی کی ترجمانی کی گئی ہے۔ اس آیت کی توجہ اس پر مرکوز ہے جو \"دولت جمع کرتا ہے اور [مستقل طور پر] اس کا شمار کرتا ہے\" صرف لالچ کے نقاد کے طور پر نہیں بلکہ ایک بیمار دل (قلون مار īḍ) کی عکاسی کے طور پر سمجھا جاتا ہے جو ابدی سچائیوں کے لئے عارضی مال کو متبادل بناتا ہے۔ * ماجما البیان * میں الاتبریسی نفسیاتی جہت پر زور دیتے ہیں: \"گنتی\" (الدادا) کا عمل اپنے آپ میں ایک اختتام کے ساتھ ایک مشغولیت کی نشاندہی کرتا ہے ، جس میں تکبر (استکیبر) اور استحکام کی ایک فریب کی عکاسی ہوتی ہے۔ یہ *ناہج البالاگھا *میں امام علی کی تعلیمات سے ہم آہنگ ہے ، جہاں وہ متنبہ کرتا ہے کہ جب یہ اللہ کے سامنے احتساب سے ہٹ جاتا ہے تو دولت \"آزمائشی\" (فٹنہ) بن جاتی ہے۔\n\nال تبتابائی کا * العزان * اس اخلاقی طور پر توسیع کرتا ہے ، اور اس آیت کو * تاؤد الافال * (ایکٹ میں الہی اتحاد) کے شیعہ مذہبی اصول سے جوڑتا ہے: اس بدگمانی کا یہ عقیدہ ہے کہ دولت ذاتی کوششوں کے ذریعہ حاصل کی جاتی ہے اور اس کو برقرار رکھا جاتا ہے ، بجائے اس کے کہ وہ الہی پروویڈنس کے بجائے ، پولیتھزم کی ایک لطیف شکل ہے۔ اس طرح آیت مادی ذرائع سے خودمختاری کو منسوب کرنے کی آنٹولوجیکل غلطی کی مذمت کرتی ہے۔ کلاسیکی مبصرین بھی اس کو اماموں کے ’انفیک * (خیراتی اخراجات) پر روحانی تریاق کے طور پر مربوط کرتے ہیں۔ مثال کے طور پر ، امام جعفر السادیق نے * بہار الانور * میں کہا ہے کہ \"گنتی دولت\" دوسروں کے حقوق کے لئے بند دل کی عکاسی کرتی ہے ، اور قرآنی مینڈیٹ کی خلاف ورزی کرتی ہے کہ \"اس نے آپ کو ٹرسٹی بنائے ہیں\" (57: 7)۔ \n\nجوازی طور پر ، شیعہ اسکالرز اس آیت کو *زکاٹ *اور *خمس *جیسی ذمہ داریوں کے اندر سیاق و سباق دیتے ہیں ، اور ذخیرہ اندوزی کو سماجی و اقتصادی انصاف کے انضمام کے طور پر ویلیح (اے ایچ ایل ال بیت کی رہنمائی کی بیعت) کے طور پر تیار کرتے ہیں۔ اس کے بعد کی آیات (\"اسے کولہو میں پھینک دیا جائے گا ،\" 104: 4) میں اسکاٹولوجیکل انتباہ * ماؤد * (اللہ کی طرف لوٹنے والے) کے شیع کے تصور کی نشاندہی کرتا ہے ، جہاں دولت روح کے لئے گواہ بن جاتی ہے۔ اخلاقی ، مذہبی اور قانونی جہتوں کی یہ ترکیب قرآنی ہرمینیٹکس کے لئے شیعہ کے جامع نقطہ نظر کی عکاسی کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ الحومازاہ کی جنونی دولت کے جمع ہونے کی مذمت مادیت اور معاشی عدم مساوات کے ذریعہ بیان کردہ دور میں طاقتور طور پر گونجتی ہے۔ آیت اللہ نصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں اس بات پر زور دیا ہے کہ آیت خود ہی دولت پر تنقید کرتی ہے بلکہ لالچ کی نفسیات * - ذخیرہ اندوزی اور اخلاقی فرائض سے مشغول ہونے والے املاک پر ذخیرہ اندوزی پر تعی .ن کرتی ہے۔ ڈاکٹر محمد علی شومالی جیسے جدید اسکالرز اس کو آج کی صارفیت کی ثقافت سے مربوط کرتے ہیں ، جہاں سوشل میڈیا اور اشتہاری ایندھن لامتناہی خواہشات کرتے ہیں ، اور دولت کو خود کی خوبی کے غلط اقدام میں بدل دیتے ہیں۔  \n\nنیورو سائنسٹیفک اسٹڈیز ، جیسے *نفسیات آج *میں حوالہ دیا گیا ہے ، یہ ظاہر کرتا ہے کہ مادیت پسندی کم زندگی کے اطمینان کے ساتھ منسلک ہوتی ہے ، اور قرآنی انتباہ کی بازگشت کرتے ہیں کہ اس طرح کے تعاقب سے روح کو \"خالی\" (104: 4) چھوڑ دیا جاتا ہے۔ فلسفیانہ طور پر ، ڈاکٹر رضا شاہ کازیمی جیسے مفکرین اس آیت کو مادی اور روحانی معیشتوں کو متوازن کرنے کے مطالبے کے طور پر تیار کرتے ہیں ، اور مسلمانوں پر زور دیتے ہیں کہ وہ جمع ہونے سے معاشرتی فلاح و بہبود میں توانائی کو ری ڈائریکٹ کریں۔  \n\nعالمی سطح پر ، یہ آیت آب و ہوا کی تبدیلی (حد سے زیادہ کاموں سے چلنے والے) اور وسیع و عریض دولت کے فرق جیسے بحرانوں سے بات کرتی ہے ، جہاں دنیا کے تقریبا half نصف اثاثوں کے سب سے اوپر 1 ٪ کے مالک ہیں۔ انٹرفیتھ کے متوازی یہاں سامنے آتے ہیں: پوپ فرانسس کی \"خارج ہونے والی معیشت\" اور لاتعلقی سے متعلق بدھ مت کی تعلیمات کے تنقید اور دولت کے خلاف قرآن کی احتیاط کا آئینہ دار ہیں۔ کثیر الثقافتی سرگرمی ، جیسے عالمگیر بنیادی انکم ٹرائلز یا اخلاقی بینکاری تحریکیں ، آیت کے بنیادی پیغام کے ساتھ منسلک ہیں: حقیقی سلامتی سجا دیئے ہوئے دولت میں نہیں ہے بلکہ مشترکہ خوشحالی اور الہی فراہمی میں اعتماد میں ہے۔  \n\nخلاصہ یہ ہے کہ یہ آیت لالچ کے لئے انسانی کمزوری کا ایک لازوال نقاد بنی ہوئی ہے ، اور معاشروں پر زور دیتا ہے کہ وہ مساوات اور منافع سے زیادہ مقصد کو ترجیح دے۔",
    "layer4_urdu": "اس آیت میں مادی جمع ہونے کے ذریعہ استعمال ہونے والوں کی مذمت کی گئی ہے ، ایک روحانی بیماری جو اہل بیت (ع) کو الہی سچائی کو تسلیم کرنے میں رکاوٹ کے طور پر شناخت کیا گیا ہے۔ امام علی (ع) نے خبردار کیا ، * \"لالچی ہمیشہ غربت میں ہے ، یہاں تک کہ اگر وہ دنیا کے خزانوں کا مالک ہے\" * (گھورار الحکام)۔ یہ \"غربت\" مالی نہیں بلکہ ابدی مقصد کے لئے روح کی بھوک ہے۔ \"دولت کی گنتی\" کا عمل عارضی املاک سے جنونی لگاؤ کی عکاسی کرتا ہے ، اور اس حقیقت کو اندھا کرتا ہے کہ عقیدت اور خدمت کے ذریعہ اس کے بعد کی تیاری میں حقیقی قدر ہے۔  \n\nلیڈی فاطمہ (ع) نے ، اپنے مشہور خطبہ میں ، اعلان کیا ، * \"اللہ نے آپ کے پاکیزہ کو مشاورت سے پاک کیا ، اور دعا کو تکبر کو دور کرنے کا ایک ذریعہ بنایا\" * (بہار الانور)۔ یہاں ، دل کی \"کثیر الجہتی\" اللہ کی یاد سے دولت کو ترجیح دینے کے طور پر ظاہر ہوتی ہے۔ اس آیت کی مذمت کرنے والا فرد دنیاوی میٹرکس کے ذریعہ غلام بنائے ہوئے روح کو مجسم بناتا ہے ، جس میں امامہ کی زندگی کو راستبازی سے ماپنے کی پکار کو نظرانداز کیا جاتا ہے ، دولت نہیں۔ امام صادق (ع) نے سکھایا ، * \"اس دنیا کی محبت ہر گناہ کی جڑ ہے\" * (الکافی) ، اس بات پر زور دیتے ہوئے کہ مادی جنون کو بدعنوانی سے ویلیح سے بدعنوانی کر دیتا ہے۔  \n\nعملی طور پر ، اہل بیت (ع) مومنین سے درخواست کرتے ہیں کہ وہ دولت کو روحانی نشوونما کے ایک آلے میں تبدیل کریں: روح کو پاک کرنے ، مظلوموں کی حمایت کرنے ، اور فنڈ کے کاموں کو جو اماموں کے پیغام کو برقرار رکھنے کے لئے خیرات دیں۔ * \"hasbunallahu wa ni’mal Wakel\" * کی باقاعدہ تلاوت (اللہ ہمیں کافی ہے ، اور وہ معاملات کا بہترین ڈسپوزر ہے) مادی سلامتی پر انحصار کو ختم کرتا ہے۔ سچ ہے \"گنتی\" قیعیمہ پر انصاف کے ترازو کی روشنی میں اعمال کا روزانہ آڈٹ ہے ، یہ تصور امام زین الیبدین (ع) نے ڈو ابو حمزہ تھومالی میں طلب کیا ہے: * \"مجھے اس چیز سے مطمئن کریں ، اور مجھے اس وقت سے التجا نہ کریں جب آپ کو یہ خوشی نہیں ملتی ہے۔\"",
    "layer5": "In interpreting Surah al-Humaza 104:2, both Shia and Sunni scholarly traditions converge on its core ethical message condemning obsessive materialism. Al-Tabari (Sunni) and al-Tabrisi (Shia) alike contextualize the verse as a rebuke of pre-Islamic Meccan elites who hoarded wealth while ridiculing marginalized groups, with al-Qummi (Shia) and Ibn Kathir (Sunni) emphasizing the psychological corruption of valuing material accumulation over spiritual growth. The consensus across traditions identifies the \"counting\" of wealth as symbolic of misplaced priorities that neglect divine obligations.  \n\nDivergences emerge in theological emphasis. Sunni exegetes like al-Qurtubi and al-Razi focus on individual eschatological consequences, interpreting the verse through prophetic hadith about wealth \"burning\" its owner in the hereafter unless purified through zakat. Shia commentaries, particularly in al-Tabtabai’s *Al-Mizan*, extend the critique to systemic injustice, framing wealth hoarding as antithetical to the Ahl al-Bayt’s teachings on equitable distribution. Al-Tusi’s *Al-Tibyan* connects the verse to Imam Ali’s condemnation of economic exploitation, reflecting Shia emphasis on social ethics as an extension of Imamah theology.  \n\nThese differences stem from distinct historical engagements: Sunni interpretations developed alongside early debates about personal piety under caliphal rule, while Shia readings evolved through counter-cultural resistance to perceived economic oppression. Both traditions, however, reinforce parallel practices—Sunni emphasis on zakat compliance and Shia focus on khums as redistributive mechanisms—demonstrating shared ethical concerns despite differing conceptual frameworks. The verse thus serves as a unifying moral admonition while accommodating distinct jurisprudential applications rooted in each tradition’s historical experience.",
    "layer5_urdu": "سورہ الحومازا 104: 2 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی علمی روایات دونوں ہی جنونی مادیت پرستی کی مذمت کرتے ہوئے اس کے بنیادی اخلاقی پیغام پر مل جاتی ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) ایک جیسے اسلامی میکن کے اشرافیہ کی سرزنش کے طور پر اس آیت کو سیاق و سباق دیتے ہیں جنہوں نے دولت کا مذاق اڑایا جبکہ پسماندگی والے گروہوں کا مذاق اڑایا ، جس میں الکوومی (شیعہ) اور ابن کتھیر (سنی) کے ساتھ روحانی طور پر مادی جمع کرنے کی قدر کی گئی ہے۔ روایات میں اتفاق رائے دولت کی \"گنتی\" کو غلط فہمیوں کی علامت قرار دیتا ہے جو خدائی ذمہ داریوں کو نظرانداز کرتے ہیں۔  \n\nمذہبی زور سے تغیرات ابھرتے ہیں۔ سنی استثنیٰ جیسے القورووبی اور الراجی انفرادی اسکیٹولوجیکل نتائج پر توجہ مرکوز کرتے ہیں ، اور اس آیت کی پیشن گوئی کے ذریعہ دولت کے بارے میں پیشن گوئی کرتے ہیں جب تک کہ اس کے مالک کو اس کے مالک کو \"جلا\" جاتا ہے جب تک کہ زکوٰیت کے ذریعے پاک نہ ہو۔ شیعہ کی تفسیر ، خاص طور پر التبٹابائی کے *المزان *میں ، تنقید کو نظامی ناانصافی کی طرف بڑھا دیتے ہیں ، اور مساوی تقسیم سے متعلق اے ایچ ایل البیٹ کی تعلیمات کے خلاف دولت کے ذخیرہ اندوزی کو تیار کرتے ہیں۔ التوسی کا * التیبیان * آیت کو امام علی کی معاشی استحصال کی مذمت سے جوڑتا ہے ، جو اممہ الہیات کی توسیع کے طور پر معاشرتی اخلاقیات پر شیعہ کے زور کی عکاسی کرتا ہے۔  \n\nیہ اختلافات الگ الگ تاریخی مشغولیت سے پیدا ہوتے ہیں: خلافت کے حکمرانی کے تحت ذاتی تقویٰ کے بارے میں ابتدائی بحث و مباحثے کے ساتھ ساتھ سنی تشریحات تیار کی گئیں ، جبکہ شیعہ ریڈنگس معاشی جبر کے خلاف انسداد ثقافتی مزاحمت کے ذریعہ تیار ہوئی۔ تاہم ، دونوں روایات متوازی طریقوں کو تقویت بخشتی ہیں - زکوٰیت کی تعمیل اور شیعہ پر سونی زور کو خیموں پر دوبارہ تقسیم کرنے والے میکانزم کی حیثیت سے توجہ مرکوز کرتے ہیں۔ اس طرح یہ آیت ایک یکجہتی اخلاقی نصیحت کے طور پر کام کرتی ہے جبکہ ہر روایت کے تاریخی تجربے میں جڑی ہوئی الگ الگ فقہی ایپلی کیشنز کو ایڈجسٹ کرتی ہے۔",
    "summary": "In classical Shia exegesis, Surah al-Humazah 104:2 is interpreted as a profound condemnation of materialism and the spiritual corruption arising from obsessive attachment to worldly wealth. Surah al-Humazah, revealed in Mecca, condemns those consumed by materialism and arrogance. Verse 2 – *\"alladhi jama'a malan wa 'addadahu\"* – criticizes the obsessive accumulation and constant counting of wealth. The term *jama'a* (to gather/hoard) implies a compulsive collecting of *mal* (wealth or possessions), while *'addadahu* (counting it repeatedly) highlights a preoccupation with worldly status. Imam Ali (as) warns, *\"The greedy is in perpetual poverty, even if he possesses the world’s treasures\"* (Ghurar al-Hikam). By balancing halal efforts with gratitude and generosity, Muslims can avoid the spiritual ruin warned in this verse, aligning their hearts with the eternal rewards of the Hereafter.",
    "layer2short": "In classical Shia exegesis, Surah al-Humazah 104:2 is interpreted as a profound condemnation of materialism and the spiritual corruption arising from obsessive attachment to worldly wealth. The verse’s focus on one who \"collects wealth and [continuously] counts it\" is understood not merely as a critique of greed but as a reflection of a diseased heart (qalbun marīḍ) that substitutes transient possessions for eternal truths. Al-Tabrisi in *Majma al-Bayan* emphasizes the psychological dimension: the act of \"counting\" (ʿaddada) signifies a preoccupation with accumulation as an end in itself, reflecting arrogance (istikbār) and a delusion of permanence. This aligns with Imam Ali’s teachings in *Nahj al-Balagha*, where he warns that wealth becomes a \"trial\" (fitnah) when it distracts from accountability before Allah.",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الحومازاہ 104: 2 کو مادیت کی گہری مذمت اور دنیاوی دولت سے جنونی وابستگی سے پیدا ہونے والی روحانی بدعنوانی کی ترجمانی کی گئی ہے۔ اس آیت کی توجہ اس پر مرکوز ہے جو \"دولت جمع کرتا ہے اور [مستقل طور پر] اس کا شمار کرتا ہے\" صرف لالچ کے نقاد کے طور پر نہیں بلکہ ایک بیمار دل (قلون مار īḍ) کی عکاسی کے طور پر سمجھا جاتا ہے جو ابدی سچائیوں کے لئے عارضی مال کو متبادل بناتا ہے۔ * ماجما البیان * میں الاتبریسی نفسیاتی جہت پر زور دیتے ہیں: \"گنتی\" (الدادا) کا عمل اپنے آپ میں ایک اختتام کے ساتھ ایک مشغولیت کی نشاندہی کرتا ہے ، جس میں تکبر (استکیبر) اور استحکام کی ایک فریب کی عکاسی ہوتی ہے۔ یہ *ناہج البالاگھا *میں امام علی کی تعلیمات سے ہم آہنگ ہے ، جہاں وہ متنبہ کرتا ہے کہ جب یہ اللہ کے سامنے احتساب سے ہٹ جاتا ہے تو دولت \"آزمائشی\" (فٹنہ) بن جاتی ہے۔"
  },
  "3": {
    "layer1": "In Surah Al-Humaza, verse 3, Allah condemns the arrogance of those who believe their wealth grants them eternal security: *\"Yaḥsabu anna mālahū akhladah\"* (He thinks that his wealth will make him immortal). This verse targets the mindset of individuals—often the wealthy elites of Mecca—who equated material abundance with invincibility, imagining their riches could shield them from death or divine accountability. The term *maal* (wealth) here symbolizes not just money but all temporal power and status that distract humans from their spiritual purpose. The verb *akhlada* (to immortalize) underscores the delusion of permanence in a world defined by impermanence.  \n\nHistorical accounts, including Shia tafsir by scholars like Allama Tabatabai, link this verse to figures like Walid ibn Mughira, a wealthy Meccan who mocked the Prophet Muhammad (peace be upon him) and the marginalized believers. The surah rebukes such arrogance, reminding humanity that wealth cannot delay death or divine judgment. The Ahlul Bayt, particularly Imam Ali, emphasized that true honor lies in piety and service, not material accumulation. Imam Ali’s famous saying, “Wealth is the companion of greed,” echoes this Quranic warning.  \n\nToday, this verse challenges Muslims to examine their relationship with wealth. In an age of consumerism and inequality, it warns against the illusion that financial success guarantees happiness or status. The “immortality” sought through materialism is a mirage; true security lies in good deeds, humility, and reliance on Allah. Practically, this means using wealth ethically—supporting those in need, avoiding extravagance, and investing in the hereafter through acts like charity (sadaqah) and community upliftment. The verse calls believers to align their priorities with the eternal, as taught by the Ahlul Bayt: wealth is a test, not a triumph, and its value lies only in how it serves Allah’s creation.",
    "layer2": "In classical Shia exegesis, Surah al-Humazah 104:3 is understood as a profound critique of materialistic delusion and spiritual blindness. The verse’s declaration, “He thinks that his wealth will make him immortal,” is interpreted by scholars as exposing a fundamental error in human perception: the belief that worldly accumulation grants permanence or divine favor. Allama Tabatabai, in *Al-Mizan*, emphasizes that this verse targets the *ghurur* (self-deception) of those who conflate material success with eternal security, noting that such individuals mistake transient possessions for a shield against divine accountability. He links this to the Quranic principle that true immortality lies solely in proximity to Allah, attainable through piety and adherence to the *Ma’rifah* (divine recognition) taught by the Ahlul Bayt.\n\nShaykh Tabrisi, in *Majma al-Bayan*, highlights the linguistic nuance of *yahsab* (“he thinks”), underscoring the cognitive fallacy of equating wealth with existential permanence. He cites narrations from Imam Jafar al-Sadiq (as) explaining that wealth, when divorced from gratitude and ethical responsibility, becomes a catalyst for arrogance and moral decay, distancing one from the *Sirat al-Mustaqim* (Straight Path). This aligns with the Shia theological emphasis on *tawhid al-af’al* (unity of divine agency), wherein all sustenance and loss derive from Allah’s will, rendering human arrogance over possessions inherently irrational.\n\nThe verse also resonates with Shia jurisprudence’s focus on *zakat* and *khums* as mechanisms to purify wealth and redirect it toward communal welfare, reflecting the Imams’ teachings that material blessings are trusts (*amana*) to be managed in service of divine justice. Classical commentators thus frame the verse as a warning against the spiritual peril of materialism, urging believers to seek immortality through devotion to Allah and allegiance to the Ahlul Bayt, the true inheritors of prophetic guidance.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Humazah’s third verse is often framed as a critique of materialism’s psychological and societal illusions. Ayatollah Naser Makarem Shirazi, in his *Tafsir-e Namuneh*, emphasizes that the verse exposes humanity’s recurring delusion: equating wealth with existential permanence. Modern scholars like Sayyid Kamal al-Haydari extend this analysis, arguing that the verse speaks to today’s hyper-capitalist societies where wealth accumulation is valorized as a form of “immortality” through legacy-building, corporate empires, or digital footprints. This aligns with psychological studies on “affluenza” – the compulsive pursuit of wealth linked to anxiety and emptiness – illustrating how materialism fails to address the human yearning for transcendence.  \n\nSocially, the verse resonates with critiques of income inequality and climate injustice. Scholars like Dr. Liyakat Takim highlight how hoarding wealth – whether by individuals or nations – exacerbates global disparities and ecological harm, contrasting sharply with Shia ethics of *zakat* (charity) and stewardship of Earth’s resources. Philosophically, the verse challenges modern secular narratives that reduce human worth to economic productivity, urging a return to the Quranic vision of purpose rooted in moral and spiritual growth.  \n\nInterfaith dialogues amplify this message: Buddhist teachings on detachment, Christian critiques of greed (e.g., Pope Francis’ *Laudato Si’*), and secular humanist warnings about consumerism all echo Al-Humazah’s timeless wisdom. In an era of pandemics and climate crises, the verse becomes a call to reorient values – not toward fleeting material security but collective resilience and ethical interdependence. As contemporary Shia thinker Sayed Moustafa al-Qazwini notes, “Wealth is a test, not a trophy; its value lies in how it serves humanity, not how it inflates the self.",
    "layer4": "The verse \"He thinks that his wealth will make him immortal\" (104:3) pierces the veil of humanity’s greatest illusion: the delusion that worldly possessions grant eternal security. The Ahlul Bayt (as) taught that this verse exposes the spiritual blindness of those who prioritize material accumulation over divine consciousness. Imam Ali (as) warns in *Nahj al-Balagha*: \"The world is a place of passage, not a home of permanence. How can one rejoice in what is fleeting, or rely on what is doomed to perish?\" Wealth, in this context, symbolizes not just money but all temporal attachments that distract from the ultimate reality of return to Allah.\n\nThe Sixth Imam, Ja’far al-Sadiq (as), explains that such individuals \"worship wealth as their god\" by making it the axis of their hopes and fears. This aligns with the Shia understanding of *Wilayah* – true immortality lies not in worldly status but in aligning one’s soul with the eternal guardianship of the Ahlul Bayt (as), the inheritors of divine wisdom. Lady Fatimah (as) exemplified this when she declared: \"The provision of Allah is better than what you seek to accumulate,\" surrendering her worldly rights for the pleasure of the Divine.\n\nPractical guidance emerges through the Imams’ teachings: wealth becomes a spiritual poison only when divorced from gratitude and service. The Prophet (saw) taught: \"The son of Adam says, ‘My wealth! My wealth!’ But do you possess anything except what you consume, wear out, or give in charity?\" (reported in Shia sources). To transcend the delusion in this verse, believers must use wealth as Imam Hasan (as) did – feeding the poor, freeing slaves, and building bridges to the hereafter. True immortality is achieved through nurturing the soul with remembrance of Allah, adherence to the Imams’ guidance, and investing in deeds that outlive our fleeting worldly existence. As Imam Zayn al-Abidin (as) prays in *Sahifa Sajjadiyya*: \"Make me content with what sustains my soul, not what destroys it.",
    "layer1_urdu": "سورت الحومازا میں ، آیت 3 ، اللہ ان لوگوں کے تکبر کی مذمت کرتا ہے جو ان کی دولت پر یقین رکھتے ہیں ان کو ابدی سلامتی کی منظوری دیتی ہے: * \"یاسابو انا میلہ اخلاغہ\" * (وہ سوچتا ہے کہ اس کی دولت اسے لافانی بنا دے گی)۔ یہ آیت افراد کی ذہنیت کو نشانہ بناتی ہے - اکثر مکہ مکرمہ کے دولت مند اشرافیہ - جو ناقابل تسخیر کے ساتھ مساوی مادی کثرت کا تصور کرتے ہیں ، ان کی دولت کا تصور کرنا انھیں موت یا خدائی احتساب سے بچا سکتا ہے۔ یہاں کی اصطلاح * مال * (دولت) نہ صرف پیسہ بلکہ تمام دنیاوی طاقت اور حیثیت کی علامت ہے جو انسانوں کو ان کے روحانی مقصد سے دور کرتی ہے۔ فعل * اخلاڈا * (لافانی بنانے کے لئے) عدم استحکام کی طرف سے بیان کردہ دنیا میں استحکام کے فریب کی نشاندہی کرتا ہے۔  \n\nعلامہ تبتابائی جیسے اسکالرز کے ذریعہ شیعہ طافسیر سمیت تاریخی اکاؤنٹس ، اس آیت کو ولید ابن مغرو جیسی شخصیات سے جوڑتے ہیں ، ایک دولت مند میکن جس نے حضرت محمد صلی اللہ علیہ وسلم کا مذاق اڑایا تھا (اس پر امن) اور پسماندہ مومنین۔ سورت نے اس طرح کے تکبر کو سرزنش کی ، اور انسانیت کو یاد دلاتے ہوئے کہ دولت موت یا خدائی فیصلے میں تاخیر نہیں کرسکتی ہے۔ اہل بیت ، خاص طور پر امام علی نے اس بات پر زور دیا کہ حقیقی اعزاز تقویٰ اور خدمت میں ہے ، مادی جمع نہیں۔ امام علی کی مشہور کہاوت ، \"دولت لالچ کا ساتھی ہے ،\" اس قرآنی انتباہ کی بازگشت ہے۔  \n\nآج ، یہ آیت مسلمانوں کو چیلنج کرتی ہے کہ وہ دولت کے ساتھ ان کے تعلقات کا جائزہ لیں۔ صارفیت اور عدم مساوات کے دور میں ، یہ وہم کے خلاف متنبہ کرتا ہے کہ مالی کامیابی خوشی یا حیثیت کی ضمانت دیتی ہے۔ مادیت پرستی کے ذریعہ طلب کردہ \"لافانی\" ایک سراب ہے۔ حقیقی سلامتی نیک اعمال ، عاجزی اور اللہ پر انحصار میں ہے۔ عملی طور پر ، اس کا مطلب اخلاقی طور پر دولت کا استعمال کرنا ہے۔ آیت میں مومنوں کو اپنی ترجیحات کو ابدی کے ساتھ سیدھ میں لانے کا مطالبہ کیا گیا ہے ، جیسا کہ اہل بیت نے سکھایا ہے: دولت ایک امتحان ہے ، فتح نہیں ہے ، اور اس کی قدر صرف اس بات میں ہے کہ یہ اللہ کی تخلیق کو کس طرح پیش کرتا ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الحومازاہ 104: 3 کو مادیت پسندانہ فریب اور روحانی اندھا پن کے گہرے نقاد کے طور پر سمجھا جاتا ہے۔ آیت کا اعلان ، \"وہ سمجھتا ہے کہ اس کی دولت اسے لافانی بنائے گی ،\" اسکالرز نے انسانی تاثر میں ایک بنیادی غلطی کو بے نقاب کرنے کی ترجمانی کی ہے: یہ عقیدہ کہ دنیاوی جمع ہونے سے استحکام یا خدائی احسان ہوتا ہے۔ الامہ تبتابائی ، *المزان *میں ، اس بات پر زور دیتے ہیں کہ یہ آیت ابدی سلامتی کے ساتھ مادی کامیابی کا مقابلہ کرنے والوں کو *گھورور *(خود دھوکہ دہی) کو نشانہ بناتی ہے ، اس بات کا ذکر کرتے ہوئے کہ ایسے افراد الہی احتساب کے خلاف ڈھال کے لئے عارضی املاک میں غلطی کرتے ہیں۔ وہ اس کو قرآنی اس اصول سے جوڑتا ہے کہ حقیقی لافانییت صرف اور صرف اللہ کے قربت میں ہے ، جو تقویت اور اس کے ذریعہ قابل ہے جو احلول بیت کے ذریعہ پڑھائی جانے والی * مآرفہ * (خدائی پہچان) پر عمل پیرا ہے۔\n\nشیاک تبریسی ، *ماجما البیان *میں ، *یحساب *(\"وہ سوچتے ہیں\") کی لسانی نوادرات کو اجاگر کرتے ہیں ، اور دولت کو وجودی استحکام کے ساتھ مساوی کرنے کی علمی غلطی کی نشاندہی کرتے ہیں۔ انہوں نے امام جعفر السادق (ع) کی طرف سے یہ بیان کرتے ہوئے بیان کیا کہ دولت ، جب شکرگزار اور اخلاقی ذمہ داری سے طلاق لی جاتی ہے تو ، تکبر اور اخلاقی کشی کے لئے ایک اتپریرک بن جاتا ہے ، اور کسی کو * سیرت المستقیم * (سیدھے راستے) سے دور کرتا ہے۔ یہ شیعہ مذہبی زور کے ساتھ * توحید الافال * (الہی ایجنسی کا اتحاد) پر ہم آہنگ ہے ، جس میں تمام رزق اور نقصان اللہ کی مرضی سے حاصل ہوتا ہے ، اور اس میں فطری طور پر غیر منطقی طور پر غیر منقولہ ملکوں پر انسانی تکبر کا سامنا کرنا پڑتا ہے۔\n\nیہ آیت شیعہ فقیہ کی توجہ*زکاط*اور*خمس*پر بھی گونجتی ہے جس میں دولت کو پاک کرنے اور فرقہ وارانہ فلاح و بہبود کی طرف ری ڈائریکٹ کرنے کے طریقہ کار کے طور پر ، اماموں کی تعلیمات کی عکاسی ہوتی ہے کہ مادی برکتیں امانت ہیں (*امانا*) الہی انصاف کی خدمت میں انتظام کرنے کے لئے۔ اس طرح کلاسیکی مبصرین مادیت کے روحانی خطرہ کے خلاف انتباہ کے طور پر اس آیت کو تیار کرتے ہیں ، اور مومنین پر زور دیتے ہیں کہ وہ اللہ کی عقیدت کے ذریعہ لافانی طور پر تلاش کریں اور پیشن گوئی کی رہنمائی کے حقیقی وارث اہل بیت سے بیعت کریں۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ الحومازاہ کی تیسری آیت کو اکثر مادیت کے نفسیاتی اور معاشرتی فریب کاریوں کا نقاد قرار دیا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نام نامہ *میں اس بات پر زور دیا ہے کہ یہ آیت انسانیت کے بار بار چلنے والے فریب کو بے نقاب کرتی ہے: دولت کو وجودی استحکام کے ساتھ مساوی کرنا۔ سید کمال الحیداری جیسے جدید اسکالرز اس تجزیے میں توسیع کرتے ہیں ، اور یہ استدلال کرتے ہیں کہ آیت آج کے ہائپر سرمایہ دار معاشروں سے بات کرتی ہے جہاں دولت کو جمع کرنے ، کارپوریٹ سلطنتوں ، یا ڈیجیٹل نقشوں کے ذریعہ دولت کے جمع ہونے کی ایک شکل \"لافانی\" کی شکل کے طور پر کی جاتی ہے۔ یہ \"افلینزا\" پر نفسیاتی مطالعات کے ساتھ ہم آہنگ ہے - پریشانی اور خالی پن سے منسلک دولت کا مجبوری حصول - یہ واضح کرتا ہے کہ کس طرح مادیت پسندی کے لئے انسانی تڑپ کو دور کرنے میں ناکام ہوجاتی ہے۔  \n\nمعاشرتی طور پر ، آیت آمدنی میں عدم مساوات اور آب و ہوا کی ناانصافی کے نقادوں کے ساتھ گونجتی ہے۔ ڈاکٹر لییاکات تکیم جیسے اسکالرز اس بات پر روشنی ڈالتے ہیں کہ دولت ذخیرہ اندوزی - چاہے وہ افراد یا قوموں کے ذریعہ - عالمی تفاوت اور ماحولیاتی نقصان کو بڑھاوا دیتے ہیں ، جو * زکوٰٹ * (چیریٹی) کی شیعہ اخلاقیات اور زمین کے وسائل کی نگرانی کے ساتھ تیزی سے متضاد ہیں۔ فلسفیانہ طور پر ، آیت جدید سیکولر بیانیے کو چیلنج کرتی ہے جو معاشی پیداوری میں انسانی مالیت کو کم کرتی ہے ، اور اخلاقی اور روحانی نشوونما میں جڑے ہوئے مقصد کے قرآنی وژن کی طرف واپسی پر زور دیتی ہے۔  \n\nبین المذاہب مکالمے اس پیغام کو بڑھاوا دیتے ہیں: لاتعلقی سے متعلق بدھ مت کی تعلیمات ، لالچ کے عیسائی تنقید (جیسے ، پوپ فرانسس ’ *لاؤڈاٹو سی’ *) ، اور صارفیت کے بارے میں سیکولر ہیومنسٹ انتباہات تمام گونج الحومازاہ کی لازوال حکمت۔ وبائی امراض اور آب و ہوا کے بحرانوں کے دور میں ، آیت کو دوبارہ سے متعلق اقدار کی کال بن جاتی ہے - نہ کہ مادی تحفظ کی حفاظت کی طرف نہیں بلکہ اجتماعی لچک اور اخلاقی باہمی انحصار۔ جیسا کہ ہم عصر حاضر کے شیعہ مفکر سید نے موستافا القازوینی نے نوٹ کیا ، \"دولت ایک امتحان ہے ، ٹرافی نہیں۔",
    "layer4_urdu": "آیت \"وہ سوچتا ہے کہ اس کی دولت اسے لافانی بنا دے گی\" (104: 3) انسانیت کے سب سے بڑے وہم کے پردے کو چھید دیتا ہے: وہ فریب جو دنیاوی ملکیت میں ابدی سلامتی فراہم کرتا ہے۔ اہل بیت (ع) نے سکھایا کہ یہ آیت ان لوگوں کی روحانی اندھا پن کو بے نقاب کرتی ہے جو الہی شعور سے زیادہ مادی جمع کو ترجیح دیتے ہیں۔ امام علی (ع) نے *ناہج البالاگھا *میں متنبہ کیا ہے: \"دنیا گزرنے کی جگہ ہے ، مستقل مزاجی کا گھر نہیں ہے۔ کس طرح خوش ہو سکتا ہے جس سے بیڑہ مارا جاتا ہے ، یا اس پر انحصار کرسکتا ہے کہ ہلاک ہونے کے لئے برباد ہونے والی چیزوں پر کس طرح انحصار کیا جاسکتا ہے؟\" دولت ، اس تناظر میں ، نہ صرف پیسہ بلکہ تمام عارضی منسلکات کی علامت ہے جو اللہ کی واپسی کی حتمی حقیقت سے ہٹ جاتی ہے۔\n\nچھٹا امام ، جافر السادق (ع) ، وضاحت کرتا ہے کہ ایسے افراد اپنی امیدوں اور خوفوں کا محور بنا کر \"اپنے خدا کی حیثیت سے دولت کی پوجا کرتے ہیں\"۔ یہ * ولیہ * کی شیعہ کی تفہیم کے ساتھ ہم آہنگ ہے - حقیقی امریت دنیاوی حیثیت میں نہیں ہے بلکہ ایک کی روح کو احلول بیت (ع) کی ابدی سرپرستی کے ساتھ صف بندی کرنے میں ہے ، جو الہی حکمت کے وارث ہیں۔ لیڈی فاطمہ (ع) نے اس کی مثال دی جب انہوں نے اعلان کیا: \"اللہ کی فراہمی آپ کے جمع کرنے کی کوشش سے بہتر ہے ،\" الہی کی خوشنودی کے ل her اس کے دنیاوی حقوق کے حوالے کرتے ہیں۔\n\nعملی رہنمائی اماموں کی تعلیمات کے ذریعہ ابھرتی ہے: دولت صرف اس وقت روحانی زہر بن جاتی ہے جب شکرگزار اور خدمت سے طلاق ہو۔ نبی صلی اللہ علیہ وسلم نے سکھایا: \"آدم کا بیٹا کہتا ہے ،‘ میری دولت! میری دولت! ’لیکن کیا آپ کے پاس اس کے سوا کچھ ہے جو آپ کھاتے ہیں ، پہنتے ہیں ، یا خیرات دیتے ہیں؟\" (شیعہ ذرائع میں اطلاع دی گئی)۔ اس آیت میں فریب کو عبور کرنے کے لئے ، مومنین کو دولت کو استعمال کرنا چاہئے جیسا کہ امام حسن (ع) نے کیا - غریبوں کو کھانا کھلانا ، غلاموں کو آزاد کرنا ، اور اس کے بعد پل پلس بنانا۔ حقیقی لافانییت اللہ کی یاد کے ساتھ روح کی پرورش ، اماموں کی رہنمائی پر عمل پیرا ہونے ، اور ان اعمال میں سرمایہ کاری کے ذریعے حاصل کی جاتی ہے جو ہمارے دنیاوی وجود کو ختم کرتے ہیں۔ جیسا کہ امام زین العبدین (ع) *ساہفا سججدیہ *میں دعا کرتا ہے: \"مجھے اس بات سے مطمئن کریں کہ میری روح کو برقرار رکھتا ہے ، نہ کہ اس کو ختم کرتا ہے۔",
    "layer5": "In interpreting Surah Al-Humaza verse 3, Shia and Sunni scholars converge in viewing the verse as a critique of materialistic delusion. Both traditions, as reflected in Tabatabai’s *Al-Mizan* and Ibn Kathir’s *Tafsir*, emphasize that wealth cannot grant immortality or divine protection, condemning the arrogance of those who equate material accumulation with eternal security. Tabari and Tusi similarly contextualize the verse within Meccan society’s pre-Islamic elite, who mocked the Prophet and oppressed the vulnerable, illustrating a shared historical framework across traditions.\n\nDivergences emerge in theological emphasis. Shia commentaries like Tabrisi’s *Majma al-Bayan* and Qummi’s *Tafsir* often link the verse’s condemnation to broader themes of moral corruption among opponents of the Ahlul Bayt, interpreting the “wealth” metaphor as encompassing both material and political power misused to oppose divine guidance. This aligns with Shia theological narratives emphasizing the socio-spiritual consequences of rejecting rightful leadership (Imamate). Sunni exegetes such as Qurtubi and Razi, while acknowledging the moral lesson, focus more on individual accountability and eschatological consequences, framing the verse as a universal warning against pride and neglect of the afterlife.\n\nThese differences stem from distinct theological priorities: Shia interpretations frequently integrate historical conflicts over leadership into their exegesis, reflecting their emphasis on the Imams’ role in guiding ethical conduct. Sunni commentaries prioritize individual piety and divine justice without explicit political references. Both traditions reinforce ethical imperatives—detachment from materialism and charitable responsibility—though Shia practice may additionally stress loyalty to the Imams as a safeguard against spiritual corruption. Such variations illustrate how historical experiences and doctrinal frameworks shape textual engagement while maintaining shared ethical foundations.",
    "layer5_urdu": "سورہ الحومازا آیت 3 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی اسکالرز اس آیت کو مادیت پسندانہ فریب کے نقاد کے طور پر دیکھنے میں ملتے ہیں۔ دونوں روایات ، جیسا کہ تبتابائی کے *المزان *اور ابن کتھیر کے *طافسر *میں ظاہر ہوتا ہے ، اس بات پر زور دیتے ہیں کہ دولت ابدی سلامتی کے ساتھ مادی جمع کو مساوی کرنے والوں کے تکبر کی مذمت کرتے ہوئے لازوال یا خدائی تحفظ فراہم نہیں کرسکتی ہے۔ تباری اور توسی اسی طرح میکن سوسائٹی کے اسلام سے قبل کے اشرافیہ کے اندر موجود آیت کو سیاق و سباق میں لاتے ہیں ، جس نے نبی of کا مذاق اڑایا اور روایات کے ایک مشترکہ تاریخی فریم ورک کی مثال پیش کرتے ہوئے کمزوروں پر ظلم کیا۔\n\nمذہبی زور سے تغیرات ابھرتے ہیں۔ شیعہ تبصرے جیسے تبریسی کے * مجسما البیان * اور قمی کے * طافیر * اکثر آیت کی مذمت کو اہل بیت کے مخالفین میں اخلاقی بدعنوانی کے وسیع تر موضوعات سے جوڑ دیتے ہیں ، اور \"دولت\" استعارے کی ترجمانی کرتے ہوئے مادی اور سیاسی طاقت دونوں کو شامل کرتے ہوئے الہی رہنمائی کے لئے غلط استعمال کرتے ہیں۔ یہ شیعہ مذہبی بیانیہ کے ساتھ صف بندی کرتا ہے جس میں صحیح قیادت (امامیٹ) کو مسترد کرنے کے سماجی و سمن نتائج پر زور دیا جاتا ہے۔ اخلاقی سبق کو تسلیم کرتے ہوئے ، سنی کی منظوری جیسے کہ قربانی اور رازی ، انفرادی احتساب اور اسکاٹولوجیکل نتائج پر زیادہ توجہ مرکوز کرتے ہیں ، اور اس آیت کو بعد کی زندگی کے فخر اور نظرانداز کے خلاف آفاقی انتباہ کے طور پر تیار کرتے ہیں۔\n\nیہ اختلافات الگ الگ مذہبی ترجیحات سے پیدا ہوتے ہیں: شیعہ تشریحات قیادت کے بارے میں تاریخی تنازعات کو اپنی اصلاح میں کثرت سے مربوط کرتی ہیں ، جو اخلاقی طرز عمل کی رہنمائی میں اماموں کے کردار پر ان کے زور کی عکاسی کرتی ہیں۔ سنی تبصرے واضح سیاسی حوالوں کے بغیر انفرادی تقویٰ اور خدائی انصاف کو ترجیح دیتے ہیں۔ دونوں روایات اخلاقی لازمی کو تقویت دیتی ہیں۔ اس طرح کی تغیرات اس بات کی وضاحت کرتی ہیں کہ مشترکہ اخلاقی بنیادوں کو برقرار رکھتے ہوئے تاریخی تجربات اور نظریاتی فریم ورک متنی مشغولیت کو کس طرح تشکیل دیتے ہیں۔",
    "summary": "Allama Tabatabai in Tafsir al-Mizan explains that this verse targets the *ghurur* (self-deception) of those who conflate material success with eternal security, noting that such individuals mistake transient possessions for a shield against divine accountability. In Surah Al-Humaza, verse 3, Allah condemns the arrogance of those who believe their wealth grants them eternal security: *\"Yaḥsabu anna mālahū akhladah\"* (He thinks that his wealth will make him immortal). This verse targets the mindset of individuals—often the wealthy elites of Mecca—who equated material abundance with invincibility, imagining their riches could shield them from death or divine accountability. The term *maal* (wealth) here symbolizes not just money but all temporal power and status that distract humans from their spiritual purpose. Imam Ali (as) warns in *Nahj al-Balagha*: \"The world is a place of passage, not a home of permanence. The verse calls believers to align their priorities with the eternal, as taught by the Ahlul Bayt: wealth is a test, not a triumph, and its value lies only in how it serves Allah’s creation.",
    "layer2short": "In classical Shia exegesis, Surah al-Humazah 104:3 is understood as a profound critique of materialistic delusion and spiritual blindness. The verse’s declaration, “He thinks that his wealth will make him immortal,” is interpreted by scholars as exposing a fundamental error in human perception: the belief that worldly accumulation grants permanence or divine favor. Allama Tabatabai, in *Al-Mizan*, emphasizes that this verse targets the *ghurur* (self-deception) of those who conflate material success with eternal security, noting that such individuals mistake transient possessions for a shield against divine accountability. He links this to the Quranic principle that true immortality lies solely in proximity to Allah, attainable through piety and adherence to the *Ma’rifah* (divine recognition) taught by the Ahlul Bayt.",
    "layer2short_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الحومازاہ 104: 3 کو مادیت پسندانہ فریب اور روحانی اندھا پن کے گہرے نقاد کے طور پر سمجھا جاتا ہے۔ آیت کا اعلان ، \"وہ سمجھتا ہے کہ اس کی دولت اسے لافانی بنائے گی ،\" اسکالرز نے انسانی تاثر میں ایک بنیادی غلطی کو بے نقاب کرنے کی ترجمانی کی ہے: یہ عقیدہ کہ دنیاوی جمع ہونے سے استحکام یا خدائی احسان ہوتا ہے۔ الامہ تبتابائی ، *المزان *میں ، اس بات پر زور دیتے ہیں کہ یہ آیت ابدی سلامتی کے ساتھ مادی کامیابی کا مقابلہ کرنے والوں کو *گھورور *(خود دھوکہ دہی) کو نشانہ بناتی ہے ، اس بات کا ذکر کرتے ہوئے کہ ایسے افراد الہی احتساب کے خلاف ڈھال کے لئے عارضی املاک میں غلطی کرتے ہیں۔ وہ اس کو قرآنی اس اصول سے جوڑتا ہے کہ حقیقی لافانییت صرف اور صرف اللہ کے قربت میں ہے ، جو تقویت اور اس کے ذریعہ قابل ہے جو احلول بیت کے ذریعہ پڑھائی جانے والی * مآرفہ * (خدائی پہچان) پر عمل پیرا ہے۔"
  },
  "4": {
    "layer1": "In Surah Al-Humaza, verse 4, Allah declares: *\"Kalla layunbadhanna fil-hutamah\"* (No! He will surely be thrown into the Crusher). This powerful verse condemns those who mock others, spread slander, and obsess over material wealth while neglecting spiritual and ethical responsibilities. The term *\"hutamah\"* (the Crusher) is derived from the root *hatama*, meaning to shatter or grind completely. Classical Shia scholars like Allamah Tabatabai in *Tafsir al-Mizan* explain that *hutamah* represents a level of Hellfire so intense it crushes souls and possessions, symbolizing the annihilation of arrogance and worldly attachments. The verse’s emphatic structure (*layunbadhanna* uses the Arabic *la* of absolute negation and *nun* of emphasis) underscores the certainty of this punishment for those who harm others through speech or action.\n\nHistorically, this Meccan surah targeted wealthy Quraysh elites like Walid ibn Mughirah, who ridiculed the Prophet Muhammad (peace upon him) and oppressed early Muslims. Their mockery and hoarding of wealth reflected a toxic pride that Islam condemns. In modern contexts, this verse warns against backbiting, social media slander, and materialism that erode community bonds. It calls Muslims to guard their tongues, avoid belittling others, and use wealth responsibly—prioritizing charity over extravagance. Imam Ali (as) taught that true nobility lies in humility and service, not status or possessions. By reflecting on *hutamah*, believers are reminded to cultivate empathy, reject gossip, and align their lives with Quranic values of compassion and justice. The verse ultimately serves as a timeless reminder: our treatment of others directly shapes our eternal destiny.",
    "layer2": "In Surah al-Humazah, verse 4, the divine threat *\"No! He will surely be thrown into the Crusher\"* serves as a severe rebuke to those who mock others and hoard wealth arrogantly. Classical Shia exegetes, such as Sheikh Tabrisi in *Majma al-Bayan*, elucidate that *al-Hutamah* (the Crusher) is a name for Hell, derived from the root *hatm* (to break or crush), signifying a place that \"shatters the bones and reduces all to fragments\" as the ultimate consequence of moral corruption. This interpretation aligns with the broader Qur’anic motif of divine retribution being commensurate with human actions (*jaza' al-mithl*), a principle central to Shia theology’s emphasis on God’s perfect justice (*‘adl*).\n\nAllamah Tabatabai, in *Al-Mizan*, expands this by framing *al-Hutamah* as a metaphysical reality reflecting the disintegration of the soul’s false sense of autonomy. The verse, he argues, underscores the ontological collapse awaiting those whose arrogance and materialism sever their connection to divine truth. This aligns with the teachings of Imam Jafar al-Sadiq, who emphasized that spiritual diseases like backbiting (*ghiba*) and greed (*hirs*) corrode the soul’s capacity for transcendence, making it susceptible to eternal ruin. The \"crushing\" thus symbolizes both the physical torment and the existential humiliation of realizing one’s moral bankruptcy in the hereafter.\n\nShia jurisprudence further contextualizes this warning within its ethical framework, linking it to the prohibition of slander and economic exploitation. The Ahlul Bayt’s teachings, as recorded in sources like *Al-Kafi*, stress that such sins not only violate social ethics but also constitute a rebellion against the divine *wilayah* (guardianship), thereby meriting exclusion from divine mercy. The verse thus serves as a stark reminder of the inseparable link between ethical conduct, doctrinal fidelity, and eschatological accountability in Shia thought.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Humaza’s fourth verse is often contextualized as a stark warning against the moral and social consequences of arrogance, exploitation, and the dehumanization of others. Ayatollah Naser Makarem Shirazi, in his *Tafsir Nemuneh*, emphasizes that \"the Crusher\" (Al-Hutamah) symbolizes a divine reckoning for those who weaponize wealth, status, or power to oppress others—a theme resonating in modern discussions on economic inequality and systemic injustice. Scholars like Dr. Mohammad Ali Shomali, director of the International Institute for Islamic Studies, link the verse to contemporary issues such as corporate greed, environmental destruction, and digital harassment, framing \"crushing\" as both a spiritual and societal collapse caused by unchecked materialism and malice.\n\nModern scientific metaphors, such as black holes or entropy, are occasionally invoked to illustrate the verse’s imagery of irreversible destruction. Philosophically, the \"Crusher\" reflects the existential void faced by those who prioritize ego over empathy, a concept explored by thinkers like Frantz Fanon in critiques of dehumanization. Socially, the verse speaks to cyberbullying, misinformation campaigns, and exploitative capitalism—systems that \"crush\" human dignity. Interfaith parallels include Buddhist teachings on the karmic repercussions of harmful speech and Christian warnings against hoarding wealth (e.g., Luke 12:15-21). In multicultural societies, the verse challenges individuals and institutions to confront structures that marginalize vulnerable communities, urging a shift from self-centeredness to collective responsibility. As Sheikh Ahmed Haneef notes in *Contemporary Ethics in Shia Thought*, Al-Hutamah’s warning transcends time, reminding us that spiritual and social ruin are intertwined—a lesson critical for navigating today’s interconnected, yet fractured, world.",
    "layer4": "The verse’s stark warning, “He will surely be thrown into the Crusher,” unveils a profound spiritual reality about the consequences of arrogance, slander, and harming others—themes central to Surah al-Humaza. The Ahlul Bayt (peace be upon them) taught that *al-Hutamah* (the Crusher) is not merely a physical fire but a metaphysical state of utter disintegration, where the soul’s spiritual corruption is laid bare. Imam Ali (as) said, “The fire of this world is a spark of the greater Fire, and the crushing of the soul’s arrogance is the key to salvation.” Here, “crushing” refers to the annihilation of the ego’s tyranny, which blocks the light of divine guidance.  \n\nThe Sixth Imam, Ja’far al-Sadiq (as), explained in *Tafsir al-Qummi* that *al-Hutamah* is the “place where the *nafs* (lower self) is shattered by the weight of its own sins, particularly backbiting and mocking the believers.” This aligns with the Prophet Muhammad’s (pbuh) warning: “Whoever belittles a believer has belittled me, and whoever harms a believer has harmed Allah’s covenant.” The Crusher thus becomes the spiritual consequence of violating the sanctity of human dignity, a direct affront to the Wilayah (divine guardianship) of the Ahlul Bayt, who embody mercy and justice.  \n\nLady Fatimah (as), in her timeless sermon, emphasized that true faith is reflected in protecting others from harm: “The believer’s tongue is behind their heart; they speak only after contemplation.” To avoid *al-Hutamah*, one must purify the heart through self-accountability, seek forgiveness for harsh speech, and actively uphold the rights of others—core principles of Shia spirituality. The Imams taught that clinging to their teachings and embodying humility shields the soul from this crushing fate. Let us strive to “crush” our egos through daily repentance, charity, and love for the Ahlul Bayt, transforming the soul’s potential ruin into eternal proximity to the Divine.",
    "layer1_urdu": "سورہ الحومازا میں ، آیت 4 ، اللہ نے اعلان کیا: * \"کالا لیونبدھانا فل-ہوٹامہ\" * (نہیں! اسے یقینا the کولہو میں پھینک دیا جائے گا)۔ یہ طاقتور آیت ان لوگوں کی مذمت کرتی ہے جو دوسروں کا مذاق اڑاتے ہیں ، بہتان پھیلاتے ہیں ، اور روحانی اور اخلاقی ذمہ داریوں کو نظرانداز کرتے ہوئے مادی دولت پر جنون کرتے ہیں۔ اصطلاح *\"ہوٹامہ\" *(کولہو) جڑ *ہاتاما *سے اخذ کی گئی ہے ، جس کا مطلب ہے کہ بکھرنا یا مکمل طور پر پیسنا ہے۔ کلاسیکی شیعہ اسکالرز جیسے الامہ تبتابائی * ٹافسیر المزان * میں وضاحت کرتے ہیں کہ * ہوٹامہ * جہنم کی ایک سطح کی نمائندگی کرتا ہے تاکہ اس سے روحوں اور املاک کو کچل دیا جائے ، جو تکبر اور دنیاوی منسلکات کے فنا کی علامت ہے۔ آیت کا زور دار ڈھانچہ (* lateunbadhana* مطلق نفی کے عربی* لا* کا استعمال کرتا ہے اور* نون* زور دیتا ہے) تقریر یا عمل کے ذریعہ دوسروں کو نقصان پہنچانے والوں کے لئے اس سزا کی یقین دہانی کرتا ہے۔\n\nتاریخی طور پر ، اس مکہ سرہ نے ولید بن مغہرہ جیسے دولت مند قریش اشراف کو نشانہ بنایا ، جنہوں نے حضرت محمد صلی اللہ علیہ وآلہ وسلم کا مذاق اڑایا اور ابتدائی مسلمانوں پر ظلم کیا۔ ان کے مذاق اور دولت کے ذخیرے سے ایک زہریلا فخر کی عکاسی ہوتی ہے جس کی اسلام مذمت کرتا ہے۔ جدید سیاق و سباق میں ، یہ آیت بیک بٹینگ ، سوشل میڈیا پرستی اور مادیت کے خلاف متنبہ کرتی ہے جو کمیونٹی کے بندھن کو ختم کرتی ہے۔ اس نے مسلمانوں کو ان کی زبان کی حفاظت کرنے ، دوسروں کو گھٹا دینے سے بچنے ، اور ذمہ داری کے ساتھ دولت کا استعمال کرنے کا مطالبہ کیا ہے۔ امام علی (ع) نے سکھایا کہ حقیقی شرافت عاجزی اور خدمت میں ہے ، نہ کہ حیثیت یا مال۔ *ہوٹامہ *پر غور کرتے ہوئے ، مومنین کو ہمدردی پیدا کرنے ، گپ شپ کو مسترد کرنے ، اور اپنی زندگی کو ہمدردی اور انصاف کی قرآنی اقدار کے ساتھ ہم آہنگ کرنے کی یاد دلائی جاتی ہے۔ آیت بالآخر ایک لازوال یاد دہانی کا کام کرتی ہے: دوسروں کے ساتھ ہمارا سلوک براہ راست ہماری ابدی تقدیر کو شکل دیتا ہے۔",
    "layer2_urdu": "سورہ الحومازاہ میں ، آیت 4 ، خدائی خطرہ * \"نہیں! اسے یقینا the کولہو میں پھینک دیا جائے گا\" * دوسروں کا مذاق اڑانے والوں اور دولت کو تکبر سے جمع کرنے والوں کے لئے سخت سرزنش کا کام کرتا ہے۔ کلاسیکی شیعہ استثنیٰ ، جیسے شیخ تبریسی *ماجما البیان *میں ، یہ واضح کریں کہ *الحتامہ *(کروسر) جہنم کا نام ہے ، جو جڑ *ہپم *(توڑنے یا کچلنے کے لئے) سے ماخوذ ہے ، جس سے \"ہڈیوں کو ہلچل مچاتا ہے اور تمام ٹکڑوں کو کم کرتا ہے۔\" یہ تشریح الہی بدلہ لینے کے وسیع تر قرآنی شکل کے ساتھ ہم آہنگ ہے جو انسانی اعمال (*جازا 'المتھل*) کے مطابق ہے ، جو خدا کے کامل انصاف (*‘ADL*) پر شیعہ الہیات کے زور دینے کا ایک اصول ہے۔\n\n*المزان *میں الامہ تبتابائی ، اس کو *الہوتامہ *کو ایک استعاریاتی حقیقت کے طور پر بیان کرتے ہیں جو روح کی خودمختاری کے جھوٹے احساس کے تضاد کی عکاسی کرتے ہیں۔ اس کا استدلال ہے کہ آیت ، ان لوگوں کے منتظر آنٹولوجیکل خاتمے کی نشاندہی کرتی ہے جن کے تکبر اور مادیت پسندی نے ان کے الہی سچائی سے تعلق کو ختم کردیا ہے۔ اس سے امام جعفر السادق کی تعلیمات کے مطابق ہے ، جس نے اس بات پر زور دیا کہ روحانی بیماریوں جیسے بیک بٹینگ (*غیبہ*) اور لالچ (*ہرس*) سے ماورائی کے لئے روح کی صلاحیت کو کم کیا جاتا ہے ، جس سے یہ ابدی بربادی کا شکار ہوجاتا ہے۔ اس طرح \"کرشنگ\" جسمانی عذاب اور کسی کے اخلاقی دیوالیہ پن کو سمجھنے کی وجودی ذلت دونوں کی علامت ہے۔\n\nشیعہ فقہ اس انتباہ کو اپنے اخلاقی فریم ورک کے اندر مزید سیاق و سباق سے دوچار کرتا ہے ، اور اسے بہتان اور معاشی استحصال کی ممانعت سے جوڑتا ہے۔ اہل بیت کی تعلیمات ، جیسا کہ *الکافی *جیسے ذرائع میں درج ہیں ، اس بات پر زور دیتے ہیں کہ اس طرح کے گناہ نہ صرف معاشرتی اخلاقیات کی خلاف ورزی کرتے ہیں بلکہ الہی *ولیہ *(سرپرستی) کے خلاف بغاوت بھی کرتے ہیں ، اور اس طرح الہی رحمت سے خارج ہونے کی اہلیت رکھتے ہیں۔ اس طرح یہ آیت اخلاقی طرز عمل ، نظریاتی وفاداری ، اور شیعہ کے خیال میں اسکیٹولوجیکل احتساب کے مابین لازم و ملزوم روابط کی ایک یاد دہانی کا کام کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ الحومازا کی چوتھی آیت اکثر تکبر ، استحصال ، اور دوسروں کے غیر مہذب ہونے کے اخلاقی اور معاشرتی نتائج کے خلاف ایک واضح انتباہ کے طور پر سیاق و سباق کی جاتی ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں ، اس بات پر زور دیا ہے کہ \"کولہو\" (الہوتامہ) دولت ، حیثیت ، یا دوسروں پر ظلم کرنے کی طاقت کو ہتھیار ڈالنے والوں کے لئے ایک الہی حساب کی علامت ہے۔ بین الاقوامی انسٹی ٹیوٹ برائے اسلامی علوم کے ڈائریکٹر ، ڈاکٹر محمد علی شمالی جیسے اسکالرز ، آیت کو معاصر امور جیسے کارپوریٹ لالچ ، ماحولیاتی تباہی ، اور ڈیجیٹل ہراساں کرنے سے جوڑتے ہیں ، جس میں \"کچلنے\" کو غیر سنجیدہ مادیت اور بدکاری کی وجہ سے ایک روحانی اور معاشرتی تباہی کا سامنا کرنا پڑتا ہے۔\n\nجدید سائنسی استعاروں ، جیسے بلیک ہولز یا اینٹروپی ، کبھی کبھار ناقابل واپسی تباہی کی آیت کی منظر کشی کی مثال کے لئے طلب کیا جاتا ہے۔ فلسفیانہ طور پر ، \"کولہو\" ان لوگوں کو درپیش وجود کی عکاسی کرتا ہے جو ہمدردی سے زیادہ انا کو ترجیح دیتے ہیں ، یہ تصور فرینٹز فانون جیسے مفکرین کے ذریعہ دریافت کیا گیا ہے جس میں فرانٹز فینن نے غیر انسانیت کی تنقید کی ہے۔ معاشرتی طور پر ، آیت سائبر دھونس ، غلط معلومات کی مہموں ، اور استحصالی سرمایہ داری - ایسے نظاموں کی بات کرتی ہے جو انسانی وقار کو \"کچل دیتے ہیں\"۔ بین المذاہب متوازی میں مضر تقریر کے کرمک پرکسلوں پر بدھ مت کی تعلیمات اور ذخیرہ اندوزی کے خلاف عیسائی انتباہات شامل ہیں (جیسے ، لوقا 12: 15-21)۔ کثیر الثقافتی معاشروں میں ، آیت افراد اور اداروں کو چیلنج کرتی ہے کہ وہ ان ڈھانچے کا مقابلہ کریں جو کمزور برادریوں کو پسماندہ بناتے ہیں ، اور خود غرض سے اجتماعی ذمہ داری کی طرف منتقل ہونے پر زور دیتے ہیں۔ چونکہ شیخ احمد ہنیف نے شیعہ کے خیال میں *عصری اخلاقیات *میں نوٹ کیا ہے *، الہوتامہ کی انتباہ وقت سے تجاوز کرتی ہے ، اور ہمیں یاد دلاتی ہے کہ روحانی اور معاشرتی بربادی آپس میں جڑی ہوئی ہے۔ یہ سبق آج کے باہم مربوط ، پھر بھی ٹوٹ جانے والی دنیا کو نیویگیٹ کرنے کے لئے ایک سبق ہے۔",
    "layer4_urdu": "اس آیت کی سخت انتباہ ، \"اسے یقینا the کولہو میں پھینک دیا جائے گا ،\" تکبر ، بہتان اور دوسروں کو نقصان پہنچانے کے نتائج کے بارے میں ایک گہری روحانی حقیقت کی نقاب کشائی کرتی ہے۔ اہل بیت (ان پر امن ہے) نے یہ سکھایا کہ * الحتامہ * (کولہو) محض ایک جسمانی آگ نہیں بلکہ سراسر منتشر ہونے کی ایک استعاریاتی حالت ہے ، جہاں روح کی روحانی بدعنوانی کو ننگا کردیا گیا ہے۔ امام علی (ع) نے کہا ، \"اس دنیا کی آگ زیادہ سے زیادہ آگ کی ایک چنگاری ہے ، اور روح کے تکبر کو کچلنے سے نجات کی کلید ہے۔\" یہاں ، \"کرشنگ\" سے مراد انا کے ظلم کی فنا ہے ، جو الہی رہنمائی کی روشنی کو روکتا ہے۔  \n\nچھٹا امام ، جافر السادق (ع) ، نے * طافسیر القومی * میں سمجھایا کہ * الحتامہ * وہ جگہ ہے جہاں * نفز * (نچلے نفس) اپنے ہی گناہوں کے وزن سے بکھرے ہوئے ہیں ، خاص طور پر مومنین کو پیچھے چھوڑنے اور ان کا مذاق اڑاتے ہیں۔ \" اس سے حضرت محمد (صلی اللہ علیہ وآلہ وسلم) کے ساتھ مل کر انتباہ کیا جاتا ہے: \"جس نے کسی مومن کو پیٹ میں مبتلا کیا ہے ، اور جس نے کسی مومن کو نقصان پہنچایا ہے اس نے اللہ کے عہد کو نقصان پہنچایا ہے۔\" اس طرح کولہو انسانی وقار کے تقدس کی خلاف ورزی کا روحانی نتیجہ بن جاتا ہے ، جو اہل بیت کے ولیہ (خدائی سرپرستی) کا براہ راست مقابلہ ہے ، جو رحم اور انصاف کو مجسم بناتا ہے۔  \n\nلیڈی فاطمہ (ع) نے اپنے لازوال خطبہ میں اس بات پر زور دیا کہ حقیقی عقیدے دوسروں کو نقصان سے بچانے میں ظاہر ہوتا ہے: \"مومن کی زبان ان کے دل کے پیچھے ہے۔ وہ صرف غور و فکر کے بعد ہی بولتے ہیں۔\" *الحتامہ *سے بچنے کے ل one ، کسی کو خود محاسبیت کے ذریعہ دل کو پاک کرنا ، سخت تقریر کے لئے معافی مانگنے ، اور دوسروں کے حقوق کو فعال طور پر برقرار رکھنا چاہئے-شیعہ روحانیت کے بنیادی اصول۔ اماموں نے سکھایا کہ ان کی تعلیمات سے چمٹے رہنا اور عاجزی کو مجسم بنانا روح کو اس کرشنگ تقدیر سے بچاتا ہے۔ آئیے ہم روزانہ توبہ ، خیرات ، اور اہل بائٹ سے محبت کے ذریعہ اپنے اشخاص کو \"کچلنے\" کے لئے جدوجہد کرتے ہیں ، اور روح کے ممکنہ بربادی کو الہی سے ابدی قربت میں تبدیل کرتے ہیں۔",
    "layer5": "In interpreting Surah al-Humaza 104:4, both Shia and Sunni scholarly traditions converge on the foundational understanding that \"the Crusher\" (al-Hutamah) denotes a severe punishment in the afterlife for those who engage in slander, mockery, and malicious accumulation of wealth. Al-Tabari (Sunni) and al-Tabrisi (Shia) both cite prophetic hadiths describing al-Hutamah as a level of Hellfire that \"grinds bones and flesh,\" emphasizing divine retribution for violating social ethics. Ibn Kathir and al-Tusi similarly align in viewing the verse as a warning against arrogance and harming others’ dignity, rooted in the Quran’s broader moral framework.  \n\nDivergences emerge in theological emphasis. Sunni exegetes like al-Qurtubi and al-Razi focus on the literal manifestations of punishment, often linking it to specific sins like backbiting (ghiba) through legalistic lenses. In contrast, Shia commentaries such as al-Mizan by Tabatabai and al-Qummi’s tafsir integrate metaphysical dimensions, framing al-Hutamah as symbolic of the soul’s disintegration when severed from spiritual truth—a concept enriched by the Ahlul Bayt’s teachings on inner purification. This reflects the Shia emphasis on the interplay between outward actions and inward states, informed by the Imamah’s role as moral guides.  \n\nHistorically, these differences stem from distinct methodological priorities: Sunni tafsir often prioritizes transmitted narratives (riwaya) and juristic principles, while Shia exegesis (particularly post-occultation) increasingly incorporates intellectual (diraya) approaches intertwined with Imami theology. Practically, both traditions reinforce ethical conduct, but Shia interpretations may accentuate communal responsibility to uphold social justice as an extension of loyalty to the Imams, whereas Sunni applications might emphasize individual accountability before divine law.  \n\nUltimately, both traditions uphold the verse’s core message while enriching its layers through their respective hermeneutical traditions, demonstrating Islam’s multifaceted engagement with scripture.",
    "layer5_urdu": "سورہ الحومازا 104: 4 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی کے علمی روایات بنیادی تفہیم پر متحد ہوجاتی ہیں کہ \"کولہو\" (الہوتامہ) غیبت ، طنز اور دولت کی بدنیتی پر مبنی جمع ہونے میں مشغول ہونے والوں کے لئے بعد کی زندگی میں شدید سزا کی نشاندہی کرتا ہے۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں پیشن گوئی حدیث کا حوالہ دیتے ہیں جس میں الہوتامہ کو جہنم کی آگ کی ایک سطح کے طور پر بیان کیا گیا ہے جو \"ہڈیوں اور گوشت کو پیستا ہے\" ، جس نے معاشرتی اخلاقیات کی خلاف ورزی کرنے کے ل divine الہی بدلہ لینے پر زور دیا ہے۔ ابن کتھیر اور التوسی بھی اسی طرح آیت کو تکبر کے خلاف انتباہ کے طور پر دیکھنے اور دوسروں کے وقار کو نقصان پہنچانے کے لئے صف بندی کرتے ہیں ، جو قرآن کے وسیع اخلاقی فریم ورک میں شامل ہیں۔  \n\nمذہبی زور سے تغیرات ابھرتے ہیں۔ سنی استثنیٰ جیسے القوروبی اور الراجی سزا کے لفظی مظہروں پر توجہ مرکوز کرتے ہیں ، اکثر اسے قانونی لینسوں کے ذریعہ بیک بٹینگ (گیبا) جیسے مخصوص گناہوں سے جوڑتے ہیں۔ اس کے برعکس ، شیعہ تبصرے جیسے العزان کے ذریعہ تبتابائی اور القومی کے طافسیر استعاریاتی طول و عرض کو مربوط کرتے ہیں ، اور روحانی سچائی سے الگ ہونے پر الہوتامہ کو روح کے بازی کی علامت قرار دیتے ہیں۔ یہ ظاہری اقدامات اور اندرونی ریاستوں کے مابین باہمی تعامل پر شیعہ کے زور کی عکاسی کرتا ہے ، جسے اخلاقی رہنماؤں کے طور پر امامہ کے کردار سے آگاہ کیا جاتا ہے۔  \n\nتاریخی طور پر ، یہ اختلافات الگ الگ طریقہ کار کی ترجیحات سے پیدا ہوتے ہیں: سنی طافسر اکثر منتقلی کے بیانیے (Riwaya) اور فقیہ اصولوں کو ترجیح دیتے ہیں ، جبکہ شیعہ استثنیٰ (خاص طور پر بعد کے بعد) امیمی الہیات کے ساتھ جڑے ہوئے دانشورانہ (diraya) نقطہ نظر کو تیزی سے شامل کرتا ہے۔ عملی طور پر ، دونوں روایات اخلاقی طرز عمل کو تقویت بخشتی ہیں ، لیکن شیعہ تشریحات معاشرتی انصاف کو اماموں کے ساتھ وفاداری کے توسیع کے طور پر برقرار رکھنے کے لئے فرقہ وارانہ ذمہ داری کو بڑھا سکتی ہیں ، جبکہ سنی ایپلی کیشنز الہی قانون سے پہلے انفرادی احتساب پر زور دے سکتی ہیں۔  \n\nبالآخر ، دونوں روایات آیت کے بنیادی پیغام کو برقرار رکھتے ہیں جبکہ اپنی اپنی پرتوں کو اپنی متعلقہ روایات کے ذریعہ تقویت دیتے ہیں ، اور صحیفہ کے ساتھ اسلام کی کثیر الجہتی مصروفیت کا مظاہرہ کرتے ہیں۔",
    "summary": "Tafsir al-Mizan offers profound insights, with Tabatabai noting that expands this by framing *al-Hutamah* as a metaphysical reality reflecting the disintegration of the soul’s false sense of autonomy. In Surah Al-Humaza, verse 4, Allah declares: *\"Kalla layunbadhanna fil-hutamah\"* (No! He will surely be thrown into the Crusher). This powerful verse condemns those who mock others, spread slander, and obsess over material wealth while neglecting spiritual and ethical responsibilities. The term *\"hutamah\"* (the Crusher) is derived from the root *hatama*, meaning to shatter or grind completely. Imam Ali (as) said, “The fire of this world is a spark of the greater Fire, and the crushing of the soul’s arrogance is the key to salvation. The verse ultimately serves as a timeless reminder: our treatment of others directly shapes our eternal destiny.",
    "layer2short": "In Surah al-Humazah, verse 4, the divine threat *\"No! He will surely be thrown into the Crusher\"* serves as a severe rebuke to those who mock others and hoard wealth arrogantly. Classical Shia exegetes, such as Sheikh Tabrisi in *Majma al-Bayan*, elucidate that *al-Hutamah* (the Crusher) is a name for Hell, derived from the root *hatm* (to break or crush), signifying a place that \"shatters the bones and reduces all to fragments\" as the ultimate consequence of moral corruption. This interpretation aligns with the broader Qur’anic motif of divine retribution being commensurate with human actions (*jaza' al-mithl*), a principle central to Shia theology’s emphasis on God’s perfect justice (*‘adl*).",
    "layer2short_urdu": "سورہ الحومازاہ میں ، آیت 4 ، خدائی خطرہ * \"نہیں! اسے یقینا the کولہو میں پھینک دیا جائے گا\" * دوسروں کا مذاق اڑانے والوں اور دولت کو تکبر سے جمع کرنے والوں کے لئے سخت سرزنش کا کام کرتا ہے۔ کلاسیکی شیعہ استثنیٰ ، جیسے شیخ تبریسی *ماجما البیان *میں ، یہ واضح کریں کہ *الحتامہ *(کروسر) جہنم کا نام ہے ، جو جڑ *ہپم *(توڑنے یا کچلنے کے لئے) سے ماخوذ ہے ، جس سے \"ہڈیوں کو ہلچل مچاتا ہے اور تمام ٹکڑوں کو کم کرتا ہے۔\" یہ تشریح الہی بدلہ لینے کے وسیع تر قرآنی شکل کے ساتھ ہم آہنگ ہے جو انسانی اعمال (*جازا 'المتھل*) کے مطابق ہے ، جو خدا کے کامل انصاف (*‘ADL*) پر شیعہ الہیات کے زور دینے کا ایک اصول ہے۔"
  },
  "5": {
    "layer1": "In Surah Al-Humaza, verse 5, Allah asks, *\"And what can make you know what is the Crusher?\"* (وَمَآ أَدْرَىٰكَ مَا ٱلْحُطَمَةُ), using a rhetorical question to emphasize the unimaginable severity of *al-hutamah*—a vivid term for Hellfire. The word *al-hutamah* derives from the root *hatama*, meaning \"to shatter\" or \"crush completely,\" evoking an image of a force that annihilates everything in its path. Classical Shia commentators, such as Allamah Tabatabai in *Tafsir al-Mizan*, explain that this name for Hell reflects its power to utterly destroy both the body and soul of those who persist in arrogance, greed, and harming others. The surah, revealed in Mecca, condemns those who mock the vulnerable, hoard wealth selfishly, and engage in backbiting (*ghumaz*), a behavior rampant among the Quraysh elites who ridiculed the Prophet (PBUH) and early Muslims.  \n\nThis verse serves as a stark reminder that actions rooted in malice and materialism have cosmic consequences. The rhetorical question—*\"what can make you know?\"*—highlights human limitations in grasping divine punishment’s full reality, urging humility. In modern contexts, *al-hutamah* warns against the spiritual corrosion of gossip, online slander, or exploiting others for social or financial gain. It calls Muslims to self-reflect: Are we \"crushing\" others through our words, actions, or neglect of communal responsibilities? By prioritising empathy, ethical wealth distribution, and guarding our speech, we align with the Quran’s call to build a society rooted in *taqwa* (God-consciousness) rather than self-destruction. The verse ultimately bridges the eternal consequences of our choices with the urgency to embody justice and compassion today.",
    "layer2": "In Surah al-Humaza 104:5, the rhetorical question *\"And what can make you know what is the Crusher?\"* serves to emphasize the incomprehensible severity of *al-Hutamah*, a term uniquely describing Hell’s annihilating force. Classical Shia exegetes, drawing from the teachings of the Ahl al-Bayt, interpret *al-Hutamah* as a manifestation of divine justice, reflecting both physical and metaphysical dimensions of punishment for moral corruption.  \n\nTabrisi’s *Majma al-Bayan* explains that *al-Hutamah* derives from the root *hatm* (to break or crush), signifying a fire that \"shatters bones and reduces souls to utter ruin.\" This aligns with narrations from Imam Jafar al-Sadiq, who described it as a fire that \"consumes the body and penetrates the heart,\" symbolizing the totality of divine retribution. Tabatabai’s *Al-Mizan* expands this, noting that *al-Hutamah* represents not merely physical torment but the existential collapse of those who, through slander and materialism (as condemned in the Surah), severed their connection to spiritual truth. Their punishment mirrors their worldly actions: just as they \"crushed\" others’ dignity, they are now crushed by divine justice.  \n\nShia theology uniquely links such eschatological concepts to the principle of *al-Mizan* (divine balance), where deeds are weighed with precision. The verse underscores the inevitability of accountability, a cornerstone of Shia jurisprudence, which emphasizes intention (*niyyah*) and the ethical consequences of speech and wealth. Classical commentators also connect *al-Hutamah* to the rejection of *wilayah* (divinely ordained leadership of the Ahl al-Bayt), as moral decay stems from disregarding guidance. Thus, the verse transcends literal warning, inviting reflection on the ontological relationship between human actions and their ultimate recompense.",
    "layer3": "In contemporary Shia scholarship, Surah al-Humazah’s fifth verse—asking *“What can make you know what the Crusher (al-Hutamah) is?”*—is often explored through layered lenses of moral, social, and cosmic accountability. Scholars like Ayatollah Naser Makarem Shirazi contextualize *al-Hutamah* not merely as a physical hellfire but as a metaphor for the self-destructive consequences of greed, slander, and social exploitation. Modern exegetes, such as Sayyed Mohammed Hussein Fadlallah, link this “crushing” force to systemic injustices—corporate greed widening wealth gaps, or digital platforms enabling cyberbullying and character assassination, which “crush” dignity and communal trust.  \n\nScientifically, some scholars draw parallels between *al-Hutamah* and cosmic phenomena like black holes—entities that annihilate matter—to illustrate how moral corruption consumes societies from within. Philosophically, the verse challenges humanity’s obsession with material accumulation, echoing thinkers like Frantz Fanon, who critiqued colonialism’s dehumanizing greed.  \n\nGlobally, this verse resonates with crises like climate destruction (crushing ecosystems for profit) or refugee marginalization, where indifference “crushes” human potential. Interfaith dialogues highlight shared ethical concerns: Buddhist teachings on desire’s destructiveness or Christian critiques of wealth idolatry mirror Islam’s warnings.  \n\nUltimately, the verse urges a reevaluation of power dynamics. As contemporary Shia theologian Dr. Liyakat Takim notes, *al-Hutamah* symbolizes both divine justice and the urgent need for societal reform—a call to dismantle systems that “crush” the vulnerable, replacing them with equity and compassion. In an age of existential threats, this 7th-century warning remains a timeless blueprint for ethical survival.",
    "layer4": "In the luminous teachings of the Ahlul Bayt (peace be upon them), the \"Crusher\" (Al-Hutamah) mentioned in this verse is not merely a physical fire but a spiritual annihilation that consumes the hearts of those who oppose divine truth. Imam Jaafar al-Sadiq (peace be upon him) explains in *Tafsir al-Qummi* that Al-Hutamah is \"a fire that ignites in the heart of the denier, burning away their capacity to recognize the light of Wilayah (divine guardianship).\" This aligns with the Prophet Muhammad’s (peace be upon him and his family) warning: *\"The worst of people are those who slander others, for they will be crushed between the layers of Hell\"* (Bihar al-Anwar).  \n\nLady Fatimah al-Zahra (peace be upon her) taught that backbiting and arrogance—central sins condemned in Surah al-Humazah—are manifestations of a heart detached from the love of the Ahlul Bayt. She said, *\"The one who turns away from our guardianship feeds their soul with the fire of regret\"* (Basa’ir al-Darajat). Here, \"the Crusher\" symbolizes the spiritual collapse of those who prioritize worldly status over divine connection, fracturing their eternal selves through heedlessness.  \n\nThe Shia tradition emphasizes that recognizing the Imamah (divinely appointed leadership) of the Ahlul Bayt acts as a shield against such destruction. Imam Ali (peace be upon him) states, *\"The fire of Al-Hutamah cannot touch a heart nourished by the remembrance of Allah and loyalty to His chosen ones\"* (Nahj al-Balagha). Practically, this calls believers to purify their intentions, avoid gossip and envy, and anchor their souls in the love of the Imams. By embodying humility and upholding the rights of others—key teachings of the Ahlul Bayt—we transform the \"crushing\" into a means of spiritual ascent, turning away from the ego’s tyranny toward the safety of divine grace.",
    "layer1_urdu": "سورت الہومازا میں ، آیت 5 ، اللہ پوچھتا ہے ، *\"اور آپ کو کس چیز سے یہ معلوم ہوسکتا ہے کہ کولہو کیا ہے؟\" لفظ *الحتامہ *جڑ *ہاتامہ *سے اخذ کیا گیا ہے ، جس کا مطلب ہے \"بکھرنے کے لئے\" یا \"مکمل طور پر کچلنے\" ، ایک ایسی قوت کی شبیہہ کو جنم دیتا ہے جو اس کے راستے میں موجود ہر چیز کو ختم کرتا ہے۔ کلاسیکی شیعہ مبصرین ، جیسے *طافسیر المزان *میں الامہ تبتابائی ، وضاحت کرتے ہیں کہ جہنم کا یہ نام تکبر ، لالچ اور دوسروں کو نقصان پہنچانے والے افراد کے جسم اور روح دونوں کو مکمل طور پر تباہ کرنے کی اپنی طاقت کی عکاسی کرتا ہے۔ مکہ میں انکشاف کیا گیا ہے کہ مکہ میں انکشاف کیا گیا ہے کہ وہ ان لوگوں کی مذمت کرتے ہیں جو کمزور ، دولت کو خود غرض سے مذاق کرتے ہیں ، اور بیکنگ (*گھوماز*) میں مشغول ہیں ، جو قریش کے اشرافیہ کے درمیان ایک ایسا سلوک ہے جنہوں نے نبی صلی اللہ علیہ وسلم اور ابتدائی مسلمانوں کا مذاق اڑایا۔  \n\nیہ آیت ایک بالکل یاد دہانی کے طور پر کام کرتی ہے کہ بدنامی اور مادیت پرستی میں جڑے ہوئے اقدامات کے کائناتی نتائج ہوتے ہیں۔ بیان بازی کا سوال -*\"آپ کو کس چیز کا پتہ چل سکتا ہے؟\" جدید سیاق و سباق میں ، * الحتامہ * نے گپ شپ ، آن لائن بہتان کی روحانی سنکنرن کے خلاف انتباہ کیا ہے ، یا دوسروں کو معاشرتی یا مالی فائدہ کے لئے استحصال کیا ہے۔ اس نے مسلمانوں کو خود عکاسی کرنے کا مطالبہ کیا ہے: کیا ہم اپنے الفاظ ، اعمال ، یا فرقہ وارانہ ذمہ داریوں سے نظرانداز کرتے ہوئے دوسروں کو \"کچل رہے ہیں\"؟ ہمدردی ، اخلاقی دولت کی تقسیم کو ترجیح دیتے ہوئے ، اور اپنی تقریر کی حفاظت کرتے ہوئے ، ہم قرآن مجید کی طرف سے خود کو تباہ کرنے کی بجائے * تقوا * (خدا کے شعور) میں جڑے ہوئے معاشرے کی تعمیر کے لئے کال کے ساتھ ہم آہنگ ہیں۔ آیت بالآخر ہمارے انتخاب کے دائمی نتائج کو آج انصاف اور ہمدردی کو مجسم بنانے کی عجلت کے ساتھ ختم کرتی ہے۔",
    "layer2_urdu": "سورہ الحومازا 104: 5 میں ، بیان بازی کا سوال *\"اور آپ کو کیا جاننے کے لئے کہ کولہو کیا ہے؟\" کلاسیکی شیعہ استثنیٰ ، اہل البائٹ کی تعلیمات سے ڈرائنگ کرتے ہوئے ، * الہوتامہ * کو الہی انصاف کے مظہر کی ترجمانی کرتے ہیں ، جو اخلاقی بدعنوانی کی سزا کے جسمانی اور استعاریاتی دونوں جہتوں کی عکاسی کرتے ہیں۔  \n\nتبریسی کے * مجس البیان * نے وضاحت کی ہے کہ * الحتامہ * جڑ * ہیٹم * (توڑنے یا کچلنے کے لئے) سے ماخوذ ہے ، اس آگ کی نشاندہی کرتا ہے جو \"ہڈیوں کو بکھرتا ہے اور جانوں کو برباد کرنے کے لئے کم کرتا ہے۔\" یہ امام جعفر السادق کی روایات کے ساتھ منسلک ہے ، جس نے اسے آگ کے طور پر بیان کیا ہے جو \"جسم کو کھاتا ہے اور دل میں گھس جاتا ہے\" ، جو الہی بدلہ لینے کی مکمل علامت ہے۔ تبتابائی کے * المزان * نے اس کو وسعت دی ، یہ نوٹ کرتے ہوئے کہ * الحتامہ * محض جسمانی عذاب نہیں بلکہ ان لوگوں کے وجودی خاتمے کی نمائندگی کرتا ہے جو ، بہتان اور مادیت پرستی (جیسا کہ سور surah میں مذمت کرتے ہیں) نے روحانی سچائی سے ان کا تعلق منقطع کردیا۔ ان کی سزا ان کے دنیاوی اقدامات کا آئینہ دار ہے: جس طرح انہوں نے دوسروں کو \"کچل دیا\" ، اسی طرح وہ الہی انصاف کے ذریعہ کچل گئے ہیں۔  \n\nشیعہ الہیات انفرادی طور پر اس طرح کے شعور تصورات کو * المزان * (الہی توازن) کے اصول سے جوڑتا ہے ، جہاں اعمال کا وزن صحت سے متعلق ہوتا ہے۔ اس آیت میں احتساب کی ناگزیر ہونے کی نشاندہی کی گئی ہے ، شیعہ فقہ کا ایک سنگ بنیاد ہے ، جو نیت (*نیہہ*) اور تقریر اور دولت کے اخلاقی نتائج پر زور دیتا ہے۔ کلاسیکی مبصرین * الہوتامہ * کو * ولیہ * (اے ایچ ایل ال بیت کی خدائی طور پر مقرر کردہ قیادت) کے مسترد ہونے سے بھی مربوط ہیں ، کیونکہ اخلاقی کشی کو نظرانداز کرنے سے نظرانداز کرنے سے پیدا ہوتا ہے۔ اس طرح ، آیت لفظی انتباہ سے بالاتر ہے ، جس میں انسانی عمل اور ان کے حتمی بدلہ کے مابین آنٹولوجیکل تعلقات پر عکاسی کی دعوت دی گئی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ الحومازاہ کی پانچویں آیت-جس سے *\"آپ کو یہ معلوم کر سکتا ہے کہ کولہو (الہوتامہ) کیا ہے؟\" *-اکثر اخلاقی ، معاشرتی اور کائناتی احتساب کے پرتوں والے عینکوں کے ذریعے تلاش کیا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی جیسے اسکالرز محض جسمانی جہنم کی حیثیت سے نہیں بلکہ لالچ ، بہتان اور معاشرتی استحصال کے خود تباہ کن نتائج کے استعارے کے طور پر نہیں بلکہ ایک استعارہ کے طور پر ہیں۔ جدید استثنیٰ ، جیسے سیئڈ محمد حسین فڈاللہ ، اس \"کرشنگ\" قوت کو نظامی ناانصافیوں سے جوڑتے ہیں۔ لالچ کو لالچ میں وسیع کرنے والے دولت کے فرق کو تشکیل دیتے ہیں ، یا سائبر دھونس اور کردار کے قتل کو قابل بناتے ہیں ، جو \"کرش\" وقار اور فرقہ وارانہ اعتماد ہے۔  \n\nسائنسی طور پر ، کچھ اسکالرز * الحتامہ * اور کائناتی مظاہر جیسے بلیک ہولز-جو مادے کو ختم کرتے ہیں ، جیسے کہ اخلاقی بدعنوانی معاشروں کو اندر سے کس طرح کھاتے ہیں ، کے مابین ہم آہنگی کھینچتے ہیں۔ فلسفیانہ طور پر ، آیت انسانیت کے جنون کو مادی جمع کے ساتھ چیلنج کرتی ہے ، فرینٹز فانون جیسے مفکرین کی بازگشت کرتے ہیں ، جنہوں نے استعمار کے غیر مہذب لالچ پر تنقید کی۔  \n\nعالمی سطح پر ، یہ آیت آب و ہوا کی تباہی (منافع کے لئے ماحولیاتی نظام کو کچلنے) یا پناہ گزینوں کے پسماندگی جیسے بحرانوں سے گونجتی ہے ، جہاں بے حسی انسانی صلاحیتوں کو \"کچل دیتی ہے\"۔ بین المذاہب مکالموں نے مشترکہ اخلاقی خدشات کو اجاگر کیا: خواہش کی تباہی یا دولت کے عیسائی نقادوں سے متعلق بدھ مت کی تعلیمات آئینے کے اسلام کی انتباہات۔  \n\nآخر کار ، آیت بجلی کی حرکیات کی دوبارہ تشخیص پر زور دیتی ہے۔ جیسا کہ عصری شیعہ مذہبی ماہر ڈاکٹر لیاکات تکیم نوٹ کرتے ہیں ، * الحتامہ * الہی انصاف اور معاشرتی اصلاحات کی فوری ضرورت دونوں کی علامت ہے۔ یہ نظام کو ختم کرنے کے لئے ایک کال ہے جو کمزوروں کو \"کچل\" دیتے ہیں ، اور ان کی جگہ ایکویٹی اور ہمدردی سے بدلتے ہیں۔ وجودی خطرات کے دور میں ، ساتویں صدی کا یہ انتباہ اخلاقی بقا کے لئے ایک بے وقت نقشہ بنی ہوئی ہے۔",
    "layer4_urdu": "اہل بیت (ان پر امن) کی برائٹ تعلیمات میں ، اس آیت میں ذکر کردہ \"کولہو\" (الہوتمہ) محض ایک جسمانی آگ نہیں بلکہ ایک روحانی فنا ہے جو خدائی سچائی کی مخالفت کرنے والوں کے دلوں کو کھاتا ہے۔ امام جافر السادق (اس پر امن ہے) نے * طافسیر القومی * میں وضاحت کی ہے کہ الہوتامہ \"ایک ایسی آگ ہے جو انکار کے دل میں بھڑک رہی ہے ، اور اس نے ولیہ (الہی سرپرستی) کی روشنی کو پہچاننے کی صلاحیت کو جلا دیا ہے۔\" یہ حضرت محمد صلی اللہ علیہ وآلہ وسلم کے ساتھ منسلک ہے (اس پر اور اس کے اہل خانہ پر امن ہے) نے انتباہ کیا: \"بدترین لوگ وہ لوگ ہیں جو دوسروں کی بہتان کرتے ہیں ، کیونکہ وہ جہنم کی تہوں کے درمیان کچل جائیں گے\" * (بہار الانور)۔  \n\nلیڈی فاطمہ الظہرہ (اس پر امن) نے سکھایا کہ سورت الحومازاہ میں بیک بٹی اور تکبر-سنٹرل گناہوں کی مذمت کی گئی ہے-یہ ایک دل کا مظہر ہے جو اہل بیت کی محبت سے الگ ہے۔ اس نے کہا ، \"وہ جو ہماری سرپرستی سے منہ موڑتا ہے وہ ان کی روح کو پچھتاوا کی آگ سے کھلاتا ہے\" * (بسایر الدراجت)۔ یہاں ، \"کولہو\" ان لوگوں کے روحانی خاتمے کی علامت ہے جو الہی تعلق سے زیادہ دنیاوی حیثیت کو ترجیح دیتے ہیں ، اور ان کے دائمی خود کو غفلت سے دوچار کرتے ہیں۔  \n\nشیعہ روایت اس بات پر زور دیتی ہے کہ اہل بیت کی امامہ (خدائی مقرر کردہ قیادت) کو تسلیم کرنا اس طرح کی تباہی کے خلاف ڈھال کا کام کرتا ہے۔ امام علی (اس پر امن ہے) کہتے ہیں ، * \"الحتامہ کی آگ اس کے منتخب کردہ افراد کے ساتھ اللہ کی یاد اور وفاداری سے پرورش دل کو چھو نہیں سکتی\" * (ناہج البالاگھا)۔ عملی طور پر ، یہ مومنین کو اپنے ارادوں کو پاک کرنے ، گپ شپ اور حسد سے بچنے اور اماموں کی محبت میں اپنی جانوں کو لنگر انداز کرنے کا مطالبہ کرتا ہے۔ عاجزی کو مجسم بنا کر اور دوسروں کے حقوق کو برقرار رکھنے کے ذریعہ - اہل بیت کی کلیدی تعلیمات - ہم \"کرشنگ\" کو روحانی چڑھائی کے ایک ذریعہ میں تبدیل کرتے ہیں ، اور الہی فضل کی حفاظت کی طرف انا کے ظلم سے ہٹ جاتے ہیں۔",
    "layer5": "In interpreting Surah al-Humaza 5, both Shia and Sunni scholarly traditions converge on understanding \"al-Hutama\" (the Crusher) as a severe punishment in the afterlife for those who mock others and hoard wealth. Al-Tabari (Sunni) and al-Tabrisi (Shia) both describe it as an intensified form of Hell, with al-Tabrisi's *Majma al-Bayan* and Ibn Kathir's *Tafsir* emphasizing its \"crushing\" nature through divine fire that consumes even bones. Al-Qurtubi and al-Tusi’s *al-Tibyan* similarly stress its etymological link to \"breaking into fragments,\" reflecting shared linguistic analysis across traditions.\n\nDivergences emerge in theological emphasis. Shia commentaries like al-Qummi’s *Tafsir* and Tabatabai’s *al-Mizan* often contextualize the verse within the moral consequences of slandering sacred figures, particularly the Ahl al-Bayt, drawing on narrations that link \"al-Hutama\" to the punishment of those who opposed Imam Ali. In contrast, Sunni exegetes such as al-Razi in *Mafatih al-Ghayb* focus more broadly on the societal implications of backbiting and materialism, with Ibn Kathir framing it as a universal warning against arrogance. These differences stem from distinct theological priorities: Shia tafsir frequently integrates devotion to the Imams into ethical frameworks, while Sunni works prioritize individual accountability within communal ethics.\n\nHistorically, Shia interpretations developed alongside doctrinal emphasis on the spiritual-political legacy of the Prophet’s household, whereas Sunni exegesis emerged within broader discussions of social morality in diverse caliphal contexts. Both traditions, however, reinforce the verse’s core ethical message: the imperative to avoid malice and greed. While Shia practice may emphasize loyalty to the Imams as a safeguard against moral corruption, Sunni teachings often link the verse to cultivating personal piety and social responsibility. These interpretive nuances reflect complementary spiritual perspectives rather than contradictory dogmas.",
    "layer5_urdu": "سورہ الحومازا 5 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی علمی دونوں روایات \"الہوتاما\" (کولہو) کو سمجھنے پر متحرک ہوجاتی ہیں جو دوسروں کا مذاق اڑاتے ہیں اور دولت کا ذخیرہ کرنے والوں کے بعد کی زندگی میں شدید سزا کے طور پر۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں اس کو جہنم کی ایک شدت والی شکل کے طور پر بیان کرتے ہیں ، اس کے ساتھ ہی الضرسی کے * مجسہ البیان * اور ابن کتھیر کے * طافسر * الہی آگ کے ذریعے اپنی \"کچلنے والی\" نوعیت پر زور دیتے ہیں جو ہڈیوں کو بھی استعمال کرتے ہیں۔ القورووبی اور التوسی کے * التیبیان * اسی طرح روایات میں مشترکہ لسانی تجزیہ کی عکاسی کرتے ہوئے \"ٹکڑوں کو توڑنے\" سے اس کے نسلی تعلق پر زور دیتے ہیں۔\n\nمذہبی زور سے تغیرات ابھرتے ہیں۔ شیعہ تبصرے جیسے القومی کے * طافسیر * اور تبتابائی کے * المزان * اکثر اس آیت کو بدکاری کرنے والے مقدس شخصیات کے اخلاقی نتائج ، خاص طور پر اہل البائٹ کے ساتھ سیاق و سباق دیتے ہیں ، جس میں \"الہوتاما\" کو امام علی کی مخالفت کرنے والوں کی سزا سے جوڑنے والے روایات پر روشنی ڈالی جاتی ہے۔ اس کے برعکس ، سنی * * مافاتیہ الغیب * میں العزجی جیسے پیچھے اور مادیت پسندی کے معاشرتی مضمرات پر زیادہ وسیع پیمانے پر توجہ مرکوز کرتے ہیں ، جس کے ساتھ ابن کتھیر نے اسے تکبر کے خلاف ایک آفاقی انتباہ کے طور پر تیار کیا ہے۔ یہ اختلافات الگ الگ مذہبی ترجیحات سے پیدا ہوتے ہیں: شیعہ طافسر اکثر اماموں کے لئے عقیدت کو اخلاقی فریم ورک میں ضم کرتا ہے ، جبکہ سنی کام فرقہ وارانہ اخلاقیات کے اندر انفرادی احتساب کو ترجیح دیتے ہیں۔\n\nتاریخی طور پر ، شیعہ تشریحات نبی کے گھر والوں کی روحانی سیاسی میراث پر نظریاتی زور کے ساتھ ساتھ تیار ہوئی ہیں ، جبکہ سنی کی توثیق متنوع خلافت کے سیاق و سباق میں معاشرتی اخلاقیات کے وسیع تر مباحثوں میں سامنے آئی ہے۔ تاہم ، دونوں روایات آیت کے بنیادی اخلاقی پیغام کو تقویت دیتی ہیں: بدکاری اور لالچ سے بچنے کے لئے ضروری ہے۔ اگرچہ شیعہ پریکٹس اخلاقی بدعنوانی کے خلاف حفاظت کے طور پر اماموں کے ساتھ وفاداری پر زور دے سکتی ہے ، لیکن سنی تعلیمات اکثر اس آیت کو ذاتی تقویٰ اور معاشرتی ذمہ داری کاشت کرنے سے جوڑتی ہیں۔ یہ تشریحی باریکیاں متضاد کتے کے بجائے تکمیلی روحانی نقطہ نظر کی عکاسی کرتی ہیں۔",
    "summary": "The verse links such eschatological concepts to the principle of *al-Mizan* (divine balance), where deeds are weighed with precision. In Surah Al-Humaza, verse 5, Allah asks, *\"And what can make you know what is the Crusher?\"* (وَمَآ أَدْرَىٰكَ مَا ٱلْحُطَمَةُ), using a rhetorical question to emphasize the unimaginable severity of *al-hutamah*—a vivid term for Hellfire. The word *al-hutamah* derives from the root *hatama*, meaning \"to shatter\" or \"crush completely,\" evoking an image of a force that annihilates everything in its path. Classical Shia commentators, such as Allamah Tabatabai in *Tafsir al-Mizan*, explain that this name for Hell reflects its power to utterly destroy both the body and soul of those who persist in arrogance, greed, and harming others. Imam Jaafar al-Sadiq (peace be upon him) explains in *Tafsir al-Qummi* that Al-Hutamah is \"a fire that ignites in the heart of the denier, burning away their capacity to recognize the light of Wilayah (divine guardianship). The verse ultimately bridges the eternal consequences of our choices with the urgency to embody justice and compassion today.",
    "layer2short": "In Surah al-Humaza 104:5, the rhetorical question *\"And what can make you know what is the Crusher?\"* serves to emphasize the incomprehensible severity of *al-Hutamah*, a term uniquely describing Hell’s annihilating force. Classical Shia exegetes, drawing from the teachings of the Ahl al-Bayt, interpret *al-Hutamah* as a manifestation of divine justice, reflecting both physical and metaphysical dimensions of punishment for moral corruption.  ",
    "layer2short_urdu": "سورہ الحومازا 104: 5 میں ، بیان بازی کا سوال *\"اور آپ کو کیا جاننے کے لئے کہ کولہو کیا ہے؟\" کلاسیکی شیعہ استثنیٰ ، اہل البائٹ کی تعلیمات سے ڈرائنگ کرتے ہوئے ، * الہوتامہ * کو الہی انصاف کے مظہر کی ترجمانی کرتے ہیں ، جو اخلاقی بدعنوانی کی سزا کے جسمانی اور استعاریاتی دونوں جہتوں کی عکاسی کرتے ہیں۔  "
  },
  "6": {
    "layer1": "Surah Al-Humazah, revealed in Mecca, condemns those who mock others, spread slander, and obsess over material wealth. Verse 6—*nāru Allāhi l-mūqadah* (\"It is the fire of Allah, [eternally] fueled\")—describes the divine punishment awaiting such individuals. The term *nār* (fire) here signifies a blazing, transformative force, distinct from ordinary fire, as it is attributed directly to Allah (*nāru Allāh*), emphasizing its divine origin and unparalleled intensity. *Mūqadah* (fueled) implies a fire perpetually sustained, reflecting the eternal consequences of persistent moral corruption. Shia tafsir, as noted in works like Tafsir al-Mizan by Allamah Tabatabai, links this verse to the spiritual decay caused by arrogance, backbiting, and neglect of social responsibility—sins that fracture community bonds and invite divine justice.\n\nHistorically, this surah targeted wealthy Meccan elites who ridiculed the Prophet (PBUH) and early Muslims, hoarded wealth, and scorned the vulnerable. The \"fire\" serves as a warning against exploiting power or status to harm others, a theme echoed in Shia teachings about accountability. Imam Ali (AS) emphasized that true wealth lies in piety and charity, stating, \"The value of a person is measured by their good deeds\" (Nahj al-Balagha). \n\nToday, this verse urges Muslims to avoid gossip, materialism, and social cruelty—issues amplified by modern platforms like social media. It calls for self-reflection: Are our actions fueling unity or division? Are we using our resources to uplift others or feed our pride? Practically, this means cultivating humility, guarding our speech, and prioritizing ethical wealth distribution, such as paying khums or supporting those in need. By aligning with the justice-oriented ethos of the Ahlul Bayt (AS), Muslims can transform societal \"fire\" into light—a community rooted in compassion, equity, and reverence for human dignity.",
    "layer2": "In Surah al-Humazah 104:6, the phrase *\"nāru Allāhi l-mūqadah\"* (the fire of Allah, [eternally] fueled) is interpreted by classical Shia exegetes as a profound articulation of divine retribution for moral and spiritual corruption. The verse forms part of a broader condemnation of those who mock, slander, and hoard wealth unjustly, with the \"fire\" symbolizing both the metaphysical reality of Hell (*Jahannam*) and the ontological intensity of Allah’s wrath against moral transgressors.  \n\nAl-Tabrisi in *Majma al-Bayan* emphasizes that the fire’s attribution to Allah (*nāru Allāhi*) underscores its unparalleled severity, distinguishing it from earthly fire. He notes that the term *al-mūqadah* (fueled) implies perpetual ignition, sustained by divine command, and inextricably linked to the deeds of the wrongdoers themselves. This aligns with the Shia theological principle that punishment in the hereafter is a direct manifestation of divine justice (*‘adl*)—a recompense calibrated to one’s actions.  \n\nIn *Al-Mizan*, Allamah Tabatabai expands on this, framing the fire as a consequence of violating the sacredness of human dignity and social justice, core themes in Shia ethics. He connects the verse to the broader Qur’anic warning against *namimah* (backbiting) and *hasad* (envy), sins that fracture communal harmony and oppose the teachings of the Ahl al-Bayt. The \"fuel\" of this fire, he suggests, is metaphorically drawn from the transgressors’ own malice, as their actions generate the spiritual corruption that necessitates such chastisement.  \n\nShia tradition also contextualizes this verse within the framework of *walayah* (allegiance to divine guidance). The 6th Imam, Jafar al-Sadiq, is reported to have stated that those who reject the guardianship (*wilayah*) of the Ahl al-Bayt risk severing themselves from divine mercy, thereby becoming \"fuel\" for this fire. This ties the verse to the Shia doctrine of eschatological accountability, where moral and theological deviations—particularly the rejection of divinely appointed leadership—compound one’s liability in the hereafter.  \n\nJuridically, the verse reinforces the gravity of sins against societal ethics in Shia *fiqh*, mandating repentance and restitution to avert such consequences. Yet, it also balances justice with mercy, as the perpetuity of the fire is reserved for unrepentant offenders, while the door to divine forgiveness remains open through sincere return (*tawbah*) and intercession (*shafa‘ah*) by the Ahl al-Bayt, a cornerstone of Shia soteriology.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Humazah’s “fire of Allah, eternally fueled” (104:6) is interpreted as both a metaphysical reality and a metaphor for the destructive consequences of social injustice and moral corruption. Ayatollah Naser Makarem Shirazi, in his *Tafsir Nemuneh*, emphasizes that this fire represents divine retribution for those who exploit others through slander, greed, or oppression—a timeless warning against dehumanizing behavior. Modern scholars like Dr. Liyakat Takim extend this analysis, framing the verse as a critique of systemic inequities, such as economic exploitation or digital harassment, which “fuel” societal discord akin to an unquenchable blaze.\n\nScientifically, the imagery of an eternal fire resonates with contemporary understandings of entropy and irreversible damage. Environmental scholars, such as those in the Islamic Foundation for Ecology and Environmental Sciences, draw parallels between this verse and humanity’s unsustainable consumption, which accelerates climate change—a man-made “fire” threatening planetary ecosystems. Philosophically, the verse challenges materialism; the pursuit of wealth at others’ expense (a key theme in Surah Al-Humazah) mirrors modern capitalism’s excesses, where inequality and ecological harm are often ignored for profit.\n\nGlobally, this verse speaks to crises like misinformation campaigns that “ignite” sectarian violence or xenophobia. Interfaith dialogues, particularly with Jewish and Christian traditions that similarly warn against slander (e.g., Proverbs 16:27), highlight shared ethical imperatives to combat divisive speech. In multicultural societies, the verse urges fostering empathy over contempt—a remedy for the “fire” of polarization. By merging classical ethics with modern challenges, Shia thought positions this Quranic warning as a call to address both spiritual and systemic brokenness.",
    "layer4": "The fire described in Surah al-Humazah (104:6) as *\"the fire of Allah, [eternally] fueled\"* transcends mere physical punishment. Through the lens of the Ahlul Bayt (peace be upon them), this verse unveils a profound spiritual reality: the Hellfire is both a manifestation of divine justice and a reflection of the soul’s self-inflicted corruption. Imam Ja’far al-Sadiq (as) states, *\"This fire is kindled by the sins of those who mock the believers, scorn divine truths, and hoard wealth while neglecting the rights of the deprived. Its fuel is the arrogance that blinds hearts to the light of Wilayah [divine guardianship].\"*  \n\nThe Prophet Muhammad (saw) warned that *\"the backbiter will not enter Paradise\"* (Bihar al-Anwar), linking the verse’s condemnation of slanderers to the spiritual decay that fuels this eternal fire. Lady Fatimah (as), in her timeless sermon, illuminated how greed and oppression *\"ignite wars in the heart, turning it into a furnace of discontent.\"* The Ahlul Bayt teach that Hell’s flames are sustained by humanity’s rejection of divine love and guidance—particularly the rejection of Imamah, the spiritual axis connecting creation to Allah.  \n\nPractically, this verse calls believers to purify their speech, wealth, and intentions. Imam Ali (as) advises: *\"Guard your tongue as you guard your wealth—for every word is either a brick in your heavenly palace or a spark in your destruction.\"* To extinguish the \"fuel\" of this fire, one must embrace humility, uphold the rights of others, and anchor the heart to the Imams (as), whose teachings are the water that quenches the flames of ego. True salvation lies in recognizing that the fire of Allah is the natural consequence of a soul that chooses darkness over the illuminating path of the Ahlul Bayt.",
    "layer1_urdu": "مکہ میں انکشاف کردہ سورہ الحومازاہ ، دوسروں کا مذاق اڑانے ، بہتان پھیلانے اور مادی دولت پر جنون کرنے والوں کی مذمت کرتے ہیں۔ آیت 6—* نورو الہہی ایل مظیداہ* (\"یہ اللہ کی آگ ہے ، [ابدی] ایندھن\")-ایسے افراد کے منتظر الہی سزا کی وضاحت کرتی ہے۔ اصطلاح*نر*(آگ) یہاں ایک بھڑک اٹھنے والی ، تبدیلی کی طاقت کی نشاندہی کرتی ہے ، جو عام آگ سے الگ ہے ، کیونکہ اس کی براہ راست اللہ (*نورو اللہ*) سے منسوب کیا جاتا ہے ، جس میں اس کی الہی اصل اور بے مثال شدت پر زور دیا جاتا ہے۔ * مکداہ* (ایندھن) کا مطلب مستقل طور پر برقرار رہتا ہے ، جو مستقل اخلاقی بدعنوانی کے ابدی نتائج کی عکاسی کرتا ہے۔ شیعہ طافس ، جیسا کہ الامہ تبتابائی کے طافسیر المزان جیسے کاموں میں بتایا گیا ہے ، اس آیت کو تکبر ، بیک بٹی ، اور معاشرتی ذمہ داری کی نظرانداز کی وجہ سے روحانی کشی سے جوڑتا ہے۔\n\nتاریخی طور پر ، اس سورہ نے دولت مند میکن کے اشرافیہ کو نشانہ بنایا جنہوں نے نبی (صلی اللہ علیہ وآلہ وسلم) اور ابتدائی مسلمانوں کا مذاق اڑایا ، دولت جمع کی اور کمزوروں کو طعنہ دیا۔ \"فائر\" دوسروں کو نقصان پہنچانے کے لئے طاقت یا حیثیت کے استحصال کے خلاف انتباہ کا کام کرتا ہے ، جس کا ایک موضوع احتساب کے بارے میں شیعہ تعلیمات میں گونجتا ہے۔ امام علی (ع) نے اس بات پر زور دیا کہ حقیقی دولت تقویٰ اور صدقہ میں ہے ، اور یہ کہتے ہوئے کہ ، \"کسی شخص کی قدر ان کے نیک اعمال سے ماپا جاتا ہے\" (ناہج البالاگھا)۔ \n\nآج ، یہ آیت مسلمانوں کو گپ شپ ، مادیت پسندی اور معاشرتی ظلم سے بچنے کی تاکید کرتی ہے۔ اس میں خود کی عکاسی کا مطالبہ کیا گیا ہے: کیا ہمارے اعمال اتحاد یا تقسیم کو فروغ دینے والے ہیں؟ کیا ہم اپنے وسائل کو دوسروں کو ترقی دینے یا اپنے فخر کو کھلانے کے لئے استعمال کر رہے ہیں؟ عملی طور پر ، اس کا مطلب ہے عاجزی کاشت کرنا ، اپنی تقریر کی حفاظت کرنا ، اور اخلاقی دولت کی تقسیم کو ترجیح دینا ، جیسے کھوم کی ادائیگی کرنا یا ضرورت مندوں کی مدد کرنا۔ اہل بیت (ع) کے انصاف پر مبنی اخلاق کے ساتھ صف بندی کرکے ، مسلمان معاشرتی \"آگ\" کو روشنی میں تبدیل کرسکتے ہیں۔ یہ ایک ایسی برادری ہے جس میں ہمدردی ، مساوات اور انسانی وقار کے لئے عقیدت ہے۔",
    "layer2_urdu": "سورہ الحومازاہ 104: 6 میں ، یہ جملہ * \"نورو الہہی ایل مظیداہ\" * (اللہ کی آگ ، [ابدی طور پر] ایندھن) کی ترجمانی کلاسیکی شیعہ نے اخلاقی اور روحانی بدعنوانی کے لئے الہی بدلہ لینے کی گہری بات کی ہے۔ یہ آیت ان لوگوں کی وسیع تر مذمت کا ایک حصہ ہے جو دولت کا مذاق اڑانے ، بہتان اور دولت کو غیر منصفانہ طور پر جمع کرتے ہیں ، جس میں \"آگ\" جہنم کی استعاریاتی حقیقت (*جہنم*) دونوں کی علامت ہے اور اخلاقی حدود کے خلاف اللہ کے قہر کی اونٹولوجیکل شدت کی علامت ہے۔  \n\nالاتبریسی میں*ماجما البیان*نے اس بات پر زور دیا ہے کہ آگ کی اللہ سے منسوب اللہ (*نرو اللہ*) اس کی بے مثال شدت کی نشاندہی کرتی ہے ، اور اسے زمینی آگ سے ممتاز کرتی ہے۔ انہوں نے نوٹ کیا کہ اصطلاح * المقاداہ * (ایندھن) کا مطلب ہمیشہ کی اگنیشن کا مطلب ہے ، جو الہی کمانڈ کے ذریعہ برقرار رہتا ہے ، اور خود غلط کام کرنے والوں کے اعمال سے منسلک ہوتا ہے۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ اس کے بعد سزا الہی انصاف (*‘ADL*) کا براہ راست مظہر ہے۔  \n\n*المزان *میں ، الامہ تبتابائی اس پر توسیع کرتی ہے ، اور آگ کو انسانی وقار اور معاشرتی انصاف کی تقدس کی خلاف ورزی کرنے کے نتیجے میں ، شیعہ اخلاقیات میں بنیادی موضوعات کی خلاف ورزی کرتی ہے۔ وہ اس آیت کو * نامماہ * (بیکنگ) اور * حساد * (حسد) کے خلاف وسیع تر قرآنی انتباہ سے جوڑتا ہے ، جو فرقہ وارانہ ہم آہنگی کو فریکچر دیتے ہیں اور اہل البیت کی تعلیمات کی مخالفت کرتے ہیں۔ اس کا مشورہ ہے کہ اس آگ کا \"ایندھن\" استعاراتی طور پر خطا کی اپنی بدنامی سے نکالا گیا ہے ، کیونکہ ان کے اعمال روحانی بدعنوانی پیدا کرتے ہیں جس سے اس طرح کی عذاب کی ضرورت ہوتی ہے۔  \n\nشیعہ روایت بھی اس آیت کو * والیاہ * (الہی رہنمائی کی بیعت) کے فریم ورک کے اندر سیاق و سباق سے دوچار کرتی ہے۔ 6 ویں امام ، جعفر السادیق کے بارے میں بتایا گیا ہے کہ اے ایچ ایل البائٹ کے سرپرست (*ولیہ*) کو مسترد کرنے والے جو لوگ خود کو الہی رحم سے الگ کرتے ہیں ، اور اس طرح اس آگ کے لئے \"ایندھن\" بن جاتے ہیں۔ اس آیت کو شیعہ نظریے کے نظریے سے منسلک کیا جاتا ہے ، جہاں اخلاقی اور مذہبی انحرافات - خاص طور پر الہی مقرر کردہ قیادت کو مسترد کرنا - کسی کی ذمہ داری کو اس کے بعد کی ذمہ داری بناتے ہیں۔  \n\nجمہوری طور پر ، آیت شیعہ *فیقہ *میں معاشرتی اخلاقیات کے خلاف گناہوں کی کشش کو تقویت دیتی ہے ، اور اس طرح کے نتائج کو روکنے کے لئے توبہ اور بحالی کو لازمی قرار دیتی ہے۔ پھر بھی ، یہ انصاف کے ساتھ انصاف کو بھی متوازن کرتا ہے ، کیونکہ آگ کا دائرہ غیر منحرف مجرموں کے لئے مختص ہے ، جبکہ الہی معافی کا دروازہ مخلص واپسی (*توبہ*) اور شفاعت (*شافاع*) کے ذریعے شیعہ سوٹیریالوجی کا ایک سنگ بنیاد ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ الحومازاہ کی \"اللہ کی آگ ، ابدی طور پر ایندھن\" (104: 6) کو معاشرتی ناانصافی اور اخلاقی بدعنوانی کے تباہ کن نتائج کے لئے ایک استعاریاتی حقیقت اور استعارہ دونوں کے طور پر سمجھا جاتا ہے۔ آیت اللہ نصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں اس بات پر زور دیا ہے کہ یہ آگ ان لوگوں کے لئے الہی بدلہ کی نمائندگی کرتی ہے جو دوسروں کو بہتان ، لالچ یا جبر کے ذریعہ استحصال کرتے ہیں۔ ڈاکٹر لییاکات تکیم جیسے جدید اسکالرز اس تجزیے میں توسیع کرتے ہیں ، اور اس آیت کو نظامی عدم مساوات کے نقاد ، جیسے معاشی استحصال یا ڈیجیٹل ہراساں کرنے کے نقاد کے طور پر بیان کرتے ہیں ، جو معاشرتی تضاد کو \"ایندھن\" ایک ناقابل تسخیر آگ کے مترادف ہے۔\n\nسائنسی لحاظ سے ، ابدی آگ کی منظر کشی انٹروپی اور ناقابل واپسی نقصان کی عصری تفہیم کے ساتھ گونجتی ہے۔ ماحولیاتی اسکالرز ، جیسے اسلامی فاؤنڈیشن برائے ماحولیات اور ماحولیاتی علوم میں ہیں ، اس آیت اور انسانیت کی غیر مستحکم کھپت کے مابین ہم آہنگی کھینچتے ہیں ، جو آب و ہوا کی تبدیلی کو تیز کرتا ہے۔ فلسفیانہ طور پر ، آیت مادیت کو چیلنج کرتی ہے۔ دوسروں کے اخراجات پر دولت کا حصول (سورہ الحومازاہ کا ایک کلیدی موضوع) جدید سرمایہ داری کی زیادتیوں کا آئینہ دار ہے ، جہاں عدم مساوات اور ماحولیاتی نقصان کو اکثر منافع کے لئے نظرانداز کیا جاتا ہے۔\n\nعالمی سطح پر ، یہ آیت غلط معلومات کی مہموں جیسے بحرانوں سے بات کرتی ہے جو فرقہ وارانہ تشدد یا زینوفوبیا کو \"بھڑکاتی ہیں\"۔ بین المذاہب مکالمے ، خاص طور پر یہودی اور مسیحی روایات کے ساتھ جو بہتان کے خلاف انتباہ کرتے ہیں (جیسے ، امثال 16: 27) ، تفرقہ انگیز تقریر سے نمٹنے کے لئے مشترکہ اخلاقی عدم استحکام کو اجاگر کرتے ہیں۔ کثیر الثقافتی معاشروں میں ، آیت نے توہین پر ہمدردی کو فروغ دینے کی تاکید کی ہے۔ کلاسیکی اخلاقیات کو جدید چیلنجوں کے ساتھ ضم کرکے ، شیعہ نے سوچا کہ اس قرآنی انتباہ کو روحانی اور سیسٹیمیٹک دونوں ٹوٹ پھوٹ کو دور کرنے کی کال کے طور پر پوزیشن میں ہے۔",
    "layer4_urdu": "سورت الحومازاہ (104: 6) میں بیان کردہ آگ نے * \"اللہ کی آگ ، [ابدی] کو ایندھن دی\" * محض جسمانی سزا سے ماورا ہے۔ اہل بیت (ان پر امن) کے عینک کے ذریعہ ، یہ آیت ایک گہری روحانی حقیقت کی نقاب کشائی کرتی ہے: جہنم کی آگ دونوں ہی الہی انصاف کا ایک مظہر اور روح کی خود سے متاثرہ بدعنوانی کا عکاسی ہے۔ امام جافر السادق (ع) میں کہا گیا ہے ، *\"یہ آگ ان لوگوں کے گناہوں سے جلا دی گئی ہے جو مومنین کا مذاق اڑاتے ہیں ، خدائی سچائیوں کو طنز کرتے ہیں ، اور دولت کو محروم کرتے ہوئے دولت کا ذخیرہ کرتے ہیں۔  \n\nحضرت محمد (ص) نے متنبہ کیا کہ * \"بیک بیکٹر جنت میں داخل نہیں ہوگا\" * (بہار الانور) ، اس آیت کی بدصورتیوں کی مذمت کو روحانی کشی سے جوڑتا ہے جو اس ابدی آگ کو ایندھن دیتا ہے۔ لیڈی فاطمہ (ع) نے ، اپنے لازوال خطبے میں ، اس بات کو روشن کیا کہ کس طرح لالچ اور جبر * \"دل میں جنگیں بھڑکاتے ہیں ، اور اسے عدم اطمینان کی بھٹی میں بدل دیتے ہیں۔\" * احل بیت یہ تعلیم دیتے ہیں کہ جہنم کے شعلوں کو انسانیت کی محبت اور رہنمائی کے مسترد ہونے سے ، خاص طور پر امیع کو مسترد کرنے کی وجہ سے برقرار رکھا گیا ہے۔  \n\nعملی طور پر ، یہ آیت مومنوں کو اپنی تقریر ، دولت اور ارادوں کو پاک کرنے کا مطالبہ کرتی ہے۔ امام علی (ع) نے مشورہ دیا: * \"اپنی زبان کی حفاظت کرتے ہوئے جب آپ اپنی دولت کی حفاظت کرتے ہو تو کیونکہ ہر لفظ یا تو آپ کے آسمانی محل میں ایک اینٹ ہے یا آپ کی تباہی میں چنگاری ہے۔ حقیقی نجات یہ تسلیم کرنے میں مضمر ہے کہ اللہ کی آگ ایک روح کا فطری نتیجہ ہے جو اہل بیت کے روشن راستے پر اندھیرے کا انتخاب کرتا ہے۔",
    "layer5": "In interpreting Surah al-Humaza 6, both Shia and Sunni scholarly traditions converge on core theological principles while exhibiting nuanced differences in emphasis. Classical exegetes universally identify the \"fire of Allah\" as referring to hell's eternal punishment for those who mock others and hoard wealth unjustly. Al-Tabari (Sunni) and al-Tabrisi (Shia) both cite pre-Islamic Arabic usage of \"fueled fire\" (al-muwqada) to signify inextinguishable flames, affirming its literal interpretation as a divine chastisement. Ibn Kathir and al-Tusi similarly emphasize the verse's connection to the surah's condemnation of slanderers, with al-Qummi noting that such behavior constitutes rejection of divine guidance.  \n\nDivergences emerge in contextualizing the verse's moral implications. Sunni commentators like al-Qurtubi and al-Razi focus on individual accountability, interpreting the \"fuel\" as the sinners' own deeds (Qurtubi) or their scorched hearts (Razi). Shia sources like Tabatabai's *Al-Mizan* extend this to include societal dimensions, framing slander as undermining communal justice and the spiritual leadership of the Ahl al-Bayt. While Sunni tafsirs generally avoid explicit political readings, al-Tibyan by al-Tusi links the verse to Quranic warnings against opposing divine walaya (authority), reflecting Shia emphasis on imamate as a safeguard against moral corruption.  \n\nThese differences stem from distinct theological frameworks: Sunni exegesis often prioritizes individual eschatology, while Shia interpretations frequently integrate socio-political ethics through the lens of divinely appointed leadership. Both traditions agree the verse reinforces core Islamic values of ethical speech and economic justice, though their applications in jurisprudential and homiletic contexts reflect varied historical experiences. Such variations illustrate how shared Quranic principles are enriched through complementary scholarly lenses, rooted in Islam's diverse intellectual heritage.",
    "layer5_urdu": "سورہ الحومازا 6 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی علمی روایات بنیادی مذہبی اصولوں پر ایک دوسرے کے ساتھ مل جاتی ہیں جبکہ زور دینے میں متنازعہ اختلافات کی نمائش کرتے ہیں۔ کلاسیکی استثنیٰ عالمی طور پر \"اللہ کی آگ\" کی نشاندہی کرتے ہیں کیونکہ ان لوگوں کے لئے جہنم کی ابدی سزا کا حوالہ دیتے ہیں جو دوسروں کا مذاق اڑاتے ہیں اور دولت کو ناجائز طور پر جمع کرتے ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں نے \"ایندھن والی آگ\" (المموکادا) کے پہلے سے پہلے سے اسلامی عربی استعمال کا حوالہ دیا ہے تاکہ اس کی لفظی تشریح کو ایک الہی عجیس کے طور پر ظاہر کیا جاسکے۔ ابن کتھیر اور التوسی اسی طرح اس آیت کے سورتھ کی بہتانوں کی بدنامی سے متعلق رابطے پر زور دیتے ہیں ، الکوومی نے نوٹ کیا ہے کہ اس طرح کے طرز عمل سے الہی رہنمائی کو مسترد کردیا گیا ہے۔  \n\nآیت کے اخلاقی مضمرات کو سیاق و سباق دینے میں تفریق ابھرتی ہے۔ سنی مبصرین جیسے القوروبی اور الراجی انفرادی احتساب پر توجہ مرکوز کرتے ہیں ، اور \"ایندھن\" کو گنہگاروں کے اپنے اعمال (قربانی) یا ان کے دلوں والے دلوں (RAASI) کی ترجمانی کرتے ہیں۔ تبتابائی کے * المزان * جیسے شیعہ ذرائع نے معاشرتی طول و عرض کو شامل کرنے کے لئے اس میں توسیع کی ہے ، فرقہ وارانہ انصاف کو مجروح کرنے اور اے ایچ ایل البائٹ کی روحانی قیادت کو مجروح کرنے کے طور پر بہتان ہے۔ اگرچہ سنی طافس عام طور پر واضح سیاسی پڑھنے سے گریز کرتے ہیں ، التبیان از ال توسی نے الہی والیا (اتھارٹی) کی مخالفت کرنے کے خلاف آیت کو قرآنی انتباہات سے جوڑ دیا ہے ، اور اخلاقی بدعنوانی کے خلاف حفاظت کے طور پر امامیٹ پر شیعہ پر زور دینے کی عکاسی کرتی ہے۔  \n\nیہ اختلافات الگ الگ تھیلوجیکل فریم ورک سے پیدا ہوتے ہیں: سنی استثنیٰ اکثر انفرادی اسکیٹولوجی کو ترجیح دیتا ہے ، جبکہ شیعہ تشریحات اکثر الہامی مقرر کردہ قیادت کے عینک کے ذریعہ سماجی و سیاسی اخلاقیات کو مربوط کرتی ہیں۔ دونوں روایات اس سے اتفاق کرتی ہیں کہ آیت اخلاقی تقریر اور معاشی انصاف کی بنیادی اسلامی اقدار کو تقویت دیتی ہے ، حالانکہ فقہی اور ہم آہنگی کے سیاق و سباق میں ان کے اطلاق مختلف تاریخی تجربات کی عکاسی کرتے ہیں۔ اس طرح کی مختلف حالتوں میں یہ واضح کیا گیا ہے کہ کس طرح مشترکہ قرآنی اصولوں کو اسلام کے متنوع دانشورانہ ورثے میں جکڑے ہوئے تکمیلی علمی عینک کے ذریعے افزودہ کیا جاتا ہے۔",
    "summary": "Tafsir al-Mizan provides insight, noting that *Al-Mizan*, Allamah Tabatabai expands on this, framing the fire as a consequence of violating the sacredness of human dignity and social justice, core themes in Shia ethics. Surah Al-Humazah, revealed in Mecca, condemns those who mock others, spread slander, and obsess over material wealth. Verse 6—*nāru Allāhi l-mūqadah* (\"It is the fire of Allah, [eternally] fueled\")—describes the divine punishment awaiting such individuals. The term *nār* (fire) here signifies a blazing, transformative force, distinct from ordinary fire, as it is attributed directly to Allah (*nāru Allāh*), emphasizing its divine origin and unparalleled intensity. Imam Ja’far al-Sadiq (as) states, *\"This fire is kindled by the sins of those who mock the believers, scorn divine truths, and hoard wealth while neglecting the rights of the deprived. By aligning with the justice-oriented ethos of the Ahlul Bayt (AS), Muslims can transform societal \"fire\" into light—a community rooted in compassion, equity, and reverence for human dignity.",
    "layer2short": "In Surah al-Humazah 104:6, the phrase *\"nāru Allāhi l-mūqadah\"* (the fire of Allah, [eternally] fueled) is interpreted by classical Shia exegetes as a profound articulation of divine retribution for moral and spiritual corruption. The verse forms part of a broader condemnation of those who mock, slander, and hoard wealth unjustly, with the \"fire\" symbolizing both the metaphysical reality of Hell (*Jahannam*) and the ontological intensity of Allah’s wrath against moral transgressors.  ",
    "layer2short_urdu": "سورہ الحومازاہ 104: 6 میں ، یہ جملہ * \"نورو الہہی ایل مظیداہ\" * (اللہ کی آگ ، [ابدی طور پر] ایندھن) کی ترجمانی کلاسیکی شیعہ نے اخلاقی اور روحانی بدعنوانی کے لئے الہی بدلہ لینے کی گہری بات کی ہے۔ یہ آیت ان لوگوں کی وسیع تر مذمت کا ایک حصہ ہے جو دولت کا مذاق اڑانے ، بہتان اور دولت کو غیر منصفانہ طور پر جمع کرتے ہیں ، جس میں \"آگ\" جہنم کی استعاریاتی حقیقت (*جہنم*) دونوں کی علامت ہے اور اخلاقی حدود کے خلاف اللہ کے قہر کی اونٹولوجیکل شدت کی علامت ہے۔  "
  },
  "7": {
    "layer1": "In Surah Al-Humaza, verse 7 describes the terrifying fire of Hell (*al-nar*) as \"ٱلَّتِى تَطَّلِعُ عَلَى ٱلْأَفْـِٔدَةِ\" — \"which mounts directed at the hearts.\" This vivid imagery conveys a fire so intense that it engulfs not just the body but penetrates the deepest core of a person. The term *al-af’idah* (hearts) here refers to the innermost essence of human consciousness — the seat of intentions, emotions, and spiritual awareness. The verb *tattali’u* (mounts/climbs) implies a relentless, consuming force, suggesting that the fire exposes and punishes the corruption within one’s soul.  \n\nThis Meccan surah condemns those who mock others, hoard wealth arrogantly, and engage in backbiting (*humaza* and *lumaza*). Historically, it rebuked wealthy Meccan elites who ridiculed early Muslims, such as Walid ibn Mughira, a prominent critic of the Prophet (PBUH). The \"fire\" here symbolizes divine justice for those who weaponize speech or wealth to harm others, reflecting the Quranic principle that spiritual consequences mirror earthly actions.  \n\nIn Shia tafsir, scholars like Allama Tabatabai emphasize that *al-af’idah* represents the spiritual heart (*qalb*), which stores both good and evil. The fire’s assault on the heart signifies how sins like malice, envy, or slander corrode the soul, making it vulnerable to divine punishment. Imam Ali (AS) warned that \"the tongue is a beast — if unleashed, it tears,\" aligning with this verse’s warning against toxic speech.  \n\nToday, this verse urges Muslims to purify their intentions and guard against harmful behaviors — whether gossip on social media, economic exploitation, or pride in material status. It reminds us that true success lies in cultivating humility, compassion, and ethical conduct, shielding our \"hearts\" from the spiritual fires ignited by arrogance and harm to others. By aligning our actions with divine mercy, we protect our souls from the consequences of heedlessness.",
    "layer2": "In classical Shia exegesis, Surah al-Humazah 104:7—*\"Which mounts directed at the hearts\"*—is interpreted as a profound depiction of the spiritual and physical torment awaiting those who mock others, hoard wealth arrogantly, and deny divine accountability. The \"fire\" (nār) mentioned here is understood as the flames of Hell that penetrate the innermost being, targeting the *af’idah* (hearts or cores) of the condemned. \n\nAl-Tabrisi in *Majma al-Bayan* explains that the verse underscores the totality of divine punishment: the fire does not merely scorch the body but consumes the spiritual essence of a person. The \"hearts\" symbolize the seat of intention and moral consciousness, which, when corrupted by malice or arrogance, become receptors of divine wrath. This aligns with the Shia emphasis on *niyyah* (intention) as foundational to moral accountability. Al-Tabrisi notes that the fire’s targeting of hearts reflects the principle of *muwāzāt* (proportional recompense), wherein punishment corresponds to the spiritual harm inflicted by the sinner’s actions.\n\nIn *Al-Mizan*, Allamah Tabatabai expands this concept through the lens of ontological unity (*tawhid*), arguing that the verse illustrates how moral corruption distorts the soul’s innate disposition (*fitrah*), making it susceptible to existential disintegration in the Hereafter. The fire’s penetration of hearts signifies the collapse of the sinner’s spiritual defenses, exposing their inner void of faith. This interpretation resonates with Shia hadiths, such as those from Imam Jafar al-Sadiq, who taught that hearts hardened by sin become \"fuel for Hellfire\" (Nahj al-Balagha, Sermon 176).\n\nThe verse also connects to Shia eschatology, wherein the heart’s condition determines one’s posthumous state. Jurisprudentially, this reinforces the necessity of *tazkiyat al-nafs* (soul purification) and ethical conduct as pillars of faith. Classical commentators thus frame the verse as a stark reminder of the metaphysical consequences of moral failings, integral to Shia teachings on divine justice (*adl*) and the interplay between earthly actions and eternal recompense.",
    "layer3": "In contemporary Shia scholarship, Surah Humaza’s description of a fire that “mounts directed at the hearts” (7) is often interpreted as a metaphor for the spiritual and psychological consequences of malice, greed, and social harm. Ayatollah Naser Makarem Shirazi, in his *Tafsir Nemuneh*, emphasizes that the “fire” here transcends physical punishment, symbolizing the self-destructive nature of arrogance and backbiting—a theme resonant in an era of cyberbullying and online toxicity. Modern scholars like Dr. Ahmed Vaezi connect this to neuroscience, noting how chronic negativity and hatred trigger cortisol spikes, damaging cardiovascular health and mental well-being, effectively “burning” the heart from within.  \n\nThe verse’s relevance extends to today’s hyper-competitive, materialistic societies, where wealth-hoarding and exploitation—critiqued in the surah—mirror global income inequality and corporate greed. Scholars such as Sayyid Mohammad Ali Shomali frame this as a call for economic justice, urging Muslims to combat systemic inequity through zakat and ethical consumption. Philosophically, the “hearts” targeted by this fire represent moral consciousness; its “mounting” flames reflect how unchecked ego erodes empathy, a crisis evident in rising xenophobia and polarization.  \n\nInterfaith parallels emerge in Buddhist teachings on the “three poisons” (greed, hatred, delusion) and Christian warnings against “hardened hearts.” Multiculturally, the verse invites reflection on how spiritual decay fuels societal crises—from climate denial to warfare—rooted in humanity’s failure to nurture compassion. In essence, this ancient verse becomes a mirror for modern souls, urging introspection and collective responsibility in an interconnected world.",
    "layer4": "The fire described in Surah al-Humazah (104:7) as \"mounting upon the hearts\" is profoundly explained by the Ahlul Bayt (peace be upon them) as a spiritual reality manifesting in this world and the next. Imam Ja'far al-Sadiq (as) states, *\"The fire that scorches the hearts in this life is the fire of hatred, envy, and hypocrisy—it is a spark from the same inferno that will consume the disbelievers in the Hereafter\"* (Tafsir al-Qummi). The verse thus warns not only of a physical punishment but of the spiritual corrosion that occurs when the heart becomes a vessel for malice and worldly attachment.\n\nThe Ahlul Bayt teach that the \"heart\" (qalb) is the seat of spiritual perception and connection to divine truth. Imam Ali (as) emphasizes in Nahj al-Balagha: *\"The heart is the sanctuary of Allah; do not seat anyone therein except Him.\"* When hearts are dominated by greed, backbiting, or neglect of divine obligations—as condemned in Surah al-Humazah—they become fuel for the Hellfire. Conversely, hearts purified through love for the Ahlul Bayt and adherence to their teachings are illuminated by the light of Wilayah (divine guardianship). \n\nLady Fatimah (as) taught that *\"the fire of this world is extinguished by tears of repentance, but the fire of the Hereafter is quenched only by the intercession of those whom Allah has purified\"* (Bihar al-Anwar). This underscores the necessity of aligning one’s heart with the Imams’ guidance, whose spiritual authority (Imamah) acts as a shield against inner and outer corruption. \n\nPractical guidance includes daily self-accounting (muhasabah) to cleanse the heart of malice, frequent recitation of Dhikr (e.g., *La ilaha illallah*) to strengthen divine connection, and nurturing sincere love for the Prophet’s Household. As Imam Zayn al-Abidin (as) prays in Sahifa Sajjadiyyah: *\"O Allah, place in my heart the light of certainty and the purity of intention, that I may witness Your signs within my very soul.\"* By anchoring the heart in remembrance of Allah and loyalty to the Ahlul Bayt, believers transform their inner state, turning the \"mounting fire\" into the coolness of divine proximity.",
    "layer1_urdu": "سورہ الحومازا میں ، آیت نمبر 7 میں جہنم کی خوفناک آگ (*النار*) کو \"ٱlafّatatِى تالی ط ط ط ط ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ\"-\"کے طور پر بیان کیا گیا ہے۔\" یہ واضح منظر کشی اتنی شدید آگ سے آگئی ہے کہ یہ نہ صرف جسم کو گھیرے میں لے جاتا ہے بلکہ کسی شخص کے گہرے حصے میں داخل ہوتا ہے۔ اصطلاح * الافیداہ * (دلوں) سے مراد انسانی شعور کے اندرونی جوہر-ارادوں ، جذبات اور روحانی بیداری کی نشست ہے۔ فعل * ٹیٹالیؤ * (پہاڑ/چڑھائی) ایک لاتعداد ، استعمال کرنے والی طاقت کا مطلب ہے ، جس سے یہ معلوم ہوتا ہے کہ آگ کسی کی روح کے اندر بدعنوانی کو بے نقاب اور سزا دیتی ہے۔  \n\nیہ مکہ سرہ ان لوگوں کی مذمت کرتا ہے جو دوسروں کا مذاق اڑاتے ہیں ، دولت کو تکبر کے ساتھ جمع کرتے ہیں ، اور بیکنگ میں مشغول ہوتے ہیں (*ہمازا*اور*لومازا*)۔ تاریخی طور پر ، اس نے دولت مند میکن کے اشرافیہ کو سرزنش کی جنہوں نے ابتدائی مسلمانوں کو طنز کیا ، جیسے نبی صلی اللہ علیہ وآلہ وسلم کے ایک ممتاز نقاد ولید ابن مغرو۔ یہاں \"آگ\" ان لوگوں کے لئے خدائی انصاف کی علامت ہے جو دوسروں کو نقصان پہنچانے کے لئے تقریر یا دولت کو ہتھیار ڈالتے ہیں ، اور قرآنی اصول کی عکاسی کرتے ہیں کہ روحانی نتائج زمینی افعال کو آئینہ دار کرتے ہیں۔  \n\nشیعہ طافسیر میں ، علامہ تبتابائی جیسے اسکالرز اس بات پر زور دیتے ہیں کہ*الافیداہ*روحانی دل (*قلیب*) کی نمائندگی کرتا ہے ، جو اچھ and ے اور برے دونوں کو محفوظ کرتا ہے۔ دل پر آگ کا حملہ اس بات کی نشاندہی کرتا ہے کہ کس طرح بددیانتی ، حسد ، یا غیبت جیسے گناہ روح کو کھرچتے ہیں ، جس سے یہ خدائی سزا کا خطرہ ہوتا ہے۔ امام علی (ع) نے متنبہ کیا کہ \"زبان ایک درندہ ہے - اگر ان کو ختم کیا جاتا ہے تو ، آنسو بہا جاتا ہے ،\" اس آیت کی زہریلی تقریر کے خلاف انتباہ کے ساتھ صف بندی کرتے ہوئے۔  \n\nآج ، یہ آیت مسلمانوں پر زور دیتی ہے کہ وہ اپنے ارادوں کو پاک کرے اور نقصان دہ طرز عمل سے بچ سکے - چاہے سوشل میڈیا پر گپ شپ ، معاشی استحصال ، یا مادی حیثیت پر فخر ہے۔ یہ ہمیں یاد دلاتا ہے کہ حقیقی کامیابی عاجزی ، ہمدردی اور اخلاقی طرز عمل کو فروغ دینے میں ہے ، اور دوسروں کو تکبر اور نقصان سے بھڑک اٹھی ہوئی روحانی آگ سے ہمارے \"دلوں\" کو بچانے میں ہے۔ اپنے اعمال کو خدائی رحمت کے ساتھ سیدھ میں کرکے ، ہم اپنی جانوں کو غفلت کے نتائج سے بچاتے ہیں۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الحومازاہ 104: 7-*\"جو دلوں پر ہدایت کی گئی ہے\"*-کو روحانی اور جسمانی عذاب کی گہری عکاسی کے طور پر سمجھا جاتا ہے جو دوسروں کا مذاق اڑاتے ہیں ، دولت کو تکبر سے دولت کا ذخیرہ کرتے ہیں اور خدائی احتساب سے انکار کرتے ہیں۔ یہاں ذکر کردہ \"آگ\" (nār) کو جہنم کے شعلوں کے طور پر سمجھا جاتا ہے جو اندرونی وجود میں داخل ہوتے ہیں ، اور مذمت کے * افیداہ * (دلوں یا کوروں) کو نشانہ بناتے ہیں۔ \n\n* ماجما البیان * میں الاتبریسی نے وضاحت کی ہے کہ آیت الہی سزا کی مکمل حیثیت کی نشاندہی کرتی ہے: آگ محض جسم کو نہیں جھلستی ہے بلکہ کسی شخص کے روحانی جوہر کو کھاتی ہے۔ \"دل\" نیت اور اخلاقی شعور کی نشست کی علامت ہیں ، جو ، جب بددیانتی یا تکبر سے خراب ہوجاتے ہیں تو ، الہی غضب کے رسیپٹر بن جاتے ہیں۔ یہ شیعہ پر زور دینے کے ساتھ * نیہہ * (ارادے) پر اخلاقی احتساب کی بنیاد کے طور پر ہم آہنگی کرتا ہے۔ الاتبریسی نے نوٹ کیا ہے کہ آگ کے دلوں کو نشانہ بنانا * مووزیت * (متناسب بدلہ) کے اصول کی عکاسی کرتا ہے ، جس میں سزا گنہگار کے اعمال سے ہونے والے روحانی نقصان کے مساوی ہے۔\n\n*المزان*میں ، الامہ تبتابائی نے اس تصور کو اونٹولوجیکل اتحاد (*توہید*) کے عینک کے ذریعے وسعت دی ہے ، اور یہ استدلال کیا ہے کہ یہ آیت اس بات کی عکاسی کرتی ہے کہ اخلاقی بدعنوانی روح کے فطری انداز (*فیدرہ*) کو کس طرح مسخ کرتی ہے ، جس سے یہ حجم میں وجود کی تفریق کا شکار ہوجاتا ہے۔ آگ کا دلوں میں دخول گنہگار کے روحانی دفاع کے خاتمے کی نشاندہی کرتا ہے ، جس سے ان کے اندرونی عقیدے کو بے نقاب کیا جاتا ہے۔ یہ تشریح شیعہ حدیث کے ساتھ گونجتی ہے ، جیسے امام جعفر السادق سے تعلق رکھنے والے افراد ، جنہوں نے سکھایا تھا کہ گناہ کی وجہ سے سخت دل \"جہنم کی آگ کے لئے ایندھن\" بن جاتے ہیں (ناہج البالاگھا ، خطبہ 176)۔\n\nیہ آیت شیعہ ایسکیٹولوجی سے بھی منسلک ہوتی ہے ، جس میں دل کی حالت کسی کی بعد کی حالت کا تعین کرتی ہے۔ فقہی طور پر ، اس سے * تزکیت النف * (روح طہارت) اور اخلاقی طرز عمل کی ضرورت کو تقویت ملتی ہے۔ اس طرح کلاسیکی مبصرین اخلاقی ناکامیوں کے استعاریاتی نتائج کی ایک بالکل یاد دہانی کے طور پر آیت کو تیار کرتے ہیں ، جو الہی انصاف (*ADL*) پر شیعہ تعلیمات کے لئے لازمی طور پر اور زمینی افعال اور ابدی بدلاؤ کے مابین باہمی مداخلت کرتے ہیں۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ ہمازا کی آگ کے بارے میں تفصیل جو \"دلوں پر چلنے والے پہاڑوں\" (7) کو اکثر بددیانتی ، لالچ اور معاشرتی نقصان کے روحانی اور نفسیاتی نتائج کے استعارے کے طور پر سمجھا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں اس بات پر زور دیا ہے کہ یہاں \"آگ\" جسمانی سزا سے تجاوز کرتی ہے ، جو تکبر اور بیکنگ کی خود تباہ کن نوعیت کی علامت ہے۔ ڈاکٹر احمد وازی جیسے جدید اسکالرز اس کو نیورو سائنس سے مربوط کرتے ہیں ، اس بات کا ذکر کرتے ہوئے کہ کس طرح دائمی نفی اور نفرت کو ٹرگر کورٹیسول اسپائکس ، قلبی صحت اور ذہنی تندرستی کو نقصان پہنچا ہے ، جس سے اندر سے دل کو مؤثر طریقے سے \"جلایا جاتا ہے\"۔  \n\nاس آیت کی مطابقت آج کے انتہائی مسابقتی ، مادیت پسند معاشروں تک پھیلی ہوئی ہے ، جہاں دولت سے متعلق اور استحصال-سورت میں تنقید کی گئی ہے۔ سید محمد علی شومالی جیسے اسکالرز معاشی انصاف کے مطالبے کے طور پر فریم کرتے ہیں ، اور مسلمانوں پر زور دیتے ہیں کہ وہ زکوٰیت اور اخلاقی کھپت کے ذریعے نظامی عدم مساوات کا مقابلہ کریں۔ فلسفیانہ طور پر ، اس آگ سے نشانہ بننے والے \"دل\" اخلاقی شعور کی نمائندگی کرتے ہیں۔ اس کے \"بڑھتے ہوئے\" شعلوں کی عکاسی ہوتی ہے کہ غیر جانچ شدہ انا ہمدردی کو کس طرح ختم کرتی ہے ، جو بڑھتی ہوئی زینوفوبیا اور پولرائزیشن میں ایک بحران ظاہر ہوتا ہے۔  \n\nانٹرفیتھ متوازی \"تین زہر\" (لالچ ، نفرت ، فریب) اور \"سخت دلوں\" کے خلاف عیسائی انتباہات پر بدھ مت کی تعلیمات میں ابھرتے ہیں۔ کثیر الثقافتی طور پر ، یہ آیت اس بات کی عکاسی کی دعوت دیتی ہے کہ کس طرح روحانی کشی معاشرتی بحرانوں کو ایندھن دیتی ہے - آب و ہوا سے انکار سے جنگ تک - انسانیت کی ہمدردی کی پرورش میں ناکامی میں جڑی ہوئی ہے۔ خلاصہ یہ ہے کہ یہ قدیم آیت جدید روحوں کے لئے آئینہ بن جاتی ہے ، جس سے باہم مربوط دنیا میں خود شناسی اور اجتماعی ذمہ داری پر زور دیا جاتا ہے۔",
    "layer4_urdu": "سورہ الحومازاہ (104: 7) میں \"دلوں پر بڑھتے ہوئے\" کے طور پر بیان کی گئی آگ کو اس دنیا اور اگلے میں ایک روحانی حقیقت کے طور پر اہل بیت (ان پر سلامتی) کے ذریعہ گہری وضاحت کی گئی ہے۔ امام جافر السادق (ع) میں کہا گیا ہے ، * \"اس زندگی میں دلوں کو جلانے والی آگ نفرت ، حسد اور منافقت کی آگ ہے-یہ اسی نادانی کی ایک چنگاری ہے جو اس کے بعد کافروں کو استعمال کرے گی\" * (طافسیر القمی)۔ اس طرح اس آیت میں نہ صرف جسمانی سزا بلکہ روحانی سنکنرن سے بھی خبردار کیا گیا ہے جو اس وقت ہوتا ہے جب دل بددیانتی اور دنیاوی لگاؤ کے لئے برتن بن جاتا ہے۔\n\nاہل بیت یہ سکھاتے ہیں کہ \"دل\" (QALB) روحانی تاثر اور الہی سچائی سے تعلق کی نشست ہے۔ امام علی (ع) ناہج البالاگھا میں زور دیتے ہیں: * \"دل اللہ کا حرمت ہے۔ اس کے سوا کسی کو بھی نہیں بٹھائیں۔\" * جب دلوں پر لالچ ، بیکنگ ، یا الہی ذمہ داریوں کی نظرانداز کا غلبہ ہوتا ہے-جیسا کہ سورہ الحومازہ میں مذمت کی جاتی ہے-وہ ہیل فائر کے لئے ایندھن بن جاتے ہیں۔ اس کے برعکس ، اہل بیت کے لئے محبت کے ذریعے پاک دل اور ان کی تعلیمات پر عمل پیرا ہونے والے دلوں کو ولیہ (خدائی سرپرستی) کی روشنی سے روشن کیا جاتا ہے۔ \n\nلیڈی فاطمہ (ع) نے سکھایا کہ * \"اس دنیا کی آگ توبہ کے آنسوؤں سے بجھ جاتی ہے ، لیکن اس کے بعد کی آگ صرف ان لوگوں کی شفاعت سے بجھ جاتی ہے جن کو اللہ نے پاک کیا ہے\" * (بہار الانور)۔ اس سے کسی کے دل کو اماموں کی رہنمائی کے ساتھ سیدھ میں لانے کی ضرورت کی نشاندہی ہوتی ہے ، جس کا روحانی اختیار (امامہ) اندرونی اور بیرونی بدعنوانی کے خلاف ڈھال کا کام کرتا ہے۔ \n\nعملی رہنمائی میں روزانہ خود حساب کتاب (محسابہ) شامل ہے تاکہ بددیانتی کے دل کو صاف کیا جاسکے ، الہی تعلق کو مستحکم کرنے کے لئے ، دھک کی بار بار تلاوت (جیسے ، *لا الہالہ اللہ *) اور نبی کے گھر والے سے مخلصانہ محبت کی پرورش کرنا۔ جیسا کہ امام زین العبدین (ع) ساہفا سججدیہ میں دعا کرتے ہیں: * \"اے اللہ ، میرے دل میں یقین کی روشنی اور نیت کی پاکیزگی کی روشنی میں ، کہ میں آپ کی روح کے اندر آپ کی علامتوں کا مشاہدہ کرسکتا ہوں\"۔ قربت",
    "layer5": "In interpreting Surah al-Humaza 104:7, both Shia and Sunni scholarly traditions converge on understanding the \"fire that mounts directed at the hearts\" as a vivid eschatological image of Hell’s punishment penetrating human consciousness. Al-Tabari (Sunni) and al-Tabrisi (Shia) both emphasize the verse’s connection to the psychological torment of the afterlife, with al-Tabari’s *Jami al-Bayan* describing it as fire reaching \"the innermost depths\" of sinners, while al-Tabrisi’s *Majma al-Bayan* notes its capacity to \"expose hidden intentions.\" This aligns with shared Quranic themes of divine justice and the heart (*qalb*) as the seat of moral accountability.\n\nKey differences emerge in theological emphasis. Sunni exegetes like Ibn Kathir (*Tafsir al-Quran al-Azim*) and al-Qurtubi (*Al-Jami li-Ahkam*) often contextualize the verse within literal descriptions of Hell’s physicality, citing hadith about bodily resurrection. In contrast, Shia scholars such as al-Tabatabai (*Al-Mizan*) and al-Qummi (*Tafsir al-Qummi*) integrate metaphysical dimensions, interpreting the \"hearts\" as symbols of spiritual corruption. Al-Tabatabai links the fire’s penetration to the soul’s susceptibility to evil, reflecting the Imami emphasis on inner purification through adherence to the Ahl al-Bayt’s guidance.\n\nHistorically, these divergences stem from distinct hermeneutical priorities: Sunni tafsir often prioritizes transmitted narratives (hadith) from the Prophet’s companions, while Shia exegesis incorporates the Imams’ teachings as divinely inspired elucidations. Both traditions, however, reinforce the verse’s ethical imperative against slander and materialism. Practically, Shia interpretations may accentuate introspection and spiritual reform, whereas Sunni readings might emphasize outward accountability before divine judgment. Such nuances reflect complementary dimensions of Islamic eschatology rather than contradictory dogmas.",
    "layer5_urdu": "سورہ الحومازا 104: 7 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی علمی روایات دونوں ہی \"آگ کو سمجھنے پر دل کی طرف جانے والی آگ\" کو سمجھنے پر متحرک ہوجاتی ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں کے بعد کی زندگی کے نفسیاتی عذاب سے آیت کے اس تعلق پر زور دیتے ہیں ، العباری کے * جامی البیان * نے اسے گنہگاروں کی \"اندرونی گہرائی\" تک پہنچانے کے بارے میں بیان کیا ہے ، جبکہ العبیریسی کے * ماجما البیان * کو بیان کرتے ہیں۔ یہ اخلاقی احتساب کی نشست کے طور پر الہی انصاف اور دل (*QALB*) کے مشترکہ قرآنی موضوعات کے ساتھ ہم آہنگ ہے۔\n\nکلیدی اختلافات مذہبی زور میں ابھرتے ہیں۔ ابن کتھیر (*طافسیر القوران الازیم*) اور القوروبی (*الجامی لی احکم*) جیسے سنی کی منظوری اکثر جہنم کی جسمانییت کی لفظی وضاحت کے اندر آیت کو سیاق و سباق میں لیتی ہے ، اور اس نے جسمانی قیامت کے بارے میں حدیث کا حوالہ دیتے ہوئے کہا ہے۔ اس کے برعکس ، شیعہ اسکالرز جیسے الاتعباتابائی (*المزان*) اور القومی (*طافسیر القومی*) استعاریاتی طول و عرض کو مربوط کرتے ہیں ، اور \"دلوں\" کو روحانی بدعنوانی کی علامت قرار دیتے ہیں۔ الاتاباتابائی آگ کے دخول کو روح کے حساسیت سے برائی کے ساتھ جوڑتا ہے ، جو اے ایچ ایل البائٹ کی رہنمائی پر عمل پیرا ہونے کے ذریعہ اندرونی طہارت پر امامی زور کی عکاسی کرتا ہے۔\n\nتاریخی طور پر ، یہ تغیرات الگ الگ ہرمینیٹیکل ترجیحات سے پیدا ہوتے ہیں: سنی طافسر اکثر نبی of کے ساتھیوں سے منتقلی کے بیانیے (حدیث) کو ترجیح دیتے ہیں ، جبکہ شیعہ استثنیٰ نے اماموں کی تعلیمات کو علمی طور پر متاثر کرنے کے طور پر شامل کیا ہے۔ تاہم ، دونوں روایات نے بہتان اور مادیت پرستی کے خلاف آیت کی اخلاقی لازمی کو تقویت بخشی ہے۔ عملی طور پر ، شیعہ تشریحات انتشار اور روحانی اصلاحات کو تیز کرسکتی ہیں ، جبکہ سنی پڑھنے سے خدائی فیصلے سے پہلے ظاہری احتساب پر زور دیا جاسکتا ہے۔ اس طرح کی باریکیوں نے متضاد ڈاگماس کے بجائے اسلامی اسکاٹولوجی کے تکمیلی جہتوں کی عکاسی کی۔",
    "summary": "Allama Tabatabai in Tafsir al-Mizan notes that *Al-Mizan*, Allamah Tabatabai expands this concept through the lens of ontological unity (*tawhid*), arguing that the verse illustrates how moral corruption distorts the soul’s innate disposition (*fitrah*), making it susceptible to existential disintegration in the Hereafter. In Surah Al-Humaza, verse 7 describes the terrifying fire of Hell (*al-nar*) as \"ٱلَّتِى تَطَّلِعُ عَلَى ٱلْأَفْـِٔدَةِ\" — \"which mounts directed at the hearts. \" This vivid imagery conveys a fire so intense that it engulfs not just the body but penetrates the deepest core of a person. The term *al-af’idah* (hearts) here refers to the innermost essence of human consciousness — the seat of intentions, emotions, and spiritual awareness. Imam Ja'far al-Sadiq (as) states, *\"The fire that scorches the hearts in this life is the fire of hatred, envy, and hypocrisy—it is a spark from the same inferno that will consume the disbelievers in the Hereafter\"* (Tafsir al-Qummi). By aligning our actions with divine mercy, we protect our souls from the consequences of heedlessness.",
    "layer2short": "In classical Shia exegesis, Surah al-Humazah 104:7—*\"Which mounts directed at the hearts\"*—is interpreted as a profound depiction of the spiritual and physical torment awaiting those who mock others, hoard wealth arrogantly, and deny divine accountability. The \"fire\" (nār) mentioned here is understood as the flames of Hell that penetrate the innermost being, targeting the *af’idah* (hearts or cores) of the condemned. ",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الحومازاہ 104: 7-*\"جو دلوں پر ہدایت کی گئی ہے\"*-کو روحانی اور جسمانی عذاب کی گہری عکاسی کے طور پر سمجھا جاتا ہے جو دوسروں کا مذاق اڑاتے ہیں ، دولت کو تکبر سے دولت کا ذخیرہ کرتے ہیں اور خدائی احتساب سے انکار کرتے ہیں۔ یہاں ذکر کردہ \"آگ\" (nār) کو جہنم کے شعلوں کے طور پر سمجھا جاتا ہے جو اندرونی وجود میں داخل ہوتے ہیں ، اور مذمت کے * افیداہ * (دلوں یا کوروں) کو نشانہ بناتے ہیں۔ "
  },
  "8": {
    "layer1": "In Surah Al-Humaza, verse 8, Allah declares, *\"Innaha alayhim mu’sadah\"*—\"Indeed, Hellfire will be closed down upon them.\" This powerful statement concludes a passage condemning those who mock others, engage in backbiting (*humaza*), and obsess over material wealth. The term *mu’sadah* derives from the root *a-sa-da*, meaning \"to shut tightly\" or \"seal.\" Classical Shia commentators like Allama Tabatabai explain that this describes Hell as a prison with no exit, emphasizing the permanence of punishment for those who persistently harm others through speech or arrogance. The verse serves as a stark reminder that such behavior isn’t merely a social flaw but a spiritual corruption with eternal consequences.\n\nHistorically, this surah is said to have been revealed about individuals in Mecca who ridiculed the Prophet Muhammad (PBUH) and his followers, such as Walid ibn Mughira and others known for arrogance and slander. Their actions exemplified the *humaza* (scornful gossip) and *lumaza* (mocking gestures) condemned in the surah. The imagery of a sealed Hellfire underscores divine justice: just as their malice \"trapped\" others in humiliation, they will be trapped in retribution.\n\nIn modern contexts, this verse urges Muslims to purify their speech and intentions. Gossip, online slander, and belittling others—common in today’s interconnected world—are spiritual dangers. The verse also critiques materialism; hoarding wealth while ignoring community needs mirrors the condemned mindset. Practically, it calls for self-reflection: Are our words building others up or tearing them down? Do we use our resources compassionately? By embodying the Quranic ethics of humility and kindness, we align with the teachings of the Ahlul Bayt, who emphasized guarding one’s tongue and wealth as acts of worship. The \"sealed\" Hellfire isn’t just a threat but a motivator to cultivate a heart sealed with God-consciousness.",
    "layer2": "In Surah al-Humazah, verse 8 describes the fate of those who mock and slander others: *\"Indeed, Hellfire will be closed down upon them.\"* Classical Shia exegetes emphasize the theological and eschatological implications of this closure (*mu’sadah*), drawing from the teachings of the Ahl al-Bayt and established tafsir traditions. Tabrisi, in *Majma al-Bayan*, interprets *mu’sadah* as a state of permanent confinement, where the gates of Hell are sealed irrevocably, leaving no possibility of escape. This aligns with the Quranic principle that the punishment of the arrogant and malicious is both inescapable and eternal, reflecting divine justice (*‘adl*) for those who persistently reject moral accountability.\n\nTabatabai, in *Al-Mizan*, expands on this by linking the verse to the ontological nature of human deeds. He argues that the \"closure\" is not merely physical but a metaphysical manifestation of the sinners’ own spiritual corruption. Their malicious acts—backbiting, scorn, and accumulation of wealth for vanity—create a barrier (*hijab*) between their souls and divine mercy, making Hell a self-imposed prison. This aligns with the Shia emphasis on the intrinsic consequences of actions (*jazā’ al-a‘māl*), wherein moral and spiritual choices directly shape one’s afterlife. \n\nThe verse also resonates with Shia jurisprudence, which condemns backbiting (*ghībah*) as a major sin, akin to spiritual murder. The closure of Hell thus symbolizes the culmination of a life spent violating the rights (*huqūq*) of others, a theme reiterated in narrations from Imam Jafar al-Sadiq, who taught that slanderers \"build their homes in Hell brick by brick.\" Ultimately, this verse underscores the Shia theological nexus between ethics, divine justice, and the eternal consequences of human agency, urging believers to cultivate inner purity and social responsibility.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Humazah’s eighth verse—describing Hell as \"closed down\" upon the arrogant and malicious—is often interpreted through the lens of existential and societal consequences. Scholars like Sayyed Mohammed Hussein Fadlallah and contemporary thinkers such as Dr. Ahmed Haneef emphasize that the verse’s imagery of entrapment reflects the self-destructive outcomes of moral corruption. The \"sealing\" of Hellfire symbolizes the inescapable repercussions of systemic greed, social exploitation, and the dehumanization of others, themes deeply resonant in an era marked by wealth inequality, environmental collapse, and digital malice.  \n\nModern tafsir connects this closure to psychological and ecological realities. Psychologically, the verse mirrors the isolation felt in modern alienation—a \"hell\" of one’s own making through materialism or online toxicity. Ecologically, scholars like Dr. Fatima Akef draw parallels to humanity’s unsustainable consumption, arguing that environmental degradation represents a collective \"closure\" of natural systems, trapping future generations in crises. Philosophically, the verse critiques neoliberal individualism, urging communal responsibility over selfish accumulation.  \n\nInterfaith dialogues highlight shared ethical concerns: Buddhist teachings on karmic consequences, Christian warnings about spiritual blindness, and secular humanist critiques of late-stage capitalism all echo the Quranic principle that oppression and arrogance collapse inward. For Shia communities, this verse calls for activism against systemic injustice, aligning with Imam Ali’s teachings on social equity. In a world fractured by extremism and climate denial, the verse becomes a timeless warning: moral bankruptcy, left unchecked, becomes its own prison.",
    "layer4": "The verse \"Indeed, Hellfire will be closed down upon them\" (Quran 104:8) is a profound warning against the spiritual disease of arrogance and malicious speech. The Ahlul Bayt (peace be upon them) taught that the \"closure\" of Hell is not merely a physical confinement but a metaphysical reality reflecting the state of a soul severed from divine mercy. Imam Ja'far al-Sadiq (peace be upon him) states in *Tafsir al-Qummi*: \"The fire is sealed upon them because their hearts were sealed against the recognition of Allah’s proofs [the Imams], and thus their punishment becomes an extension of their own spiritual blindness.\"  \n\nThis verse condemns those who mock and backbite, traits that stem from rejecting the *Wilayah* (divinely ordained guardianship) of the Ahlul Bayt. The Prophet Muhammad (peace be upon him and his family) said, \"The backbiter will not enter Paradise\" (*Bihar al-Anwar*), linking slander to eternal ruin. Lady Fatimah (peace be upon her) emphasized in her famed sermon: \"The unjust who sever the rope of Allah’s covenant will be confined in the Fire they themselves ignited.\" Here, the \"closure\" of Hell mirrors the self-imposed barriers created by denying truth and nurturing hatred for the *Muhammadan light*.  \n\nPractically, this verse calls believers to purify their tongues and hearts. Imam Ali (peace be upon him) taught, \"Guard your speech as you guard your deeds, for the tongue can drag you into the depths of Hell.\" Spiritual development requires embracing humility, avoiding gossip, and actively upholding the rights of others—core principles of the Ahlul Bayt’s ethical system. By aligning with the *Imamah*, believers transform their inner state, replacing malice with love for Allah’s chosen guides. The \"closed\" Hellfire thus becomes a metaphor for the soul’s liberation: only through the light of the Ahlul Bayt can one escape the prison of ego and attain nearness to the Divine.",
    "layer1_urdu": "سورت الحومازا میں ، آیت 8 ، اللہ نے اعلان کیا ، *\"اننہا الہیم مو’ * *-\"واقعی ، ان پر جہنم کی آگ بند کردی جائے گی۔\" اس طاقتور بیان میں ان لوگوں کی مذمت کرنے والے ایک حوالہ کا اختتام کیا گیا ہے جو دوسروں کا مذاق اڑاتے ہیں ، بیکنگ (*ہمازا*) میں مشغول ہوتے ہیں ، اور مادی دولت پر جنون رکھتے ہیں۔ اصطلاح *mu’sadah *جڑ سے ماخوذ ہے *a-sa-da *، جس کا مطلب ہے \"مضبوطی سے بند کرنا\" یا \"مہر\"۔ الامہ تبتابائی جیسے کلاسیکی شیعہ مبصرین نے وضاحت کی ہے کہ اس سے جہنم کو جیل کے طور پر بیان کیا گیا ہے جس میں کوئی باہر نکل نہیں جاتا ہے ، اور ان لوگوں کے لئے سزا کے استحکام پر زور دیتا ہے جو تقریر یا تکبر کے ذریعہ دوسروں کو مستقل طور پر نقصان پہنچاتے ہیں۔ آیت ایک بالکل یاد دہانی کے طور پر کام کرتی ہے کہ اس طرح کا سلوک محض ایک معاشرتی خامی نہیں بلکہ ابدی نتائج کے ساتھ روحانی بدعنوانی ہے۔\n\nتاریخی طور پر ، کہا جاتا ہے کہ یہ سورہ مکہ کے ان افراد کے بارے میں ظاہر ہوئی ہے جنہوں نے حضرت محمد (صلی اللہ علیہ وآلہ وسلم) اور اس کے پیروکار ، جیسے ولید ابن مغرو اور تکبر اور بہتان کے لئے جانے جانے والے دیگر افراد کا مذاق اڑایا۔ ان کے اعمال نے سورت میں * ہمازا * (طنزیہ گپ شپ) اور * لومازا * (طنز کرنے والے اشاروں) کی مثال دی۔ مہربند جہنم کی منظر کشی الہی انصاف کی نشاندہی کرتی ہے: جس طرح ان کی بدنامی دوسروں کو بھی ذلت میں پھنساتی ہے ، اسی طرح وہ بدلہ میں پھنس جائیں گے۔\n\nجدید سیاق و سباق میں ، یہ آیت مسلمانوں کو اپنی تقریر اور ارادوں کو پاک کرنے کی تاکید کرتی ہے۔ گپ شپ ، آن لائن بہتان ، اور دوسروں کو پیٹنے والی دوسروں کو - آج کی باہم منسلک دنیا میں کمون spiritual روحانی خطرات ہیں۔ آیت مادیت پر بھی تنقید کرتی ہے۔ معاشرے کی ضروریات کو نظرانداز کرتے ہوئے دولت جمع کرنا مذمت کی ذہنیت کا آئینہ دار ہے۔ عملی طور پر ، اس میں خود کی عکاسی کا مطالبہ کیا گیا ہے: کیا ہمارے الفاظ دوسروں کو تیار کر رہے ہیں یا انہیں پھاڑ رہے ہیں؟ کیا ہم اپنے وسائل کو ہمدردی کے ساتھ استعمال کرتے ہیں؟ عاجزی اور احسان کی قرآنی اخلاقیات کو مجسم بناتے ہوئے ، ہم اہل بیت کی تعلیمات کے ساتھ ہم آہنگ ہیں ، جنھوں نے کسی کی زبان اور دولت کو عبادت کے کاموں کی حفاظت پر زور دیا۔ \"مہربند\" جہنم کی فائر صرف ایک خطرہ نہیں ہے بلکہ خدا کے شعور سے مہر بند دل کی کاشت کرنے کا محرک ہے۔",
    "layer2_urdu": "سورہ الحومازاہ میں ، آیت 8 میں دوسروں کا مذاق اڑانے اور بہتان کی تقدیر کی وضاحت کی گئی ہے:*\"واقعی ، جہنم کی آگ ان پر بند ہوجائے گی۔\"*کلاسیکی شیعہ اس بندش کے مذہبی اور شعوری مضمرات پر زور دیتے ہیں (*mu’sadah*) ، احل البیٹ اور قائم کردہ روایتوں کی تعلیمات سے کھینچتے ہیں۔ تبریسی ، *مجسما البیان *میں ، *mu’sadah *کو مستقل قید کی حالت کے طور پر ترجمانی کرتا ہے ، جہاں جہنم کے دروازوں کو اٹل میں مہر لگایا جاتا ہے ، جس سے فرار کا کوئی امکان نہیں رہتا ہے۔ یہ قرآنی اصول کے مطابق ہے کہ متکبر اور بدنیتی پر مبنی سزا دونوں ناگزیر اور ابدی ہیں ، جو اخلاقی احتساب کو مستقل طور پر مسترد کرتے ہیں ان کے لئے الہی انصاف (*‘ADL*) کی عکاسی کرتے ہیں۔\n\nتبتابائی ، *المزان *میں ، اس آیت کو انسانی اعمال کی نظریاتی نوعیت سے جوڑ کر اس پر پھیلتا ہے۔ اس کا استدلال ہے کہ \"بندش\" محض جسمانی نہیں بلکہ گنہگاروں کی اپنی روحانی بدعنوانی کا استعاریاتی مظہر ہے۔ ان کی بدنیتی پر مبنی حرکتیں-باطل کے لئے دولت کے ساتھ کام کرنے ، طعنہ زنی اور جمع کرنے-اپنی جانوں اور خدائی رحمت کے مابین ایک رکاوٹ (*حجاب*) پیدا کرتی ہیں ، جس سے جہنم کو خود ساختہ جیل بنا دیا جاتا ہے۔ یہ افعال کے اندرونی نتائج (*جاز ’العمل*) پر شیعہ زور دینے کے ساتھ ہم آہنگ ہے ، جس میں اخلاقی اور روحانی انتخاب براہ راست کسی کے بعد کی زندگی کو تشکیل دیتے ہیں۔ \n\nیہ آیت شیعہ فقہ کے ساتھ بھی گونجتی ہے ، جو روحانی قتل کے مترادف (*غبہ*) کو ایک بڑے گناہ کی حیثیت سے مذمت کرتی ہے۔ اس طرح جہنم کی بندش دوسروں کے حقوق (*ہوق*) کی خلاف ورزی کرنے والی زندگی کے اختتام کی علامت ہے ، جس کا ایک موضوع امام جعفر السادق کی داستانوں میں دہرایا گیا ہے ، جس نے یہ سکھایا تھا کہ \"اینٹوں کے ذریعہ جہنم اینٹوں میں اپنے گھروں کی تعمیر\"۔ آخر کار ، یہ آیت اخلاقیات ، الہی انصاف ، اور انسانی ایجنسی کے دائمی نتائج کے مابین شیعہ مذہبی گٹھ جوڑ کی نشاندہی کرتی ہے ، اور مومنوں کو اندرونی پاکیزگی اور معاشرتی ذمہ داری کو فروغ دینے کی تاکید کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ الحومازاہ کی آٹھویں آیت-جو دوزخ کو متکبر اور بدنیتی پر مبنی \"بند\" قرار دیتے ہیں ، اکثر وجود اور معاشرتی نتائج کی عینک کے ذریعہ تشریح کی جاتی ہے۔ ڈاکٹر احمد ہنیف جیسے سیئڈ محمد حسین فد اللہ اور ہم عصر مفکرین جیسے اسکالرز اس بات پر زور دیتے ہیں کہ آیت کی نظریہ کی تصویر کشی اخلاقی بدعنوانی کے خود تباہ کن نتائج کی عکاسی کرتی ہے۔ جہنم کی آگ کی \"سگ ماہی\" نظامی لالچ ، معاشرتی استحصال ، اور دوسروں کے غیر مہذب ہونے والے ناگزیر تنازعات کی علامت ہے ، جس میں دولت کی عدم مساوات ، ماحولیاتی خاتمے اور ڈیجیٹل بدنامی کے نشان زدہ دور میں گہری گونج ہے۔  \n\nجدید طافسیر اس بند کو نفسیاتی اور ماحولیاتی حقائق سے جوڑتا ہے۔ نفسیاتی طور پر ، آیت جدید بیگانگی میں محسوس ہونے والی تنہائی کی آئینہ دار ہے۔ ماحولیاتی طور پر ، ڈاکٹر فاطمہ اکیف جیسے اسکالرز انسانیت کے غیر مستحکم کھپت کے متوازی ہیں ، اور یہ استدلال کرتے ہیں کہ ماحولیاتی انحطاط قدرتی نظام کی اجتماعی \"بندش\" کی نمائندگی کرتا ہے ، اور آئندہ نسلوں کو بحرانوں میں پھنساتا ہے۔ فلسفیانہ طور پر ، آیت نو لبرل انفرادیت پر تنقید کرتی ہے ، اور خودغرض جمع ہونے پر فرقہ وارانہ ذمہ داری پر زور دیتی ہے۔  \n\nبین المذاہب مکالموں نے مشترکہ اخلاقی خدشات کو اجاگر کیا: بدھ مت کے نتائج سے متعلق بدھ مت کی تعلیمات ، روحانی اندھا پن کے بارے میں عیسائی انتباہات ، اور دیر سے مرحلے کے سرمایہ دارانہ نظام کے سیکولر ہیومنسٹ نقادوں کو قرآنی اصول کی بازگشت کرتے ہیں کہ جبر اور تکبر کا خاتمہ ہوتا ہے۔ شیعہ برادریوں کے لئے ، اس آیت میں نظامی ناانصافی کے خلاف سرگرمی کا مطالبہ کیا گیا ہے ، اور معاشرتی ایکویٹی سے متعلق امام علی کی تعلیمات کے مطابق۔ انتہا پسندی اور آب و ہوا سے انکار کی وجہ سے ٹوٹ جانے والی دنیا میں ، آیت ایک لازوال انتباہ بن جاتی ہے: اخلاقی دیوالیہ پن ، بغیر کسی چیک کی ، اس کی اپنی جیل بن جاتی ہے۔",
    "layer4_urdu": "آیت \"واقعی ، جہنم کی آگ ان پر بند ہوجائے گی\" (قرآن 104: 8) تکبر اور بدنیتی پر مبنی تقریر کی روحانی بیماری کے خلاف ایک گہرا انتباہ ہے۔ اہل بیت (ان پر امن) نے یہ سکھایا کہ جہنم کی \"بندش\" محض ایک جسمانی قید نہیں ہے بلکہ ایک استعاریاتی حقیقت ہے جو الہی رحمت سے منقطع روح کی کیفیت کی عکاسی کرتی ہے۔ امام جافر السادق (ان پر امن ہے) *طافسیر القومی *میں ریاستوں میں کہا گیا ہے: \"آگ ان پر مہر لگا دی گئی ہے کیونکہ ان کے دلوں کو اللہ کے ثبوتوں [اماموں] کی پہچان کے خلاف مہر لگا دیا گیا تھا ، اور اس طرح ان کی سزا ان کی اپنی روحانی اندھا پن کی توسیع بن جاتی ہے۔\"  \n\nاس آیت میں ان لوگوں کی مذمت کی گئی ہے جو مذاق اور بیک بائٹ ، ان خصوصیات کی مذمت کرتے ہیں جو اہل بائٹ کے * ولیہ * (خدائی طور پر مقرر کردہ سرپرستی) کو مسترد کرنے سے پیدا ہوتے ہیں۔ حضرت محمد صلی اللہ علیہ وآلہ وسلم (اس پر اور اس کے اہل خانہ پر امن) نے کہا ، \"بیکار جنت میں داخل نہیں ہوگا\" (*بہار الانور*) ، ابدی کھنڈرات سے بہتان کو جوڑتے ہوئے۔ لیڈی فاطمہ (اس پر امن) نے اپنے مشہور خطبہ میں زور دیا: \"وہ ناانصاف جو اللہ کے عہد کی رسی کو ختم کرنے والے ناانصافی کو آگ میں قید کردیں گے جس کی وہ خود بھڑک اٹھی ہیں۔\" یہاں ، جہنم کی \"بندش\" حقیقت سے انکار کرکے اور *محمدن لائٹ *کے لئے نفرت کی پرورش کے ذریعہ پیدا ہونے والی خود ساختہ رکاوٹوں کا آئینہ دار ہے۔  \n\nعملی طور پر ، یہ آیت مومنوں کو اپنی زبان اور دلوں کو پاک کرنے کا مطالبہ کرتی ہے۔ امام علی (اس پر امن) سکھایا ، \"جب آپ اپنے اعمال کی حفاظت کرتے ہو تو اپنی تقریر کی حفاظت کریں ، کیونکہ زبان آپ کو جہنم کی گہرائیوں میں گھسیٹ سکتی ہے۔\" روحانی نشوونما کے لئے عاجزی کو قبول کرنے ، گپ شپ سے گریز کرنے ، اور دوسروں کے حقوق کو فعال طور پر برقرار رکھنے کی ضرورت ہوتی ہے۔ *امامہ *کے ساتھ صف بندی کرکے ، مومنین اپنی اندرونی ریاست کو تبدیل کرتے ہیں ، اور بدلاؤ کو اللہ کے منتخب کردہ رہنماؤں سے محبت کے ساتھ تبدیل کرتے ہیں۔ \"بند\" جہنم کی آگ اس طرح روح کی آزادی کا استعارہ بن جاتی ہے: صرف اہل بیت کی روشنی سے ہی کوئی انا کی جیل سے بچ سکتا ہے اور الہی سے قریب تر ہوسکتا ہے۔",
    "layer5": "Interpretations of Surah al-Humaza 8 among Shia and Sunni scholars reveal significant convergences in core theological concepts, alongside nuanced divergences rooted in methodological approaches. Both traditions universally affirm the verse’s depiction of Hell as an inescapable punishment for those who mock others and hoard wealth. Al-Tabari (Sunni) and al-Tabrisi (Shia) concur that *mu’sada* (closed down) symbolizes eternal confinement, emphasizing divine justice for moral transgressions. Ibn Kathir and al-Qummi both cite the verse’s connection to the surah’s condemnation of slander and greed, reinforcing shared ethical imperatives against social harm.  \n\nKey differences emerge in theological framing. Sunni exegetes like al-Qurtubi and al-Razi often emphasize the physicality of Hell’s closure, citing hadith describing its gates’ immovability. In contrast, Shia commentaries such as al-Tababai’s *Al-Mizan* and al-Tusi’s *Al-Tibyan* integrate metaphysical dimensions, interpreting the closure as a spiritual severance from divine mercy, reflecting the Imams’ teachings on the soul’s accountability. Al-Tababai further links this to the Quranic principle of *ghishawah* (veiling)—a state of self-imposed alienation from truth.  \n\nThese distinctions stem from historical contexts: Sunni tafsir often prioritizes literalist readings grounded in Prophetic narrations, while Shia scholarship interweaves the Ahl al-Bayt’s esoteric insights. Practically, both traditions reinforce ethical vigilance against backbiting and materialism, though Shia interpretations may accentuate introspection guided by Imamah’s spiritual authority.  \n\nDespite methodological variances, the verse’s moral core remains a unifying focus, illustrating how divergent hermeneutical frameworks coexist within Islam’s broader ethical worldview. Such comparative analysis underscores the richness of Quranic exegesis while respecting the integrity of both interpretative traditions.",
    "layer5_urdu": "شیعہ اور سنی اسکالرز کے مابین سورہ الحومازا 8 کی ترجمانی بنیادی مذہبی تصورات میں اہم اجتماعات کو ظاہر کرتی ہے ، اس کے ساتھ ساتھ طریقہ کار کے نقطہ نظر میں جڑے ہوئے متنازعہ تفریق بھی شامل ہیں۔ دونوں روایات عالمی سطح پر آیت کی جہنم کی آیت کی عکاسی کی تصدیق کرتے ہیں جو دوسروں کا مذاق اڑاتے ہیں اور دولت کا ذخیرہ کرتے ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) نے اتفاق کیا کہ * Mu’sada * (بند) اخلاقی حدود کے لئے خدائی انصاف پر زور دیتے ہوئے ابدی قید کی علامت ہے۔ ابن کتھیر اور القومی دونوں نے اس آیت کے سروہ کی غیبت اور لالچ کی مذمت سے تعلق کا حوالہ دیا ہے ، اور معاشرتی نقصان کے خلاف مشترکہ اخلاقی لاتعلقی کو تقویت بخشی ہے۔  \n\nمذہبی ڈھانچے میں کلیدی اختلافات سامنے آتے ہیں۔ سنی ریفریز جیسے القوروبی اور العزی اکثر جہنم کی بندش کی جسمانی صلاحیت پر زور دیتے ہیں ، اور حدیث کو اس کے دروازوں کی عدم استحکام کو بیان کرتے ہوئے۔ اس کے برعکس ، شیعہ کی تبصرے جیسے الاتابابائی کے * المزان * اور التوسی کے * التبیان * استعاریاتی طول و عرض کو مربوط کرتے ہیں ، اور اس بندش کو الہی رحمت سے روحانی علیحدگی کی ترجمانی کرتے ہیں ، جس سے روح کے احتساب پر اماموں کی تعلیمات کی عکاسی ہوتی ہے۔ الاتابابئی اس کو * غیشاح * (پردہ) کے قرآنی اصول سے جوڑتا ہے۔  \n\nیہ امتیازات تاریخی سیاق و سباق سے پیدا ہوتے ہیں: سنی طافسر اکثر پیشن گوئی کی روایات میں پڑنے والے لفظی پڑھنے کو ترجیح دیتے ہیں ، جبکہ شیعہ اسکالرشپ اے ایچ ایل البائٹ کی باطنی بصیرت کو جوڑتی ہے۔ عملی طور پر ، دونوں روایات کی پشت پناہی اور مادیت کے خلاف اخلاقی چوکسی کو تقویت ملتی ہے ، حالانکہ شیعہ کی ترجمانی امامہ کے روحانی اتھارٹی کے ذریعہ ہدایت کردہ انتشار کو بڑھا سکتی ہے۔  \n\nطریقہ کار کی مختلف حالتوں کے باوجود ، آیت کی اخلاقی بنیادی ایک یکجہتی کی توجہ کا مرکز بنی ہوئی ہے ، جس کی وضاحت کرتے ہوئے کہ اسلام کے وسیع تر اخلاقی عالمی نظریہ میں کس طرح مختلف ہرمینیٹیکل فریم ورک ایک ساتھ رہتے ہیں۔ اس طرح کے تقابلی تجزیہ دونوں تشریحی روایات کی سالمیت کا احترام کرتے ہوئے قرآنی استثنیٰ کی فراوانی کی نشاندہی کرتا ہے۔",
    "summary": "According to Tafsir al-Mizan, this verse expands on this by linking the verse to the ontological nature of human deeds. In Surah Al-Humaza, verse 8, Allah declares, *\"Innaha alayhim mu’sadah\"*—\"Indeed, Hellfire will be closed down upon them. \" This powerful statement concludes a passage condemning those who mock others, engage in backbiting (*humaza*), and obsess over material wealth. The term *mu’sadah* derives from the root *a-sa-da*, meaning \"to shut tightly\" or \"seal. Imam Ja'far al-Sadiq (peace be upon him) states in *Tafsir al-Qummi*: \"The fire is sealed upon them because their hearts were sealed against the recognition of Allah’s proofs [the Imams], and thus their punishment becomes an extension of their own spiritual blindness. The \"sealed\" Hellfire isn’t just a threat but a motivator to cultivate a heart sealed with God-consciousness.",
    "layer2short": "In Surah al-Humazah, verse 8 describes the fate of those who mock and slander others: *\"Indeed, Hellfire will be closed down upon them.\"* Classical Shia exegetes emphasize the theological and eschatological implications of this closure (*mu’sadah*), drawing from the teachings of the Ahl al-Bayt and established tafsir traditions. Tabrisi, in *Majma al-Bayan*, interprets *mu’sadah* as a state of permanent confinement, where the gates of Hell are sealed irrevocably, leaving no possibility of escape. This aligns with the Quranic principle that the punishment of the arrogant and malicious is both inescapable and eternal, reflecting divine justice (*‘adl*) for those who persistently reject moral accountability.",
    "layer2short_urdu": "سورہ الحومازاہ میں ، آیت 8 میں دوسروں کا مذاق اڑانے اور بہتان کی تقدیر کی وضاحت کی گئی ہے:*\"واقعی ، جہنم کی آگ ان پر بند ہوجائے گی۔\"*کلاسیکی شیعہ اس بندش کے مذہبی اور شعوری مضمرات پر زور دیتے ہیں (*mu’sadah*) ، احل البیٹ اور قائم کردہ روایتوں کی تعلیمات سے کھینچتے ہیں۔ تبریسی ، *مجسما البیان *میں ، *mu’sadah *کو مستقل قید کی حالت کے طور پر ترجمانی کرتا ہے ، جہاں جہنم کے دروازوں کو اٹل میں مہر لگایا جاتا ہے ، جس سے فرار کا کوئی امکان نہیں رہتا ہے۔ یہ قرآنی اصول کے مطابق ہے کہ متکبر اور بدنیتی پر مبنی سزا دونوں ناگزیر اور ابدی ہیں ، جو اخلاقی احتساب کو مستقل طور پر مسترد کرتے ہیں ان کے لئے الہی انصاف (*‘ADL*) کی عکاسی کرتے ہیں۔"
  },
  "9": {
    "layer1": "Surah Al-Humaza, revealed in Mecca, condemns those who mock others, hoard wealth arrogantly, and spread harm through speech. Verse 9, *\"In extended columns\" (fi ‘amadin mumaddadah)*, concludes the description of Hellfire as the eternal abode for such individuals. The phrase refers to the intense, inescapable structure of divine punishment. Classical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains that *‘amad* (columns) here symbolize towering, unbreakable pillars stretching endlessly to intensify the confinement and suffering of the condemned. The term *mumaddadah* (extended) emphasizes their perpetual nature, reflecting how evil actions rooted in arrogance and malice create lasting spiritual consequences.\n\nHistorically, this surah targeted wealthy Meccan elites who ridiculed the Prophet (PBUH) and marginalized believers, using their status to belittle others. The verse serves as a stark reminder that worldly power and social dominance hold no value before divine justice. Shia narrations, including teachings from Imam Ali (AS), stress that true nobility lies in humility, ethical conduct, and protecting others’ dignity—not in wealth or lineage.\n\nIn modern contexts, this verse warns against the destructive power of arrogance, gossip, and materialism. The \"extended columns\" metaphorically represent modern societal ills like cyberbullying, economic exploitation, or using social status to harm others. It calls Muslims to self-reflect: Are our actions building unity or reinforcing divisions? Are we using our resources to uplift others or to inflate our egos? By embodying the Quranic ethic of compassion and humility—central to the Ahlul Bayt’s teachings—we avoid becoming the \"backbiters\" and \"slanderers\" condemned here. The verse ultimately urges us to replace malice with mercy, recognizing that every word and deed shapes our eternal destiny.",
    "layer2": "In Surah al-Humazah, verse 9 describes the punishment of those who engage in slander and material greed as being confined to a fire \"in extended columns\" (*fi ʿamadin mumaddadah*). Classical Shia exegetes, drawing from the teachings of the Ahl al-Bayt, interpret this imagery as a vivid depiction of the inescapable and intensified nature of divine chastisement. Shaykh Tabrisi, in *Majma al-Bayan*, notes that the \"columns\" (*ʿamad*) are understood by early commentators as either towering pillars of fire that envelop the damned or as chains stretched taut to bind them, symbolizing both the severity and inescapability of their state. This aligns with the Quranic motif of Hell’s physical and psychological torment, where punitive structures reflect the moral corruption of the offenders.  \n\nImam Jafar al-Sadiq, as cited in Shia traditions, emphasizes that such punishments are metaphysically tied to the intrinsic consequences of sin. The \"extended columns\" are not merely physical but represent the elongation and perpetuation of the spiritual harm caused by backbiting (*ghibah*) and hoarding wealth—a theme central to the surah’s condemnation of social and ethical violations. Tabatabai, in *Al-Mizan*, expands this by linking the imagery to the Quranic principle of divine justice (*ʿadl*), wherein the punishment corresponds symbolically to the crime: just as the slanderer \"kindled\" social discord, their punishment manifests as an unquenchable fire bound by eternal structures.  \n\nShia theology further contextualizes this within the framework of accountability before the Divine Court (*qiyamah*), where the Ahl al-Bayt’s intercession (*shafaʿah*) remains contingent upon sincere repentance. The verse thus serves as both a warning against moral transgressions and a reminder of the ontological reality of divine recompense, integral to Shia eschatological doctrine.",
    "layer3": "In Surah Al-Humazah, verse 9’s imagery of “extended columns” (fi ‘amadin mumaddadah) has been re-examined by contemporary Shia scholars through interdisciplinary lenses. Ayatollah Naser Makarem Shirazi, in *Tafsir Nemuneh*, interprets the “columns” as a metaphor for the structural reinforcement of Hell’s torment, symbolizing the inescapable consequences of arrogance and social harm. Modern thinkers like Dr. Mohammad Ali Shomali extend this, framing the verse as a critique of systemic oppression: just as columns uphold a structure, societal evils like greed, slander, and inequality are upheld by interconnected systems of power. This aligns with philosopher Abdolkarim Soroush’s emphasis on *structural sin*—harm embedded in institutions or cultural norms rather than individual acts alone.  \n\nScientifically, some scholars draw parallels to entropy and interconnected systems: the “columns” evoke the cascading collapse of ecosystems or economies when foundational ethics erode. Environmentalists cite the verse to warn against exploitative industries—like fossil fuels or deforestation—that “extend” ecological harm. Socially, the verse resonates in the digital age: online platforms amplify gossip and humiliation (humazah), creating “virtual columns” of cyberbullying or misinformation that trap individuals and communities.  \n\nInterfaith dialogues highlight shared concerns: Buddhist teachings on the karmic weight of harmful speech, or Jewish ethics on *lashon hara* (evil speech), mirror Islam’s condemnation of social malice. Multiculturally, the verse urges societies to dismantle systemic inequities—from racial hierarchies to caste systems—that perpetuate collective suffering.  \n\nUltimately, this verse challenges modernity to recognize that moral and social collapse is not random but built, column by column, through normalized injustice. As scholar Zainab Alwani notes, it calls for “ethical architecture”—rebuilding societies on compassion, equity, and accountability.",
    "layer4": "The verse \"In extended columns\" (104:9) from Surah al-Humazah is a profound allusion to the spiritual architecture of Hellfire, which the Ahlul Bayt (peace be upon them) teach is not merely a physical abode but a manifestation of the inner states of those who sever themselves from divine truth. Imam Ali (as) states in *Nahj al-Balagha*: \"The fire of Hell is surrounded by the desires people followed in this world, and its pillars are built from the sins they accumulated.\" The \"extended columns\" thus symbolize the towering spiritual consequences of malicious speech, arrogance, and the rejection of divine guidance—crimes that fracture the sacred bonds of human brotherhood upheld by Wilayah (divine guardianship).\n\nLady Fatimah (as), in her timeless sermon, warned that \"the tongues of the slanderers will become fuel for Hellfire,\" emphasizing how backbiting and mockery—central themes in this Surah—corrode the soul and distance one from Allah’s mercy. The Imams taught that every act of slander or envy erects a barrier between the heart and the light of Imamah, the divine leadership that guides humanity toward purification. Imam Jafar al-Sadiq (as) explained: \"The pillars of Hell are prolonged because the roots of arrogance and malice run deep; only the water of sincere repentance and humility can uproot them.\"\n\nPractically, this verse calls believers to guard their speech vigilantly, as taught by the Prophet (pbuh): \"Whoever believes in Allah and the Last Day, let them speak good or remain silent.\" Spiritual development here demands daily self-accountability (muhasabah) and nurturing empathy, recognizing that every soul is under the guardianship of the Imam of our time. By aligning our words with the ethics of the Ahlul Bayt—speaking only to uplift, unite, and reflect divine wisdom—we dismantle the \"columns\" of ego and build instead pillars of light connecting us to the eternal grace of Wilayah.",
    "layer1_urdu": "مکہ میں انکشاف کردہ سورہ الحومازا نے ان لوگوں کی مذمت کی ہے جو دوسروں کا مذاق اڑاتے ہیں ، دولت کو تکبر سے جمع کرتے ہیں ، اور تقریر کے ذریعے نقصان پہنچاتے ہیں۔ آیت 9 ، *\"توسیعی کالموں میں\" (فائی ‘عمادین ممادداہ) *، اس طرح کے افراد کے لئے ابدی ٹھکانے کے طور پر جہنم کی آگ کی تفصیل کا اختتام کرتی ہے۔ اس جملے سے مراد الہی سزا کی شدید ، ناگزیر ڈھانچہ ہے۔ کلاسیکی شیعہ طافس ، جیسے الامہ تبتابائی کے *المزان *، نے وضاحت کی ہے کہ *‘عماد *(کالم) یہاں کی قید اور مصائب کو تیز کرنے کے لئے بے حد پھیلے ہوئے ، ناقابل برداشت ستونوں کی علامت ہیں۔ اصطلاح * ممادداہ * (توسیعی) ان کی مستقل نوعیت پر زور دیتی ہے ، جس کی عکاسی ہوتی ہے کہ کس طرح تکبر اور بدکاری سے جڑنے والی بری حرکتیں دیرپا روحانی نتائج پیدا کرتی ہیں۔\n\nتاریخی طور پر ، اس سورہ نے دولت مند میکن کے اشرافیہ کو نشانہ بنایا جنہوں نے نبی (صلی اللہ علیہ وآلہ وسلم) کا مذاق اڑایا اور مومنین کو پسماندہ کیا ، اور دوسروں کو شکست دینے کے لئے اپنی حیثیت کا استعمال کرتے ہوئے۔ یہ آیت ایک بالکل یاد دہانی کے طور پر کام کرتی ہے کہ الہی انصاف سے پہلے دنیاوی طاقت اور معاشرتی غلبہ کی کوئی اہمیت نہیں ہے۔ شیعہ بیانات ، بشمول امام علی (ع) کی تعلیمات ، اس بات پر زور دیتے ہیں کہ حقیقی شرافت عاجزی ، اخلاقی طرز عمل ، اور دوسروں کے وقار کی حفاظت میں ہے۔\n\nجدید سیاق و سباق میں ، یہ آیت تکبر ، گپ شپ اور مادیت کی تباہ کن طاقت کے خلاف متنبہ کرتی ہے۔ \"توسیعی کالم\" استعاراتی طور پر جدید معاشرتی بیماریوں کی نمائندگی کرتے ہیں جیسے سائبر دھونس ، معاشی استحصال ، یا دوسروں کو نقصان پہنچانے کے لئے معاشرتی حیثیت کا استعمال۔ یہ مسلمانوں کو خود عکاسی کرنے کے لئے کہتے ہیں: کیا ہمارے اعمال اتحاد کی تعمیر یا تقویت بخش ڈویژن ہیں؟ کیا ہم اپنے وسائل کو دوسروں کو ترقی دینے یا اپنے ایگوس کو بڑھاوا دینے کے لئے استعمال کر رہے ہیں؟ ہمدردی اور عاجزی کی قرآنی اخلاقیات کو مجسم بناتے ہوئے - اہل بیت کی تعلیمات کا مرکز - ہم یہاں \"بیک بائٹ\" بننے اور \"بہتان\" بننے سے گریز کرتے ہیں۔ آیت بالآخر ہم پر زور دیتی ہے کہ وہ بدکاری کو رحمت سے تبدیل کرے ، یہ تسلیم کرتے ہوئے کہ ہر لفظ اور عمل ہمارے ابدی مقدر کی تشکیل کرتا ہے۔",
    "layer2_urdu": "سورہ الحومازاہ میں ، آیت 9 میں ان لوگوں کی سزا کو بیان کیا گیا ہے جو بہتان اور مادی لالچ میں مشغول ہیں \"توسیعی کالموں میں\" آگ تک محدود ہیں (*فائی عمادین ممادداہ*)۔ کلاسیکی شیعہ استثنیٰ ، اے ایچ ایل ال بائیٹ کی تعلیمات سے ڈرائنگ کرتے ہوئے ، اس منظر کشی کی ترجمانی الہی عذاب کی ناگزیر اور تیز نوعیت کی ایک واضح عکاسی کے طور پر کرتے ہیں۔ *ماجما البیان*میں شیخ تبریسی نے نوٹ کیا ہے کہ ابتدائی مبصرین کے ذریعہ \"کالم\" (*عماد*) کو آگ کے ایک اہم ستونوں کے طور پر سمجھا جاتا ہے جو ان کو باندھتے ہیں یا زنجیروں کو باندھتے ہیں اور ان کو باندھنے کے لئے ان کی ریاست کی شدت اور عدم استحکام دونوں کی علامت ہیں۔ یہ جہنم کے جسمانی اور نفسیاتی عذاب کے قرآنی شکل کے ساتھ موافق ہے ، جہاں تعزیراتی ڈھانچے مجرموں کی اخلاقی بدعنوانی کی عکاسی کرتے ہیں۔  \n\nجیسا کہ شیعہ روایات میں حوالہ دیا گیا ہے ، امام جعفر السادیق اس بات پر زور دیتے ہیں کہ اس طرح کی سزایں استعاراتی طور پر گناہ کے اندرونی نتائج سے منسلک ہیں۔ \"توسیعی کالم\" محض جسمانی نہیں ہیں بلکہ اس کی نمائندگی کرتے ہیں اور روحانی نقصان کی لمبائی (*غیبہ*) اور دولت کو جمع کرنے کی وجہ سے ہیں۔ یہ ایک مرکزی خیال ، معاشرتی اور اخلاقی خلاف ورزیوں کی سورت کی مذمت کا مرکزی خیال ہے۔ تبتابائی ،*المزان*میں ، منظر کشی کو الہی انصاف (*الدال*) کے قرآنی اصول سے جوڑ کر اس کو وسعت دیتے ہیں ، جس میں سزا علامتی طور پر جرم سے مماثل ہے: جس طرح بہتان \"بھوک لگی ہوئی\" معاشرتی اختلافات ، ان کی سزا ابدی ڈھانچے کے پابند ناقابل تسخیر آگ کی حیثیت سے ظاہر ہوتی ہے۔  \n\nشیعہ الہیات نے اس کو مزید تقویت دی ہے کہ اس کو خدائی عدالت (*قیعامہ*) کے سامنے احتساب کے فریم ورک کے اندر موجود ہے ، جہاں اہل البائٹ کی شفاعت (*شافعہ*) مخلص توبہ پر مستقل طور پر برقرار ہے۔ اس طرح یہ آیت اخلاقی حدود کے خلاف انتباہ اور الہی بدلہ لینے کی علمی حقیقت کی یاد دہانی کے طور پر کام کرتی ہے ، جو شیعہ اسکیٹولوجیکل نظریہ کے لئے لازمی ہے۔",
    "layer3_urdu": "سورہ الحومازاہ میں ، آیت 9 کی \"توسیعی کالموں\" (فائی ‘عمادین ممادداہ) کی تصو .رات کو عصری شیعہ اسکالرز نے بین الضابطہ عینک کے ذریعے دوبارہ جانچ پڑتال کی ہے۔ آیت اللہ ناصر مکارم شیرازی ، *طافسیر نمونیہ *میں ، \"کالموں\" کو جہنم کے عذاب کی ساختی کمک کے استعارے کے طور پر ترجمانی کرتا ہے ، جو تکبر اور معاشرتی نقصان کے ناگزیر نتائج کی علامت ہے۔ ڈاکٹر محمد علی شومالی جیسے جدید مفکرین اس کو بڑھاتے ہیں ، اور اس آیت کو نظامی جبر کے نقاد کے طور پر تیار کرتے ہیں: جس طرح کالم ایک ڈھانچے کو برقرار رکھتے ہیں ، اسی طرح معاشرتی برائیوں جیسے لالچ ، بہتان اور عدم مساوات کو طاقت کے باہم مربوط نظاموں سے برقرار رکھا جاتا ہے۔ یہ فلسفی عبدولکریم سوروش کے *ساختی گناہ *پر زور دینے کے ساتھ ہم آہنگ ہے۔  \n\nسائنسی طور پر ، کچھ اسکالرز اینٹروپی اور باہم جڑے ہوئے نظاموں کے متوازی کھینچتے ہیں: \"کالم\" ماحولیاتی نظام یا معیشتوں کے جھڑپوں کے خاتمے کو جنم دیتے ہیں جب بنیادی اخلاقیات ختم ہوجاتی ہیں۔ ماحولیات کے ماہرین استحصالی صنعتوں کے خلاف انتباہ کرنے کے لئے آیت کا حوالہ دیتے ہیں - جیسے جیواشم ایندھن یا جنگلات کی کٹائی - جو ماحولیاتی نقصان کو \"بڑھاؤ\"۔ معاشرتی طور پر ، آیت ڈیجیٹل دور میں گونجتی ہے: آن لائن پلیٹ فارم گپ شپ اور ذلت (ہمازا) کو بڑھا دیتے ہیں ، جس سے سائبر دھونس یا غلط معلومات کے \"ورچوئل کالم\" پیدا ہوتے ہیں جو افراد اور برادریوں کو پھنساتے ہیں۔  \n\nبین المذاہب مکالموں نے مشترکہ خدشات کو اجاگر کیا: نقصان دہ تقریر کے کرمک وزن پر بدھ مت کی تعلیمات ، یا * لاشون ہارا * (بری تقریر) پر یہودی اخلاقیات ، آئینہ دار اسلام کی معاشرتی بدنیتی کی مذمت۔ کثیر الثقافتی طور پر ، آیت سوسائٹیوں کو نظامی عدم مساوات کو ختم کرنے کی تاکید کرتی ہے۔  \n\nآخر کار ، یہ آیت جدیدیت کو چیلنج کرتی ہے کہ یہ تسلیم کریں کہ اخلاقی اور معاشرتی خاتمہ بے ترتیب نہیں ہے بلکہ عام ناانصافی کے ذریعہ کالم کے ذریعہ کالم بنایا گیا ہے۔ جیسا کہ اسکالر زینب الوانی نوٹ کرتے ہیں ، اس میں \"اخلاقی فن تعمیر\" کا مطالبہ کیا گیا ہے۔",
    "layer4_urdu": "سورہ الحومازاہ کی \"توسیعی کالموں میں\" (104: 9) کی آیت جہنم کے روحانی فن تعمیر کا ایک گہرا اشارہ ہے ، جسے اہل بیت (ان پر امن ہے) پڑھاتا ہے وہ محض ایک جسمانی ٹھکانہ نہیں ہے بلکہ ان لوگوں کی اندرونی ریاستوں کا مظہر ہے جو خود کو الہی سچائی سے الگ کرتے ہیں۔ امام علی (ع) *ناہج البالاگھا *میں کہتے ہیں: \"جہنم کی آگ اس دنیا میں لوگوں کی خواہشات سے گھرا ہوا ہے ، اور اس کے ستون ان گناہوں سے بنے ہیں جو ان کے جمع ہوئے ہیں۔\" اس طرح \"توسیعی کالم\" بدنیتی پر مبنی تقریر ، تکبر ، اور خدائی رہنمائی کے مسترد ہونے والے روحانی نتائج کی علامت ہیں۔ یہ جرائم ہیں جو ولیہ (خدائی سرپرستی) کے ذریعہ انسانی بھائی چارے کے مقدس بندھن کو فریکچر دیتے ہیں۔\n\nلیڈی فاطمہ (ع) نے ، اپنے لازوال خطبہ میں ، متنبہ کیا کہ \"بہتان کی زبان کی زبانیں جہنم کی آگ کے لئے ایندھن بن جائیں گی ،\" اس بات پر زور دیتے ہوئے کہ کس طرح کی بیک بٹینگ اور مذاق - اس سورہ میں مرکزیت کے موضوعات - اللہ کی رحمت سے روح اور فاصلے کو درست کرتے ہیں۔ اماموں نے یہ سکھایا کہ بہتان یا حسد کا ہر عمل دل اور امامہ کی روشنی کے مابین رکاوٹ کھڑا کرتا ہے ، وہ الہی قیادت جو انسانیت کو طہارت کی طرف راغب کرتی ہے۔ امام جعفر السادق (ع) نے وضاحت کی: \"جہنم کے ستون طویل عرصے تک ہیں کیونکہ تکبر اور بددیانتی کی جڑیں گہری ہوتی ہیں۔ صرف مخلص توبہ اور عاجزی کا پانی ان کو اکھاڑ سکتا ہے۔\"\n\nعملی طور پر ، یہ آیت مومنوں کو اپنی تقریر کی نگرانی کے لئے کہتے ہیں ، جیسا کہ نبی (صلی اللہ علیہ وآلہ وسلم) نے سکھایا ہے: \"جو بھی اللہ اور آخری دن پر یقین رکھتا ہے ، انہیں اچھ speake ا بولنے یا خاموش رہنے دیں۔\" یہاں روحانی نشوونما روزانہ کی خود حساب کتاب (محسابہ) اور ہمدردی کی پرورش کا مطالبہ کرتی ہے ، اور یہ تسلیم کرتی ہے کہ ہر روح ہمارے وقت کے امام کی سرپرستی میں ہے۔ ہمارے الفاظ کو احلول بیت کی اخلاقیات کے ساتھ سیدھ میں کرکے - صرف ترقی ، متحد ہونے اور خدائی حکمت کی عکاسی کرنے کے لئے ، ہم انا کے \"کالم\" کو ختم کرتے ہیں اور اس کے بجائے روشنی کے ستونوں کو تعمیر کرتے ہیں جو ہمیں ولیہ کے دائمی فضل سے جوڑتے ہیں۔",
    "layer5": "The interpretation of Surah al-Humaza 9, describing the punishment of slanderers as occurring \"in extended columns,\" reveals both shared principles and nuanced differences between Shia and Sunni exegetical traditions. Across both schools, scholars universally agree the verse condemns malicious speech and greed, emphasizing divine justice in the afterlife. Sunni commentators such as Tabari and Ibn Kathir (Jami al-Bayan, Tafsir Ibn Kathir) interpret \"extended columns\" as towering pillars of Hellfire, symbolizing inescapable punishment. This aligns with Shia scholars like Tabrisi (Majma al-Bayan), who similarly describe the imagery as a vivid depiction of Hell’s structure, citing narrations from Imam Ali emphasizing its physical reality.  \n\nDivergences emerge in theological emphasis. Sunni exegetes like Qurtubi (Al-Jami li-Ahkam) and Razi (Mafatih al-Ghayb) often prioritize literal readings, contextualizing the verse within Quranic eschatology and Hadith descriptions of Hell. In contrast, Shia scholars such as Tabatabai (Al-Mizan) and Tusi (At-Tibyan) integrate metaphysical dimensions, interpreting \"columns\" as symbols of enduring spiritual consequences for moral corruption. Al-Qummi’s tafsir further links the imagery to societal oppression, reflecting the Shia emphasis on socioethical justice rooted in the teachings of the Ahl al-Bayt.  \n\nThese differences stem from methodological priorities: Sunni tafsir often relies on transmitted narratives (naql) and linguistic analysis, while Shia interpretations frequently incorporate the hermeneutical legacy of the Imams, blending textual and intellectual (aql) approaches. Practically, both traditions reinforce the prohibition of slander, though Shia readings may additionally inspire activism against systemic injustice. Historically, the Shia focus on symbolic and ethical dimensions arose from early theological debates on divine justice and the Imam’s role as interpreter, whereas Sunni literalism reflects a consolidation of Prophetic traditions post the formative Islamic period.  \n\nUltimately, both traditions converge on the verse’s moral urgency while diverging in their exegetical frameworks—differences that enrich Quranic understanding without undermining shared ethical imperatives.",
    "layer5_urdu": "سورہ الحومازا 9 کی تشریح ، جس میں \"توسیعی کالموں میں\" ہونے والی بہتانوں کی سزا کو بیان کرتے ہوئے ، شیعہ اور سنی کے مسخر التحصیل روایات کے مابین مشترکہ اصولوں اور متنازعہ اختلافات دونوں کو ظاہر کیا گیا ہے۔ دونوں اسکولوں میں ، اسکالرز عالمی طور پر اس آیت کی بدنیتی پر مبنی تقریر اور لالچ کی مذمت کرتے ہیں ، اور بعد میں زندگی میں الہی انصاف پر زور دیتے ہیں۔ سنی مبصرین جیسے تباری اور ابن کتھیر (جامی البیان ، طافسیر ابن کتھیر) \"توسیعی کالموں\" کی ترجمانی کرتے ہیں جو جہنم کی آگ کے بڑے ستونوں کی حیثیت سے ہیں ، جو ناقابل تلافی سزا کی علامت ہیں۔ یہ شیا اسکالرز جیسے تبریسی (ماجما البیان) کے ساتھ صف بندی کرتا ہے ، جو امام علی کی طرف سے اس کی جسمانی حقیقت پر زور دیتے ہوئے بیان کرتے ہوئے جہنم کے ڈھانچے کی ایک واضح تصویر کے طور پر منظر کشی کو بیان کرتے ہیں۔  \n\nمذہبی زور سے تغیرات ابھرتے ہیں۔ سنی ریفرس جیسے قربانی (الجامی لی-جہکم) اور ریزی (مافاتیہ الغیب) اکثر لفظی پڑھنے کو ترجیح دیتے ہیں ، اور جہنم کی قرآنی اسکاٹولوجی اور حدیث کی وضاحت کے اندر آیت کو سیاق و سباق دیتے ہیں۔ اس کے برعکس ، شیعہ اسکالرز جیسے تبتابائی (المزان) اور توسی (ایٹ تبیان) استعاریاتی طول و عرض کو مربوط کرتے ہیں ، اور \"کالم\" کو اخلاقی بدعنوانی کے پائیدار روحانی نتائج کی علامت قرار دیتے ہیں۔ القومی کا طافسر مزید منظر کشی کو معاشرتی جبر سے جوڑتا ہے ، اور اے ایچ ایل البیٹ کی تعلیمات میں جڑے ہوئے معاشرتی انصاف پر شیعہ کے زور کی عکاسی کرتا ہے۔  \n\nیہ اختلافات طریقہ کار کی ترجیحات سے پیدا ہوتے ہیں: سنی طافسر اکثر منتقلی بیانیے (این اے کیو ایل) اور لسانی تجزیہ پر انحصار کرتا ہے ، جبکہ شیعہ کی ترجمانیوں میں اکثر اماموں کی ہرمینیٹیکل وراثت کو شامل کیا جاتا ہے ، متنی اور دانشورانہ (AQL) کے نقطہ نظر کو ملاوٹ کرتے ہیں۔ عملی طور پر ، دونوں روایات بہتان کی ممانعت کو تقویت بخشتی ہیں ، حالانکہ شیعہ ریڈنگ سسٹمک ناانصافی کے خلاف سرگرمی کو اضافی طور پر متاثر کرسکتی ہے۔ تاریخی طور پر ، شیعہ علامتی اور اخلاقی طول و عرض پر توجہ مرکوز کرنے کے ابتدائی مذہبی مباحثوں اور امام کے مترجم کے کردار سے پیدا ہوئے ہیں ، جبکہ سنی لغوییت کی روایت کی روایات کے استحکام کی عکاسی ہوتی ہے جو ابتدائی اسلامی دور کے بعد ہے۔  \n\nبالآخر ، دونوں روایات آیت کی اخلاقی عجلت پر ایک ساتھ مل جاتی ہیں جبکہ ان کے استثنیٰ کے فریم ورک میں مبتلا ہوجاتی ہیں۔",
    "summary": "The scholarly interpretation in Tafsir al-Mizan reveals that expands this by linking the imagery to the Quranic principle of divine justice (*ʿadl*), wherein the punishment corresponds symbolically to the crime: just as the slanderer \"kindled\" social discord, their punishment manifests as an unquenchable fire bound by eternal structures. Surah Al-Humaza, revealed in Mecca, condemns those who mock others, hoard wealth arrogantly, and spread harm through speech. Verse 9, *\"In extended columns\" (fi ‘amadin mumaddadah)*, concludes the description of Hellfire as the eternal abode for such individuals. The phrase refers to the intense, inescapable structure of divine punishment. Imam Ali (as) states in *Nahj al-Balagha*: \"The fire of Hell is surrounded by the desires people followed in this world, and its pillars are built from the sins they accumulated. The verse ultimately urges us to replace malice with mercy, recognizing that every word and deed shapes our eternal destiny.",
    "layer2short": "In Surah al-Humazah, verse 9 describes the punishment of those who engage in slander and material greed as being confined to a fire \"in extended columns\" (*fi ʿamadin mumaddadah*). Classical Shia exegetes, drawing from the teachings of the Ahl al-Bayt, interpret this imagery as a vivid depiction of the inescapable and intensified nature of divine chastisement. Shaykh Tabrisi, in *Majma al-Bayan*, notes that the \"columns\" (*ʿamad*) are understood by early commentators as either towering pillars of fire that envelop the damned or as chains stretched taut to bind them, symbolizing both the severity and inescapability of their state. This aligns with the Quranic motif of Hell’s physical and psychological torment, where punitive structures reflect the moral corruption of the offenders.  ",
    "layer2short_urdu": "سورہ الحومازاہ میں ، آیت 9 میں ان لوگوں کی سزا کو بیان کیا گیا ہے جو بہتان اور مادی لالچ میں مشغول ہیں \"توسیعی کالموں میں\" آگ تک محدود ہیں (*فائی عمادین ممادداہ*)۔ کلاسیکی شیعہ استثنیٰ ، اے ایچ ایل ال بائیٹ کی تعلیمات سے ڈرائنگ کرتے ہوئے ، اس منظر کشی کی ترجمانی الہی عذاب کی ناگزیر اور تیز نوعیت کی ایک واضح عکاسی کے طور پر کرتے ہیں۔ *ماجما البیان*میں شیخ تبریسی نے نوٹ کیا ہے کہ ابتدائی مبصرین کے ذریعہ \"کالم\" (*عماد*) کو آگ کے ایک اہم ستونوں کے طور پر سمجھا جاتا ہے جو ان کو باندھتے ہیں یا زنجیروں کو باندھتے ہیں اور ان کو باندھنے کے لئے ان کی ریاست کی شدت اور عدم استحکام دونوں کی علامت ہیں۔ یہ جہنم کے جسمانی اور نفسیاتی عذاب کے قرآنی شکل کے ساتھ موافق ہے ، جہاں تعزیراتی ڈھانچے مجرموں کی اخلاقی بدعنوانی کی عکاسی کرتے ہیں۔  "
  }
}