{
  "1": {
    "layer1": "In Surah Az-Zalzala, the opening verse – *\"Idha zulzilat al-ardu zilzalaha\"* (When the earth is shaken with its [final] earthquake) – paints a vivid image of the cosmic upheaval marking the Day of Judgment. The term *\"zilzal\"* derives from the root *z-l-z-l*, conveying intense, convulsive shaking beyond ordinary earthquakes. Shia tafsir scholars like Allamah Tabatabai in *Al-Mizan* explain this as a unique, divinely ordained event – not merely geological but a metaphysical rupture dismantling the existing world order to herald resurrection. The possessive suffix *\"ha\"* (its) in *\"zilzalaha\"* signifies this quake is intrinsic to the earth’s ultimate purpose, a predetermined transformation tied to divine justice.\n\nWhile the verse’s revelation context isn’t explicitly tied to historical events, Shia narrations link such eschatological imagery to the eventual reappearance of Imam Mahdi (aj), when truth will manifest fully. The violent shaking symbolizes both physical and moral reckonings – collapsing corrupt systems and exposing hidden truths, as emphasized in Imam Ali’s teachings about accountability. \n\nFor contemporary Muslims, this verse serves as a timeless reminder of life’s impermanence and the certainty of divine reckoning. The \"earthquake\" metaphor extends to personal and societal levels: just as the earth cannot conceal humanity’s deeds on Judgment Day (as later verses clarify), we must confront our actions’ consequences today. Practically, this inspires self-reflection, ethical consistency, and social responsibility – core Shia values. It calls believers to align their lives with Quranic principles and the Ahlul Bayt’s guidance, building communities resilient to moral \"quakes\" through justice, compassion, and preparedness for both worldly trials and the Hereafter.",
    "layer2": "In classical Shia exegesis, the opening verse of Surah al-Zalzala, \"When the earth is shaken with its [final] earthquake,\" is understood as a profound eschatological event marking the prelude to divine judgment. Both Shaykh Tabrisi in *Majma al-Bayan* and Allama Tabatabai in *Al-Mizan* emphasize that this \"shaking\" (zilzal) transcends ordinary seismic phenomena, representing a cosmic upheaval ordained by Allah to dismantle the existing order of creation prior to the Resurrection (Qiyamah). Tabrisi notes that the term *zilzalaha* (\"its earthquake\") signifies a unique, divinely mandated convulsion specific to the earth’s ultimate purpose: to bear witness to human deeds on the Day of Reckoning, as later verses in the surah clarify.\n\nTabatabai expands this concept theologically, arguing that the earth’s violent trembling symbolizes the collapse of material illusions and the unveiling of metaphysical truths. In Shia thought, this aligns with the principle of *al-mabda wa al-ma'ad* (origination and return), wherein creation’s temporal existence is inextricably linked to its return to the Divine. The earth’s testimony—a recurring theme in the surah—is interpreted as an affirmation of the inherent justice embedded in creation, resonating with the Shia emphasis on *adl* (divine justice) as a pillar of faith. \n\nScholars like Al-Fayd al-Kashani contextualize this event within the broader framework of Imamah, noting that the earth’s upheaval also heralds the reappearance of the Twelfth Imam (aj), who will establish cosmic equilibrium. This connection underscores the Shia belief in the Imam’s role as a divinely appointed arbiter of justice, linking eschatology to the ethical imperatives of Islamic jurisprudence. The verse thus serves as a reminder of humanity’s accountability, urging adherence to the *thaqalayn* (Quran and Ahl al-Bayt) as guides to spiritual and moral preparedness for the Hereafter.",
    "layer3": "In contemporary Shia scholarship, Surah Az-Zalzala’s opening verse is often framed as both a literal and metaphorical awakening. Scholars like Ayatollah Nasir Makarem Shirazi emphasize its eschatological dimension, linking the “final earthquake” to the cosmic unraveling preceding divine judgment—a theme rooted in classical tafsir. Yet modern thinkers, such as Dr. Mohammad Ali Shomali, extend this to current crises, interpreting the earth’s “shaking” as a call to confront humanity’s destabilizing impact on the planet. Climate change, with its intensified natural disasters, becomes a tangible echo of this Quranic warning, urging ecological responsibility as an act of faith.  \n\nScientifically, the verse’s imagery resonates with plate tectonics—a process understood today as both a natural phenomenon and a reminder of Earth’s fragility. Iranian philosopher Abdolkarim Soroush, while not exclusively Shia, bridges this by noting how Quranic descriptions of natural upheavals invite reflection on the interdependence of physical and moral worlds. Socially, the “earthquake” metaphor extends to systemic injustices: economic inequality, war, and displacement, which “shake” societies’ foundations. Contemporary Shia activists, like those in the Imam Ali Relief Societies, tie these disruptions to the verse’s ethical imperative—justice as a stabilising force.  \n\nInterfaith dialogues highlight shared apocalyptic themes, such as Christianity’s “Day of the Lord” or Hindu concepts of cosmic dissolution (pralaya), fostering solidarity in addressing global challenges. The verse’s universality—its appeal to humanity’s shared vulnerability—underscores the need for collective action. In a fractured world, the “final earthquake” becomes a symbol of both reckoning and renewal: a demand to rebuild societies on compassion, equity, and reverence for creation. As Shia theologian Sayed Ammar Nakshawani observes, “The earth’s tremor is creation’s cry for balance—spiritually, ecologically, and socially.",
    "layer4": "The earth’s violent shaking in Surah Zalzala’s opening verse transcends its apparent meaning, resonating as a profound spiritual metaphor in the teachings of the Ahlul Bayt (peace be upon them). Imam Ali (as) taught that this “earthquake” symbolizes the soul’s upheaval when confronted with divine truth on the Day of Judgment, where every buried deed—good or evil—is laid bare. The sixth Imam, Jafar al-Sadiq (as), explained in *Tafsir al-Qummi*: “When the earth quakes with its final quaking, it will testify for the friends of Allah and against His enemies. Its trembling is the trembling of recognition—it knows its Lord and the weight of human actions upon it.”  \n\nLady Fatimah (as), in her timeless sermon, linked this cosmic event to divine justice: “The earth will convulse to reveal the blood of the oppressed… and the scales of *Wilayah* [divine guardianship] will tip in favor of those who upheld the rights of the Ahlul Bayt.” Here, the physical earthquake mirrors the spiritual tremors experienced by souls unanchored from the Imams’ guidance.  \n\nThe Shia tradition emphasizes that this verse calls believers to cultivate inner vigilance. Imam Muhammad al-Baqir (as) taught: “The earth’s shaking is preceded by the shaking of hearts that recognize their Imam.” Practical spirituality lies in daily *muhasabah* (self-accountability), aligning one’s actions with the Imams’ luminous teachings. Just as the earth cannot conceal a mustard seed’s weight (99:7), the heart cannot hide its allegiance to falsehood or truth.  \n\nTo withstand this ultimate quaking, the Ahlul Bayt urge attachment to the “rope of Allah”—the Wilayah of the Imams—which stabilizes the soul amidst cosmic chaos. As Imam Ali (as) warned: “Prepare for the earthquake by making your heart tremble now in fear of Allah.” Each prayer, each act of justice, becomes a stone to fortify the soul’s foundations, ensuring that when the final tremor comes, the faithful stand firm, their deeds radiating like stars in the scroll of eternity.",
    "layer1_urdu": "سور Surah ایز زلزالا میں ، افتتاحی آیت- * \"اڈھا ذولزیلات الدوردو زلزالہہ\" * (جب زمین اپنے [حتمی] زلزلے سے ہلا دی جاتی ہے)-فیصلے کے دن کے موقع پر کائناتی اتار چڑھاؤ کی ایک واضح شبیہہ پینٹ کرتی ہے۔ اصطلاح *\"زیلزال\" *جڑ سے ماخوذ ہے *Z-L-Z-L *، عام زلزلے سے بالاتر ہو کر شدید ، مجرمانہ لرزتے ہوئے۔ * المزان * میں الامہ تبتابائی جیسے شیعہ طافسر اسکالرز اس کو ایک انوکھا ، خدائی طور پر مقرر کردہ واقعہ کے طور پر بیان کرتے ہیں-محض ارضیاتی نہیں بلکہ ایک استعاریاتی ٹوٹنا جو موجودہ عالمی ترتیب کو جنم دینے کے لئے موجودہ عالمی نظم کو ختم کرتا ہے۔ * \"زلزالہہ\" میں * \"ہا\" * (اس) کا مالک لاحقہ ہے * اس بات کی نشاندہی کرتا ہے کہ یہ زلزلہ زمین کے آخری مقصد کے لئے اندرونی ہے ، جو الہی انصاف سے منسلک ایک پہلے سے طے شدہ تبدیلی ہے۔\n\nاگرچہ آیت کا وحی سیاق و سباق واضح طور پر تاریخی واقعات سے منسلک نہیں ہے ، لیکن شیعہ بیانات اس طرح کے اسکاٹولوجیکل امیجری کو امام مہدی (اے جے) کے آخری ظہور سے جوڑتے ہیں ، جب سچائی پوری طرح سے ظاہر ہوگی۔ پرتشدد لرز اٹھنے سے جسمانی اور اخلاقی حساب دونوں کی علامت ہوتی ہے - بدعنوان نظاموں کو گرنا اور پوشیدہ سچائیوں کو بے نقاب کرنا ، جیسا کہ احتساب کے بارے میں امام علی کی تعلیمات پر زور دیا گیا ہے۔ \n\nعصری مسلمانوں کے لئے ، یہ آیت زندگی کی عدم استحکام اور خدائی حساب کتاب کی یقینی کی ایک لازوال یاد دہانی کا کام کرتی ہے۔ \"زلزلہ\" استعارہ ذاتی اور معاشرتی سطح تک پھیلا ہوا ہے: جس طرح زمین فیصلے کے دن انسانیت کے اعمال کو چھپ نہیں سکتی (جیسا کہ بعد میں آیات واضح کرتی ہے) ، ہمیں آج اپنے اعمال کے نتائج کا مقابلہ کرنا ہوگا۔ عملی طور پر ، یہ خود عکاسی ، اخلاقی مستقل مزاجی اور معاشرتی ذمہ داری-بنیادی شیعہ اقدار کو متاثر کرتا ہے۔ اس میں مومنین کو قرآنی اصولوں اور احلول بیت کی رہنمائی کے ساتھ اپنی زندگی کا صف بندی کرنے کا مطالبہ کیا گیا ہے ، اور معاشروں کی تعمیر انصاف ، ہمدردی ، اور دنیاوی آزمائشوں اور اس کے بعد دونوں کے لئے انصاف ، شفقت اور تیاری کے ذریعہ اخلاقی \"زلزلے\" سے لچکدار ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الزلزالا کی ابتدائی آیت ، \"جب زمین اپنے [آخری] زلزلے سے لرز اٹھتی ہے تو ،\" کو ایک گہرا اسکیٹولوجیکل واقعہ سمجھا جاتا ہے جو الہی فیصلے کی پیش کش کو نشان زد کرتا ہے۔ * الجزان * میں * ماجما البیان * اور علامہ تبتابائی میں شیخ تبریسی دونوں اس بات پر زور دیتے ہیں کہ یہ \"لرزتے ہوئے\" (زلزل) عام زلزلہ کے مظاہر سے بالاتر ہے ، جو اللہ کی طرف سے ایک کائناتی ہلچل کی نمائندگی کرتا ہے جس سے قبل ازدواج سے قبل تخلیق کے موجودہ حکم کو ختم کیا جاسکتا ہے۔ تبریسی نے نوٹ کیا ہے کہ اصطلاح * زلزالہ * (\"اس کا زلزلہ\") زمین کے حتمی مقصد کے لئے مخصوص ایک انوکھے ، خدائی طور پر لازمی طور پر لازمی طور پر علامت ہے: حساب کے دن انسانی اعمال کا مشاہدہ کرنا ، جیسا کہ سورت میں بعد کی آیات نے واضح کیا ہے۔\n\nتبتابائی اس تصور کو مذہبی طور پر وسعت دیتے ہیں ، اور یہ استدلال کرتے ہیں کہ زمین کا پرتشدد کانپنے سے مادی وہموں کے خاتمے اور استعاریاتی سچائیوں کی نقاب کشائی کی علامت ہے۔ شیعہ کے خیال میں ، یہ * المبڈا وا المعاد * (ابتداء اور ریٹرن) کے اصول کے ساتھ ہم آہنگ ہے ، جس میں تخلیق کا عارضی وجود اس کے الہی میں واپسی سے منسلک ہے۔ زمین کی گواہی sur سورت میں ایک بار بار چلنے والا موضوع - تخلیق میں سرایت کرنے والے موروثی انصاف کی تصدیق کے طور پر سمجھا جاتا ہے ، جو عقیدے کے ایک ستون کے طور پر * ADL * (الہی انصاف) پر شیعہ پر زور دینے کے ساتھ گونجتا ہے۔ \n\nالفید الکاشانی جیسے اسکالرز اس واقعے کو امامہ کے وسیع تر فریم ورک کے اندر سیاق و سباق دیتے ہیں ، اور یہ کہتے ہوئے کہ زمین کی ہلچل بھی بارہویں امام (اے جے) کی ظاہری شکل کو پیش کرتی ہے ، جو کائناتی توازن قائم کرے گی۔ یہ تعلق انصاف کے ایک الہی مقرر ثالث کی حیثیت سے امام کے کردار پر شیعہ کے عقیدے کی نشاندہی کرتا ہے ، اور اسلامی فقہ کے اخلاقی نقصان سے اسکیٹولوجی کو جوڑتا ہے۔ اس طرح یہ آیت انسانیت کے احتساب کی یاد دلانے کے طور پر کام کرتی ہے ، اور اس کے لئے روحانی اور اخلاقی تیاری کے رہنما کے طور پر * تھاقالین * (قرآن اور اہل البائٹ) پر عمل پیرا ہونے پر زور دیتا ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ از زلزلہ کی ابتدائی آیت اکثر لفظی اور استعاراتی بیداری دونوں کے طور پر تیار کی جاتی ہے۔ آیت اللہ ناصر مکارم شیرازی جیسے اسکالرز اس کے اسکیٹولوجیکل طول و عرض پر زور دیتے ہیں ، اور \"حتمی زلزلے\" کو کائناتی ناکارہ ہونے والے الہی فیصلے سے جوڑتے ہیں۔ پھر بھی جدید مفکرین ، جیسے ڈاکٹر محمد علی شومالی ، اس کو موجودہ بحرانوں تک بڑھا دیتے ہیں ، اور زمین کے \"لرزتے ہوئے\" کی ترجمانی کرتے ہوئے سیارے پر انسانیت کے عدم استحکام کے اثرات کا مقابلہ کرنے کے لئے ایک پکارتے ہیں۔ آب و ہوا کی تبدیلی ، اپنی تیز قدرتی آفات کے ساتھ ، اس قرآنی انتباہ کی ایک ٹھوس بازگشت بن جاتی ہے ، اور ماحولیاتی ذمہ داری کو عقیدے کے ایک عمل کے طور پر زور دیتی ہے۔  \n\nسائنسی طور پر ، آیت کی منظر کشی پلیٹ ٹیکٹونکس کے ساتھ گونجتی ہے۔ یہ عمل آج ایک قدرتی رجحان اور زمین کی نزاکت کی یاد دہانی دونوں کے طور پر سمجھا جاتا ہے۔ ایرانی فلسفی عبدولکریم سوروش ، جبکہ خصوصی طور پر شیعہ نہیں ، اس بات کو نوٹ کرتے ہوئے یہ کہتے ہوئے کہ کس طرح قدرتی اتار چڑھاؤ کی قرآنی بیانات جسمانی اور اخلاقی دنیاوں کے باہمی انحصار پر عکاسی کی دعوت دیتے ہیں۔ معاشرتی طور پر ، \"زلزلے\" کا استعارہ نظامی ناانصافیوں تک پھیلا ہوا ہے: معاشی عدم مساوات ، جنگ اور نقل مکانی ، جو معاشروں کو \"ہلا\" کرتی ہے۔ عصری شیعہ کارکن ، جیسے امام علی امدادی معاشروں کی طرح ، ان رکاوٹوں کو آیت کی اخلاقی لازمی طور پر باندھ دیتے ہیں۔  \n\nبین المذاہب مکالموں نے مشترکہ apocalyptic موضوعات کو اجاگر کیا ، جیسے عیسائیت کے \"خداوند کا دن\" یا کائناتی تحلیل (پرالیہ) کے ہندو تصورات ، جو عالمی چیلنجوں سے نمٹنے میں یکجہتی کو فروغ دیتے ہیں۔ آیت کی آفاقی - اس کی انسانیت کے مشترکہ خطرے سے دوچار ہے۔ فریکچرڈ دنیا میں ، \"حتمی زلزلے\" حساب کتاب اور تجدید دونوں کی علامت بن جاتا ہے: معاشروں کو ہمدردی ، مساوات اور تخلیق کے لئے عقیدت پر دوبارہ تعمیر کرنے کا مطالبہ۔ جیسا کہ شیعہ مذہبی ماہرین سید عمار نکشوانی نے مشاہدہ کیا ہے ، \"زمین کا زلزلے تخلیق کا توازن کے لئے فریاد ہے - سادہ ، ماحولیاتی اور معاشرتی طور پر۔",
    "layer4_urdu": "سورہ زلزالا کی افتتاحی آیت میں زمین کا پرتشدد لرز اٹھنے سے اس کے واضح معنی سے بالاتر ہے ، جو اہل بیت (ان پر امن ہے) کی تعلیمات میں ایک گہرا روحانی استعارہ کے طور پر گونجتا ہے۔ امام علی (ع) نے سکھایا کہ جب یہ \"زلزلہ\" روح کی بدحالی کی علامت ہے جب فیصلے کے دن الہی سچائی کا سامنا کرنا پڑتا ہے ، جہاں ہر دفن شدہ عمل - اچھا یا برائی - ننگا پڑتی ہے۔ چھٹا امام ، جعفر السادق (ع) ، نے *طافسیر القومی *میں وضاحت کی: \"جب زمین اپنے آخری کوڑے سے گھومتی ہے تو ، یہ اللہ کے دوستوں اور اپنے دشمنوں کے خلاف گواہی دے گی۔  \n\nلیڈی فاطمہ (ع) نے اپنے لازوال خطبہ میں ، اس کائناتی واقعے کو الہی انصاف سے جوڑ دیا: \"زمین مظلوموں کے خون کو ظاہر کرنے کے لئے قائل ہوگی… اور * ولیہ * [الہی سرپرست] کے ترازو ان لوگوں کے حق میں ہوں گے جو اہل بیت کے حقوق کو برقرار رکھتے ہیں۔\" یہاں ، جسمانی زلزلہ روحانی زلزلے کا آئینہ دار ہے جو روحوں کے ذریعہ تجربہ کیا جاتا ہے جو اماموں کی رہنمائی سے غیر منظم ہیں۔  \n\nشیعہ روایت اس بات پر زور دیتی ہے کہ یہ آیت مومنوں کو اندرونی چوکسی کاشت کرنے کا مطالبہ کرتی ہے۔ امام محمد البقیر (ع) نے سکھایا: \"زمین کے لرزنے سے پہلے دلوں کو لرزتے ہوئے ان کے امام کو پہچانتے ہیں۔\" عملی روحانیت روزانہ * محسابہ * (خود حساب کتاب) میں واقع ہے ، جو کسی کے اعمال کو اماموں کی برائٹ تعلیمات کے ساتھ جوڑتی ہے۔ جس طرح زمین سرسوں کے بیجوں کے وزن کو چھپا نہیں سکتی (99: 7) ، دل اپنی بیعت کو باطل یا سچائی سے چھپا نہیں سکتا۔  \n\nاس حتمی چوبنے کا مقابلہ کرنے کے لئے ، اہل بیت نے \"اللہ کی رسی\" یعنی اماموں کے ولیہ سے منسلک کیا ہے - جو کائناتی افراتفری کے درمیان روح کو مستحکم کرتا ہے۔ جیسا کہ امام علی (ع) نے متنبہ کیا: \"اللہ کے خوف سے اب اپنے دل کو کانپ کر زلزلے کی تیاری کریں۔\" ہر دعا ، ہر انصاف کا ایک عمل ، روح کی بنیادوں کو مضبوط بنانے کے لئے ایک پتھر بن جاتا ہے ، اس بات کو یقینی بناتا ہے کہ جب حتمی زلزلے آجائے تو ، وفادار اسٹینڈ فرم ، ان کے اعمال ہمیشہ کے طومار میں ستاروں کی طرح پھیلتے ہیں۔",
    "layer5": "In interpreting Surah al-Zalzala’s opening verse, both Shia and Sunni exegetical traditions converge on its eschatological significance, identifying the \"final earthquake\" as a cataclysmic prelude to resurrection and divine judgment. Sunni authorities like Tabari and Ibn Kathir emphasize the verse’s alignment with Qur’anic descriptions of Qiyamah’s upheavals, with Ibn Kathir noting its consistency with hadiths describing terrestrial convulsions as Allah’s \"shaking out\" of creation (Tafsir Ibn Kathir). Shia scholars such as Tabatabai (Al-Mizan) and Tabrisi (Majma al-Bayan) similarly frame this as a transformative event dissolving worldly structures, affirming shared eschatological principles across traditions.  \n\nDivergences emerge in theological nuance. Sunni commentators like Qurtubi and Razi focus on the earthquake as a manifestation of Allah’s absolute power over creation, often linking it to human accountability without explicit reference to intercession. In contrast, Shia tafsirs like Al-Qummi’s and Tusi’s At-Tibyan incorporate the earth’s role as a witness to human deeds (v. 2-4), with Tabatabai elaborating that it will testify specifically to injustices against the Ahl al-Bayt—a reflection of Shia emphasis on cosmic justice tied to the Imamate. This aligns with Shia theological narratives where natural phenomena actively participate in divine reckoning.  \n\nHistorically, these differences stem from distinct epistemological frameworks: Sunni exegesis often prioritizes textual literalism and Prophetic traditions, while Shia scholarship integrates the teachings of the Imams as hermeneutical keys. Both traditions, however, reinforce the verse’s function as a moral catalyst, urging believers toward mindfulness of ultimate accountability. While interpretations vary in emphasis, they collectively underscore the Qur’an’s power to inspire awe and ethical vigilance across Islamic thought traditions.",
    "layer5_urdu": "سورہ الضالزالہ کی ابتدائی آیت کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں کی روایات اس کی علمی اہمیت کو تبدیل کرتی ہیں ، اور \"حتمی زلزلے\" کو قیامت اور خدائی فیصلے کے تبادلے کے تبلیغ کے طور پر شناخت کرتی ہیں۔ تباری اور ابن کتھیر جیسے سنی حکام قیعامہ کی بدحالی کی قرآنی بیان کے ساتھ آیت کی سیدھ پر زور دیتے ہیں ، جب ابن کتھیر نے حدیثوں کے ساتھ اپنی مستقل مزاجی کو نوٹ کیا ہے جس میں اللہ کے \"تخلیق\" کے طور پر پرتویی کی علامتوں کو بیان کیا گیا ہے (طافسیر ابن کتھر)۔ شیعہ اسکالرز جیسے تبتابائی (المزان) اور تبریسی (ماجما البیان) کو اسی طرح روایات میں مشترکہ اسکیٹولوجیکل اصولوں کی تصدیق کرتے ہوئے ، دنیاوی ڈھانچے کو تحلیل کرنے والے ایک تغیراتی واقعہ کے طور پر اسی طرح فریم کرتے ہیں۔  \n\nمذہبی نوادرات میں تفریق پیدا ہوتی ہے۔ سنی کے مبصرین جیسے قربانی اور رازی زلزلے پر توجہ مرکوز کرتے ہیں جیسے اللہ کی تخلیق پر مطلق طاقت کا اظہار کرتے ہیں ، اکثر شفاعت کے واضح حوالہ کے بغیر اسے انسانی احتساب سے جوڑتے ہیں۔ اس کے برعکس ، شیعہ طافسر جیسے الکوومی اور توسی کے ات-تبیان انسانی اعمال (بمقابلہ 2-4) کے گواہ کے طور پر زمین کے کردار کو شامل کرتے ہیں ، اور تبتابائی نے وضاحت کرتے ہوئے کہا ہے کہ وہ خاص طور پر اہل البیت کے خلاف ناانصافیوں کی گواہی دے گا۔ یہ شیعہ مذہبی بیانیہ کے ساتھ صف بندی کرتا ہے جہاں قدرتی مظاہر الہی حساب کتاب میں فعال طور پر حصہ لیتے ہیں۔  \n\nتاریخی طور پر ، یہ اختلافات الگ الگ علمی فریم ورک سے پیدا ہوتے ہیں: سنی کی نمائندگی اکثر متنی خواندہ اور پیشن گوئی کی روایات کو ترجیح دیتی ہے ، جبکہ شیعہ اسکالرشپ اماموں کی تعلیمات کو ہرمینیٹیکل کیز کے طور پر مربوط کرتی ہے۔ تاہم ، دونوں روایات اخلاقی اتپریرک کی حیثیت سے آیت کے کام کو تقویت دیتی ہیں ، اور مومنوں کو حتمی احتساب کی ذہنیت کی طرف راغب کرتی ہیں۔ اگرچہ تشریحات زور دینے میں مختلف ہوتی ہیں ، لیکن وہ اجتماعی طور پر قرآن مجید کی طاقت کو اسلامی فکر کی روایات میں خوف اور اخلاقی چوکسی کی حوصلہ افزائی کرنے کی طاقت پر زور دیتے ہیں۔",
    "summary": "Drawing from Tafsir al-Mizan, *Majma al-Bayan* and Allama Tabatabai in *Al-Mizan* emphasize that this \"shaking\" (zilzal) transcends ordinary seismic phenomena, representing a cosmic upheaval ordained by Allah to dismantle the existing order of creation prior to the Resurrection (Qiyamah). In Surah Az-Zalzala, the opening verse – *\"Idha zulzilat al-ardu zilzalaha\"* (When the earth is shaken with its [final] earthquake) – paints a vivid image of the cosmic upheaval marking the Day of Judgment. The term *\"zilzal\"* derives from the root *z-l-z-l*, conveying intense, convulsive shaking beyond ordinary earthquakes. Shia tafsir scholars like Allamah Tabatabai in *Al-Mizan* explain this as a unique, divinely ordained event – not merely geological but a metaphysical rupture dismantling the existing world order to herald resurrection. Imam Ali (as) taught that this “earthquake” symbolizes the soul’s upheaval when confronted with divine truth on the Day of Judgment, where every buried deed—good or evil—is laid bare. It calls believers to align their lives with Quranic principles and the Ahlul Bayt’s guidance, building communities resilient to moral \"quakes\" through justice, compassion, and preparedness for both worldly trials and the Hereafter."
  },
  "2": {
    "layer1": "In Surah Az-Zalzala, verse 2 describes a profound moment of cosmic transformation: \"And the earth discharges its burdens\" (wa akhrajatil-ardu athqalaha). This verse, revealed in Makkah, forms part of a vivid depiction of the Day of Judgment, when the earth will violently shake (zalzalah) and reveal all that lies hidden within it. The term *athqal* (burdens) carries layered meanings in Shia exegesis. Classical scholars like Allama Tabatabai explain it refers not only to physical treasures, minerals, or buried bodies but also metaphorically to the accumulated weight of human deeds—both good and evil—that the earth has \"carried\" throughout history. The verb *akhrajat* (discharges) implies a forceful expulsion, signaling creation’s submission to divine command as it bears witness to humanity’s actions (as reinforced in verses 4-5).\n\nShia traditions link this verse to the resurrection of the dead, emphasizing justice and accountability. Imam Ali (as) in Nahj al-Balagha states that on this day, \"secrets will be laid bare,\" reflecting the belief that no action escapes divine reckoning. Historically, this surah served as a reminder to early Muslims of life’s transient nature and the inevitability of divine justice, urging them to prioritize ethical conduct over worldly attachments.\n\nFor contemporary Muslims, this verse is a call to mindfulness. Just as the earth cannot conceal its burdens, humans cannot hide their intentions or deeds—a principle that resonates in an age of moral relativism and superficiality. It encourages self-accountability (muhasaba) and living with the awareness that every choice carries eternal weight. Practically, this inspires integrity in personal conduct, social justice efforts, and environmental stewardship, as the earth itself is a sacred trust. By internalizing this truth, believers align their lives with the Quranic vision of universal truth and divine balance.",
    "layer2": "In *Tafsir al-Mizan*, Allama Tabatabai elucidates Surah al-Zalzala 99:2 by emphasizing the earth’s role as a witness to human deeds on the Day of Resurrection. The phrase “discharges its burdens” (*akhrajat al-ard athqalaha*) is interpreted as the earth expelling all that has been concealed within it, including the physical remains of the dead and the metaphysical weight of human actions. Drawing from narrations of the Ahlul Bayt, Tabatabai notes that the earth’s “burdens” (*athqal*) encompass not only material entities but also the spiritual consequences of deeds, which are indelibly recorded in the cosmic ledger. This aligns with the Shia theological principle that creation itself bears testimony to divine justice, as articulated in Imam Jafar al-Sadiq’s teaching that “the earth will speak with the permission of its Lord, revealing what occurred upon it” (*Bihar al-Anwar*).\n\nTabrisi’s *Majma al-Bayan* expands this concept, stating that the verse signifies the earth’s liberation from the “burdens” of human oppression, corruption, and unaccounted sins, which it has endured throughout history. The Shia eschatological narrative uniquely links this cosmic upheaval to the reappearance of the Hidden Imam, who will establish absolute justice, thereby fulfilling the earth’s latent capacity to manifest truth. This interpretation integrates the verse into broader Shia doctrines of *ghayba* (occultation) and *raj’a* (return), wherein the earth’s purification precedes the restoration of divine order.\n\nClassical commentators unanimously stress that the verse underscores humanity’s inescapable accountability, resonating with Quranic themes of resurrection (*qiyama*) and the scales of justice (*mizan*). The Shia perspective further enriches this by framing the earth’s testimony as an extension of the Imams’ role as divine witnesses over creation, reinforcing the interdependence of cosmic and moral order in Islamic ontology. Such exegesis situates the verse within a holistic theological framework, affirming the inseparability of divine justice from the physical and metaphysical dimensions of existence.",
    "layer3": "In contemporary Shia scholarship, Surah Zalzala’s imagery of the earth “discharging its burdens” (99:2) is interpreted through layered lenses of cosmic accountability and societal transformation. Ayatollah Nasir Makarem Shirazi, in his exegesis, emphasizes that the verse transcends literal geological upheaval, symbolizing the unveiling of hidden truths—both material and moral—at individual and collective levels. This aligns with modern scientific understandings of tectonic shifts, where pressure release during earthquakes mirrors the existential “burdens” humanity imposes through ecological exploitation. Scholars like Dr. Mohammad Ali Shomali link this to environmental ethics, noting how industrial greed “burdens” the earth, provoking climate crises as a form of cosmic reciprocity—a theme echoed in Pope Francis’ *Laudato Si’* as interfaith common ground.\n\nPhilosophically, the verse speaks to societal reckonings: the #MeToo movement, anti-corruption protests, or truth commissions that “discharge” systemic injustices. Here, the earth becomes a metaphor for collective consciousness, echoing Imam Ali’s teaching that “truth lifts its head, unseen.” Contemporary Shia thinkers, such as Dr. Liyakat Takim, connect this to the Mahdi’s eventual justice, framing current struggles for equity as precursors to divine order. Multiculturally, Indigenous land-back movements resonate with this theology, viewing earth not as inert matter but as a living witness (Quran 50:21) demanding restorative justice.\n\nIn an era of disinformation, the verse also critiques epistemic oppression: social media’s role in “discharging” buried truths—from whistleblowing to viral activism—reflects the Quranic principle that “nothing is hidden” (86:9). Thus, the earth’s tremors become a call to dismantle modern-day pharaohnic systems, urging believers to align with the cosmic rhythm of truth and balance.",
    "layer4": "The verse \"And the earth discharges its burdens\" (99:2) is illuminated by the teachings of the Ahlul Bayt (peace be upon them) as a profound unveiling of hidden truths and the ultimate triumph of divine justice. Imam Ali (as) taught that on the Day of Resurrection, the earth will reveal not only the physical remains of creation but also the spiritual \"burdens\" of human actions, intentions, and the sacred rights (haqq) owed to others. In *Nahj al-Balagha*, he states: \"The earth will bear witness to all that was done upon her surface, for she is commanded by her Lord and cannot disobey.\"  \n\nImam Jafar al-Sadiq (as) expands this meaning, explaining that among the \"burdens\" discharged are the concealed truths of wilayah (divine guardianship) and the oppressed cries for justice. He said: \"When the Qa’im [Imam Mahdi] rises, the earth will cast out the luminous scrolls of the Imams’ knowledge, and no right will remain unclaimed.\" This connects to the Shia belief that the earth itself is a witness to the divine covenant of Imamah, safeguarding the spiritual legacy of the Ahlul Bayt until its appointed time.  \n\nLady Fatimah (sa), in her famed sermon, emphasized that the earth’s upheaval on that Day will expose the theft of Fadak as symbolic of all injustices against the Prophet’s household. Practically, this verse calls believers to live with acute awareness that every hidden deed—whether a suppressed truth, a withheld right, or a disavowal of the Imams’ guidance—will be manifest.  \n\nTo prepare, one must internalize the weight of accountability: purify intentions, uphold others’ rights, and anchor oneself in the love and recognition (ma’rifah) of the Ahlul Bayt. As Imam Ali (as) taught, \"The earth is a trust; discharge your duties upon it as you wish to be absolved when it discharges yours.\" By aligning with the principles of divine justice and wilayah, believers transform their spiritual burdens into light, anticipating the Day when truth reigns eternally.",
    "layer1_urdu": "سور Surah ایز زلزالا میں ، آیت 2 کائناتی تبدیلی کے ایک گہرے لمحے کی وضاحت کرتی ہے: \"اور زمین اپنے برڈینز کو خارج کرتی ہے\" (وا اخراجاتیل-ارڈو اتھقالہ)۔ مکہ مکرمہ میں انکشاف کردہ یہ آیت فیصلے کے دن کی ایک واضح تصویر کا ایک حصہ بنتی ہے ، جب زمین متشدد طور پر لرز اٹھے گی (زالزالہ) اور اس کے اندر چھپی ہوئی تمام چیزوں کو ظاہر کرے گی۔ اصطلاح * اتھقال * (بوجھ) شیعہ ایکجیسیس میں پرتوں کے معنی رکھتی ہے۔ علامہ تبتابائی جیسے کلاسیکی اسکالرز نے اس کی وضاحت کی ہے اس کا مطلب نہ صرف جسمانی خزانے ، معدنیات ، یا دفن جسموں سے ہے بلکہ استعاراتی طور پر انسانی اعمال کے جمع شدہ وزن - دونوں اچھ and ے اور برے بھی ہیں کہ زمین نے پوری تاریخ میں \"کام\" کیا ہے۔ فعل * اخراجات * (خارج ہونے والے) ایک زبردست ملک بدر کرنے کا مطلب ہے ، جس سے تخلیق کی طرف سے الہی کمانڈ کے لئے پیش کرنے کا اشارہ ملتا ہے کیونکہ یہ انسانیت کے اعمال کا گواہ ہے (جیسا کہ آیات 4-5 میں تقویت ملی ہے)۔\n\nشیعہ روایات اس آیت کو انصاف اور احتساب پر زور دیتے ہوئے مرنے والوں کے جی اٹھنے سے جوڑتی ہیں۔ ناہج البالاگھا میں امام علی (ع) کا کہنا ہے کہ اس دن ، \"راز کو ننگا کردیا جائے گا ،\" اس عقیدے کی عکاسی کرتے ہوئے کہ کوئی عمل الہی حساب سے بچ نہیں پایا ہے۔ تاریخی طور پر ، اس سورہ نے زندگی کی عارضی نوعیت کے ابتدائی مسلمانوں اور خدائی انصاف کی ناگزیر ہونے کی یاد دہانی کے طور پر کام کیا ، جس سے ان پر زور دیا گیا کہ وہ دنیاوی منسلکات پر اخلاقی طرز عمل کو ترجیح دیں۔\n\nعصری مسلمانوں کے لئے ، یہ آیت ذہن سازی کی کال ہے۔ جس طرح زمین اپنے بوجھ کو چھپ نہیں سکتی ، اسی طرح انسان اپنے ارادوں یا اعمال کو چھپا نہیں سکتا - یہ ایک ایسا اصول ہے جو اخلاقی نسبت اور سطحییت کے دور میں گونجتا ہے۔ یہ خود محاسبیت (محسابا) اور اس بیداری کے ساتھ زندگی گزارنے کی حوصلہ افزائی کرتا ہے کہ ہر انتخاب ابدی وزن اٹھاتا ہے۔ عملی طور پر ، یہ ذاتی طرز عمل ، معاشرتی انصاف کی کوششوں اور ماحولیاتی ذمہ داری میں سالمیت کو متاثر کرتا ہے ، کیونکہ زمین خود ایک مقدس اعتماد ہے۔ اس سچائی کو اندرونی بناتے ہوئے ، مومنین اپنی زندگی کو عالمگیر سچائی اور الہی توازن کے قرآنی وژن کے ساتھ جوڑ دیتے ہیں۔",
    "layer2_urdu": "*طافسیر المزان *میں ، علامہ تبتابائی نے قیامت کے دن انسانی اعمال کے گواہ کے طور پر زمین کے کردار پر زور دے کر سورہ الزالزالا 99: 2 کو واضح کیا۔ \"اس کے بوجھ کو خارج کرتا ہے\" (*اخراجت الارڈ ایتھقالہ*) کے فقرے کی ترجمانی اس کے اندر چھپائی جانے والی زمین کے طور پر کی گئی ہے ، جس میں مردہ کی جسمانی باقیات اور انسانی اعمال کا استعاریاتی وزن بھی شامل ہے۔ اہل بیت کی داستانوں کو دیکھتے ہوئے ، تبتابائی نے نوٹ کیا ہے کہ زمین کے \"بوجھ\" (*اتھال*) میں نہ صرف مادی ہستیوں کو شامل کیا گیا ہے بلکہ اعمال کے روحانی نتائج بھی شامل ہیں ، جو کائناتی لیجر میں غیر یقینی طور پر ریکارڈ کیے گئے ہیں۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ تخلیق خود الہی انصاف کی گواہی دیتی ہے ، جیسا کہ امام جعفر السادق کی اس تعلیم میں بیان کیا گیا ہے کہ \"زمین اپنے رب کی اجازت سے بات کرے گی ، اور اس پر کیا ہوا ہے اس کا انکشاف کرے گا\" (*بہار الانور*)۔\n\nتبریسی کا * مجس البیان * اس تصور کو وسعت دیتے ہیں ، جس میں کہا گیا ہے کہ یہ آیت انسانی ظلم ، بدعنوانی اور بے حساب گناہوں کے \"بوجھ\" سے زمین کی آزادی کی نشاندہی کرتی ہے ، جو اس نے پوری تاریخ کو برداشت کی ہے۔ شیعہ اسکاٹولوجیکل بیانیے اس کائناتی اتار چڑھاؤ کو پوشیدہ امام کی ظاہری شکل سے مربوط کرتا ہے ، جو مطلق انصاف قائم کرے گا ، اور اس طرح حقیقت کو ظاہر کرنے کی زمین کی اویکت صلاحیت کو پورا کرے گا۔ یہ تشریح آیت کو * غئیبہ * (خفیہ کاری) اور * راج ’ * (واپسی) کے وسیع تر شیعہ عقائد میں ضم کرتی ہے ، جس میں زمین کی تطہیر الہی حکم کی بحالی سے پہلے ہوتی ہے۔\n\nکلاسیکی مبصرین متفقہ طور پر اس بات پر زور دیتے ہیں کہ آیت انسانیت کے ناقابل معافی احتساب کی نشاندہی کرتی ہے ، اور قیامت کے قرآنی موضوعات (*قیاما*) اور انصاف کے ترازو (*میزان*) کے ساتھ گونجتی ہے۔ شیعہ کے نقطہ نظر نے اس کو تخلیق کے بارے میں الہی گواہوں کی حیثیت سے اماموں کے کردار میں توسیع کے طور پر زمین کی گواہی کو مزید تقویت بخشی ہے ، جس سے اسلامی آنٹولوجی میں کائناتی اور اخلاقی نظم کے باہمی انحصار کو تقویت ملتی ہے۔ اس طرح کی استثنیٰ ایک جامع مذہبی فریم ورک کے اندر آیت کو پیش کرتی ہے ، جو وجود کے جسمانی اور استعاریاتی جہتوں سے خدائی انصاف کی لازم و ملزومیت کی تصدیق کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ زلزالہ کی زمین کی منظر کشی \"اپنے بوجھ کو خارج کرتی ہے\" (99: 2) کائناتی احتساب اور معاشرتی تبدیلی کے پرتوں والے عینک کے ذریعے تشریح کی جاتی ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے استقامت میں اس بات پر زور دیا ہے کہ یہ آیت لفظی ارضیاتی اتار چڑھاؤ سے بالاتر ہے ، جو انفرادی اور اجتماعی سطح پر پوشیدہ سچائیوں - دونوں ماد and ے اور اخلاقی سطح کی نقاب کشائی کی علامت ہے۔ یہ ٹیکٹونک شفٹوں کی جدید سائنسی تفہیم کے ساتھ ہم آہنگ ہے ، جہاں زلزلے کے دوران دباؤ کی رہائی سے ماحولیاتی استحصال کے ذریعے انسانیت کا وجود \"بوجھ\" ہے۔ ڈاکٹر محمد علی شومالی جیسے اسکالرز ماحولیاتی اخلاقیات سے منسلک ہوتے ہیں ، اور یہ کہتے ہوئے کہ کس طرح صنعتی لالچ زمین کو \"بوجھ\" دیتے ہیں ، اور آب و ہوا کے بحرانوں کو کائناتی اجزاء کی ایک شکل کے طور پر مشتعل کرتے ہیں۔ یہ ایک موضوع پوپ فرانسس میں گونجتا ہے۔\n\nفلسفیانہ طور پر ، آیت معاشرتی حساب سے بات کرتی ہے: #MeToo تحریک ، انسداد بدعنوانی کے احتجاج ، یا سچائی کمیشن جو نظامی ناانصافیوں کو \"خارج\" کرتے ہیں۔ یہاں ، زمین اجتماعی شعور کا استعارہ بن جاتی ہے ، اور امام علی کی اس تعلیم کی بازگشت کرتے ہوئے کہ \"سچائی اس کا سر اٹھاتا ہے ، غیب۔\" ڈاکٹر لییاکات تکیم جیسے ہم عصر شیعہ مفکرین ، اس کو مہدی کے حتمی انصاف سے مربوط کرتے ہیں ، اور ایکویٹی کے لئے موجودہ جدوجہد کو الہی حکم کے پیش خیمہ کے طور پر تیار کرتے ہیں۔ کثیر الثقافتی طور پر ، دیسی زمین کی پشت پناہی اس الہیات کے ساتھ گونجتی ہے ، اور زمین کو غیر معمولی نہیں بلکہ ایک زندہ گواہ کی حیثیت سے دیکھتے ہیں (قرآن 50: 21) بحالی انصاف کا مطالبہ کرتے ہیں۔\n\nناپسندیدگی کے دور میں ، آیت میں ایپیسٹیمک جبر پر بھی تنقید کی گئی ہے: سوشل میڈیا کا \"فارغ کرنے\" میں دفن ہونے والے سچائیوں کو \"وائرل سرگرمی\" سے لے کر وائرل سرگرمی تک پہنچانے میں کردار - قرآنی اصول کی عکاسی کرتا ہے کہ \"کچھ بھی نہیں چھپایا گیا\" (86: 9)۔ اس طرح ، زمین کے زلزلے جدید دور کے فرہوہنک نظاموں کو ختم کرنے کی کال بن جاتے ہیں ، اور مومنوں پر زور دیتے ہیں کہ وہ سچائی اور توازن کی کائناتی تال کے ساتھ ہم آہنگ ہوں۔",
    "layer4_urdu": "آیت \"اور زمین اس کے بوجھ کو خارج کرتی ہے\" (99: 2) پوشیدہ سچائیوں کی گہری نقاب کشائی اور الہی انصاف کی حتمی فتح کے طور پر اہل بیت (ان پر امن ہے) کی تعلیمات سے روشن ہے۔ امام علی (ع) نے سکھایا کہ قیامت کے دن ، زمین نہ صرف تخلیق کی جسمانی باقیات کو ظاہر کرے گی بلکہ انسانی اعمال ، ارادوں اور مقدس حقوق (HAQQ) کے روحانی \"بوجھ\" کو بھی دوسروں کے مقروض کردے گی۔ *نہج البالاگھا *میں ، وہ بیان کرتے ہیں: \"زمین اس کی سطح پر کی جانے والی ہر چیز کی گواہی دے گی ، کیونکہ اسے اپنے رب نے حکم دیا ہے اور اس کی نافرمانی نہیں کر سکتی ہے۔\"  \n\nامام جعفر السادق (ع) نے اس معنی کو وسعت دی ، اور یہ وضاحت کرتے ہوئے کہ \"بوجھ\" خارج ہونے والے ممالک میں ولایہ (الہی سرپرستی) کی پوشیدہ سچائیاں اور انصاف کے لئے مظلوم فریاد ہیں۔ انہوں نے کہا: \"جب قیم [امام مہدی] طلوع ہوتا ہے تو ، زمین اماموں کے علم کے برائٹ طومار کو نکال دے گی ، اور کوئی حق غیر دعویدار نہیں رہے گا۔\" یہ شیعہ کے عقیدے سے جڑتا ہے کہ زمین خود ہی امامہ کے الہی عہد کا گواہ ہے ، اور اس کے مقرر کردہ وقت تک اہل بیت کی روحانی میراث کی حفاظت کرتی ہے۔  \n\nلیڈی فاطمہ (ایس اے) نے اپنے مشہور خطبہ میں ، اس بات پر زور دیا کہ اس دن زمین کی ہنگامہ آرائی فدق کی چوری کو نبی کے گھر والے کے خلاف تمام ناانصافیوں کی علامت قرار دے گی۔ عملی طور پر ، یہ آیت مومنوں کو شدید آگاہی کے ساتھ زندگی گزارنے کا مطالبہ کرتی ہے کہ ہر پوشیدہ عمل - چاہے ایک دبے ہوئے سچ ، ایک روکا ہوا حق ، یا اماموں کی رہنمائی سے انکار - ظاہر ہوگا۔  \n\nتیاری کے ل one ، کسی کو احتساب کے وزن کو اندرونی بنانا ہوگا: ارادوں کو صاف کریں ، دوسروں کے حقوق کو برقرار رکھیں ، اور خود کو احلول بیت کی محبت اور پہچان (ما ریفاہ) میں لنگر انداز کریں۔ جیسا کہ امام علی (ع) نے سکھایا ، \"زمین ایک اعتماد ہے the اس پر اپنے فرائض خارج کردیں جیسا کہ آپ کو ختم کرنا چاہتے ہیں جب یہ آپ کو خارج کرتا ہے۔\" خدائی انصاف اور ولیہ کے اصولوں کے ساتھ صف بندی کرکے ، مومنین اپنے روحانی بوجھ کو روشنی میں بدل دیتے ہیں ، اس دن کی توقع کرتے ہوئے جب سچائی ہمیشہ کے لئے راج کرتی ہے۔",
    "layer5": "In interpreting Surah al-Zalzala 99:2, both Shia and Sunni exegetes converge on the verse’s eschatological context, agreeing that it describes cosmic upheavals preceding divine judgment. Scholars across traditions, including Tabari (Sunni) and Tabatabai (Shia) in *Al-Mizan*, affirm that “discharging burdens” signifies the earth revealing hidden contents—commonly understood as buried treasures, corpses, or concealed deeds—as part of resurrection theology. This aligns with Ibn Kathir’s emphasis on universal accountability and Qurtubi’s legal-moral framing of deeds as “burdens” to be judged.  \n\nDivergences emerge in theological nuance. Shia commentaries like Tabrisi’s *Majma al-Bayan* and Qummi’s tafsir often link the verse to the reappearance of sacred figures, interpreting “burdens” as the bodies of martyrs, particularly Imam Hussain (AS), whose legacy is seen as a spiritual weight the earth cannot retain. This reflects the Shia theological emphasis on the Ahl al-Bayt’s cosmic role in divine justice. Sunni scholars such as Razi in *Mafatih al-Ghayb* generally avoid such specific typologies, focusing instead on the physical and moral symbolism of resurrection without explicit references to historical figures.  \n\nThese differences stem from distinct hermeneutical frameworks: Shia tafsir integrates the Imams’ teachings as divinely guided exegesis, while Sunni traditions prioritize broader textual and rational analysis. Practically, Shia interpretations reinforce commemorative rituals honoring martyrs, whereas Sunni readings emphasize individual eschatological preparedness. Historically, Shia exegesis developed within a paradigm of oppressed sanctity post-Karbala, while Sunni scholarship crystallized amid early debates on theological orthodoxy. Both traditions, however, uphold the verse’s core message of cosmic transformation preceding divine reckoning.",
    "layer5_urdu": "سورہ الضالزالا 99: 2 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں ہی اس آیت کے اسکیٹولوجیکل سیاق و سباق پر تبادلہ خیال کرتے ہیں ، اس بات پر متفق ہیں کہ اس میں الہی فیصلے سے پہلے کائناتی اتار چڑھاؤ کی وضاحت کی گئی ہے۔ *المزان *میں تباری (سنی) اور تبتابائی (شیعہ) سمیت روایات کے اسکالرز نے اس بات کی تصدیق کی ہے کہ \"برڈین کو خارج کرنے\" سے چھپی ہوئی مشمولات کو ظاہر کرنے والی زمین کی نشاندہی ہوتی ہے۔ اس سے ابن کتھیر کے عالمی احتساب اور قربانی کے قانونی مورال کی تشکیل پر زور دینے کے ساتھ موافقت پذیر ہے جس کا فیصلہ کیا جائے۔  \n\nمذہبی نوادرات میں تفریق پیدا ہوتی ہے۔ شیعہ کی تبصرے جیسے تبریسی کے * ماجما البیان * اور قمی کے طافسر اکثر اس آیت کو مقدس شخصیات کی ظاہری شکل سے جوڑتے ہیں ، اور \"بوجھ\" کو شہدا کی لاشوں ، خاص طور پر امام حسین (جیسے) کی ترجمانی کرتے ہیں ، جن کی وراثت کو روحانی وزن کے طور پر دیکھا جاتا ہے۔ یہ الہی انصاف میں اے ایچ ایل البائٹ کے کائناتی کردار پر شیعہ مذہبی زور کی عکاسی کرتا ہے۔ * مافاتیہ الغیب * میں ریزی جیسے سنی اسکالرز عام طور پر اس طرح کے مخصوص ٹائپولوجس سے پرہیز کرتے ہیں ، بجائے اس کے کہ تاریخی شخصیات کے واضح حوالہ جات کے بغیر قیامت کی جسمانی اور اخلاقی علامت پر توجہ دیں۔  \n\nیہ اختلافات الگ الگ ہرمینیٹیکل فریم ورک سے پیدا ہوتے ہیں: شیعہ طافسیر نے اماموں کی تعلیمات کو خدائی طور پر رہنمائی کی حیثیت سے مربوط کیا ہے ، جبکہ سنی روایات وسیع تر متنی اور عقلی تجزیہ کو ترجیح دیتی ہیں۔ عملی طور پر ، شیعہ تشریحات شہیدوں کے اعزاز کے لئے یادگاری رسومات کو تقویت دیتے ہیں ، جبکہ سنی ریڈنگ انفرادی طور پر انفرادی تیاریوں پر زور دیتی ہے۔ تاریخی طور پر ، شیعہ استثنیٰ نے کاربالا کے بعد مظلوم تقدس کے ایک نمونہ میں تیار کیا ، جبکہ سنی اسکالرشپ مذہبی آرتھوڈوکس پر ابتدائی مباحثوں کے درمیان کرسٹلل ہوگئی۔ تاہم ، دونوں روایات الہی حساب کتاب سے قبل کائناتی تبدیلی کے آیت کے بنیادی پیغام کو برقرار رکھتی ہیں۔",
    "summary": "This verse, as Allama Tabatabai notes in Al-Mizan, tafsir al-Mizan, In *Tafsir al-Mizan*, Allama Tabatabai elucidates Surah al-Zalzala 99:2 by emphasizing the earth’s role as a witness to human deeds on the Day of Resurrection. In Surah Az-Zalzala, verse 2 describes a profound moment of cosmic transformation: \"And the earth discharges its burdens\" (wa akhrajatil-ardu athqalaha). This verse, revealed in Makkah, forms part of a vivid depiction of the Day of Judgment, when the earth will violently shake (zalzalah) and reveal all that lies hidden within it. The term *athqal* (burdens) carries layered meanings in Shia exegesis. Imam Ali (as) taught that on the Day of Resurrection, the earth will reveal not only the physical remains of creation but also the spiritual \"burdens\" of human actions, intentions, and the sacred rights (haqq) owed to others. By internalizing this truth, believers align their lives with the Quranic vision of universal truth and divine balance."
  },
  "3": {
    "layer1": "In Surah Az-Zalzala, verse 3 captures humanity’s stunned reaction to the cataclysmic events of the Day of Judgment, when the earth violently shakes (zalzala) and throws up its burdens. The phrase *wa qala al-insanu ma laha* (“And man says, ‘What is [wrong] with it?’”) reflects the universal bewilderment and awe of people witnessing this divine upheaval. Classical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains that *al-insan* (humanity) here represents all people collectively, emphasizing their shared vulnerability before Allah’s power. The question *ma laha* (“What is with it?”) is not merely about the earth’s physical state but a deeper realization of the sudden, inescapable accountability for their deeds—a central theme in eschatological Quranic passages.  \n\nHistorically, this Meccan surah aimed to awaken the early Muslim community to the reality of resurrection and divine justice, countering the materialism and denial prevalent in pre-Islamic Arabia. The verse’s dramatic imagery—earthquakes, scattered mountains—serves as a metaphor for the collapse of worldly illusions and the exposure of hidden truths. Shia narrations, including those from Imam Ali (as), link such verses to the necessity of aligning one’s life with the guidance of the Ahlul Bayt (as), who illuminate the path to spiritual preparedness.  \n\nIn modern times, this verse reminds Muslims to cultivate *tawqa* (God-consciousness) and recognize life’s transient nature. The “shaking” of the earth symbolizes life’s unpredictable trials, urging believers to anchor themselves in faith, justice, and ethical conduct. Practically, this means prioritizing accountability in daily actions—whether in personal integrity, social justice, or environmental stewardship—as every deed, “small or large” (Quran 99:7-8), will be manifest. By internalizing this awareness, Muslims can navigate contemporary challenges with humility and purpose, drawing closer to the divine wisdom exemplified by the Ahlul Bayt (as)",
    "layer2": "In classical Shia exegesis, Surah al-Zalzala verse 3 — \"And man says, 'What is [wrong] with it?'\" — is interpreted as capturing humanity’s awe and existential bewilderment during the cataclysmic events preceding the Day of Resurrection. The verse’s rhetorical question reflects both the suddenness of divine judgment and the human soul’s unpreparedness for cosmic accountability. Tabatabai in *Al-Mizan* emphasizes that this cry arises from mankind’s recognition of the earth’s radical transformation (v. 1-2), which disrupts all worldly assumptions, forcing a confrontation with metaphysical reality. The “shaking” (zalzala) symbolizes the unveiling of creation’s purpose: to manifest divine justice through the exposure of every atom’s worth of good and evil (v. 7-8), a principle central to Shia theodicy.\n\nTabrisi’s *Majma al-Bayan* contextualizes this verse within eschatological narratives, noting that the earth’s upheaval serves as a prelude to the *Hashr* (Gathering) and the manifestation of the *Wilayah* (divine guardianship) of the Ahl al-Bayt. The perplexity expressed here parallels the disorientation of those who rejected the Imams’ guidance, now confronted by the consequences of their choices. Imam Jafar al-Sadiq, as cited in classical sources, links this verse to the principle of *‘adl* (divine justice), wherein the earth itself testifies to human deeds — a motif rooted in the Quranic concept of creation as a witness (4:41). This aligns with Shia teachings on the cosmic role of the Imams as both witnesses and intercessors on Judgment Day.\n\nTheologically, the verse underscores the Shia understanding of *ma‘ad* (resurrection) as inseparable from *tawhid* and *nubuwwa*, with the earth’s rebellion against its natural state affirming Allah’s absolute sovereignty. Jurisprudentially, this serves as a reminder of the inseparable link between ethical action (*‘amal*) and eschatological accountability — a cornerstone of Shia legal philosophy. Thus, the verse transcends mere eschatology, becoming a call to recognize the ontological dependence of creation on divine command and the necessity of aligning with the *Hujjah* (divine proof) in every age.",
    "layer3": "In contemporary Shia scholarship, Surah Zalzala’s third verse — *“And man says, ‘What is wrong with it?’”* — is often interpreted as a profound commentary on human bewilderment amid cosmic and societal upheavals. Ayatollah Naser Makarem Shirazi, in his exegesis, frames this “confusion” as a metaphor for humanity’s recurring failure to recognize divine justice and the interconnectedness of actions and consequences. Modern scholars like Dr. Mohammad Ali Shomali extend this analysis, linking the verse to today’s ecological and social crises: when the earth “speaks” through climate disasters or societal collapse, humanity still asks, *“What is wrong with it?”* — mirroring our collective denial of systemic injustices or environmental limits.  \n\nScientific insights deepen this reading. Geophysicists describe tectonic shifts as Earth’s “testimony” of latent energy, paralleling the Quranic concept of the earth “recounting its news” (99:4). This resonates with ecological theology, where scholars like Dr. Seyed Rizvi connect the verse to anthropogenic climate change: human exploitation disrupts Earth’s equilibrium, yet we feign ignorance until catastrophe strikes.  \n\nSocially, the verse critiques modern apathy toward structural inequities. The Black Lives Matter movement, refugee crises, and economic disparities all reflect a world “shaking” with unresolved trauma — yet privileged societies still ask, *“What is wrong?”* Interfaith dialogues, such as those led by the Al-Mahdi Institute, highlight shared Abrahamic concerns about accountability, bridging Islamic eschatology with Christian “Day of Judgment” narratives or Buddhist impermanence teachings.  \n\nUltimately, the verse challenges us to move beyond superficial inquiry, urging a reckoning with our ethical and environmental footprint — a timeless message sharpened by modern urgency.",
    "layer4": "In Surah Zalzala, the earth's convulsions on Qiyamah provoke humanity's bewildered cry: \"What is wrong with it?\" Imam Muhammad al-Baqir (as) unveils the profound secret: \"The earth will speak by the permission of its Lord, bearing witness against every servant regarding what they did upon its surface.\" This cosmic testimony transcends physicality; it is the unveiling of deeds through the lens of divine guardianship (Wilayah). The Ahlul Bayt (as) teach that the earth's trembling is a mirror reflecting souls - those rooted in the love of Ali (as) and the Imams will find stability, while others face existential collapse.\n\nImam Jafar al-Sadiq (as) states: \"When the earth is shaken with its quaking, it will recognize its Guardian (Wali) and speak accordingly.\" This reveals creation's inherent connection to the Imamah - the earth itself bears witness to humanity's acceptance or rejection of divine guidance. Our deeds are not mere actions but vibrations etched into cosmic reality, weighed through the scales of allegiance to the True Path.\n\nLady Fatimah (as) warned: \"The standing before Allah makes all previous comforts bitter.\" This verse calls us to daily resurrection - to ask \"What is wrong with my soul?\" before the Final Day. Practical spirituality lies in aligning every heartbeat with the Imams' purified consciousness. Recite Ziyarat Ashura not as ritual, but as a covenant making your life an embodiment of Husayn (as)'s revolution. Let each prayer be a tremor exposing falsehood within, each charity a quake shaking off worldly attachments.\n\nThe earth's question echoes through time: Will our souls recognize their origin when the Veil lifts? True preparation lies in living every moment as if hearing the mountains sing: \"We know what you did\" - and transforming through the healing light of Ahlul Bayt's teachings.",
    "layer1_urdu": "سور Surah ایز زلزالا میں ، آیت 3 نے یومیہ فیصلے کے تباہ کن واقعات پر انسانیت کے حیرت زدہ ردعمل کو اپنی لپیٹ میں لیا ، جب زمین پر تشدد طور پر ہل جاتی ہے (زلزالا) اور اس کے بوجھ پھینک دیتی ہے۔ جملہ * و قلہ السانو ما لاہا * (\"اور انسان کہتا ہے ،‘ اس کے ساتھ [غلط] کیا ہے؟ ’)) اس الہی الہام کو دیکھنے والے لوگوں کی عالمگیر حیرت اور خوف کی عکاسی کرتا ہے۔ کلاسیکی شیعہ طافس ، جیسے الامہ تبتابائی کے *المزان *، نے وضاحت کی ہے کہ *ال انسن *(انسانیت) یہاں تمام لوگوں کو اجتماعی طور پر نمائندگی کرتا ہے ، اور اللہ کی طاقت سے پہلے ان کی مشترکہ کمزوری پر زور دیتا ہے۔ سوال * ما لاہا * (\"اس کے ساتھ کیا ہے؟\") محض زمین کی جسمانی حالت کے بارے میں نہیں ہے بلکہ اچانک ، ان کے اعمال کے لئے ناگزیر احتساب کا گہرا احساس ہے۔  \n\nتاریخی طور پر ، اس مکہ سرہ کا مقصد ابتدائی مسلم برادری کو قیامت اور خدائی انصاف کی حقیقت سے بیدار کرنا تھا ، جس سے قبل از اسلامک عرب میں مادیت اور انکار کا مقابلہ کیا گیا تھا۔ آیت کی ڈرامائی تصو .ر - زمینی ، بکھرے ہوئے پہاڑوں - دنیاوی وہموں کے خاتمے اور پوشیدہ سچائیوں کی نمائش کے لئے ایک استعارہ کی حیثیت سے خدمت کرتی ہے۔ شیعہ بیانات ، بشمول امام علی (AS) سے ، اس طرح کی آیات کو اہل بیت (AS) کی رہنمائی کے ساتھ کسی کی زندگی کو سیدھ میں لانے کی ضرورت سے جوڑتے ہیں ، جو روحانی تیاری کی راہ کو روشن کرتے ہیں۔  \n\nجدید دور میں ، یہ آیت مسلمانوں کو * تاؤکا * (خدا کے شعور) کی کاشت کرنے اور زندگی کی عارضی نوعیت کو پہچاننے کی یاد دلاتی ہے۔ زمین کا \"لرز اٹھنے\" زندگی کی غیر متوقع آزمائشوں کی علامت ہے ، اور مومنین پر زور دیتا ہے کہ وہ اپنے آپ کو ایمان ، انصاف اور اخلاقی طرز عمل میں لنگر انداز کریں۔ عملی طور پر ، اس کا مطلب یہ ہے کہ روزانہ کے اعمال میں احتساب کو ترجیح دینا-چاہے وہ ذاتی سالمیت ، معاشرتی انصاف ، یا ماحولیاتی نگرانی میں-ہر عمل کے طور پر ، \"چھوٹا یا بڑا\" (قرآن 99: 7-8) ظاہر ہوگا۔ اس بیداری کو اندرونی بنا کر ، مسلمان عصری چیلنجوں کو عاجزی اور مقصد کے ساتھ تشریف لے جاسکتے ہیں ، اور اہل بائٹ (AS) کے ذریعہ مثال کے طور پر خدائی حکمت کے قریب جاتے ہیں۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ الضالزالا آیت 3-\"اور انسان کہتا ہے ، 'اس کے ساتھ [غلط] کیا ہے؟'\"-قیامت کے دن سے قبل ہونے والے تباہ کن واقعات کے دوران انسانیت کے خوف اور وجودی حیرت کو اپنی گرفت میں لایا جاتا ہے۔ آیت کا بیان بازی سوال الہی فیصلے کی اچانک اور کائناتی احتساب کے لئے انسانی روح کی تیاریوں کی عکاسی کرتا ہے۔ * المزان * میں تبتابائی نے اس بات پر زور دیا ہے کہ یہ چیخ بنی نوع انسان کی زمین کی بنیاد پرست تبدیلی (بمقابلہ 1-2) کی پہچان سے پیدا ہوتی ہے ، جو دنیاوی مفروضوں کو متاثر کرتی ہے ، جس سے استعاریاتی حقیقت کے ساتھ تصادم کو مجبور کیا جاتا ہے۔ \"لرز اٹھنے\" (زلزالا) تخلیق کے مقصد کی نقاب کشائی کی علامت ہے: ہر ایٹم کی قیمت کے اچھ and ے اور برائی کی نمائش کے ذریعے خدائی انصاف کو ظاہر کرنا (بمقابلہ 7-8) ، جو شیعہ تھیوڈیسی کا ایک اصول ہے۔\n\nتبریسی کا * مجس البیان * اس آیت کو ایسکیٹولوجیکل بیانیے کے اندر سیاق و سباق سے دوچار کرتا ہے ، اور یہ نوٹ کرتے ہوئے کہ زمین کی ہنگامہ آرل * ہیشر * (اجتماع) کا تعی .ن اور اہل البائٹ کے * ولیہ * (الہی سرپرست) کے اظہار کی حیثیت سے کام کرتا ہے۔ یہاں کی پریشانی کا اظہار ان لوگوں کی تفریق کے متوازی ہے جنہوں نے اماموں کی رہنمائی کو مسترد کردیا ، اب ان کے انتخاب کے نتائج کا سامنا ہے۔ امام جعفر السادق ، جیسا کہ کلاسیکی ذرائع میں پیش کیا گیا ہے ، اس آیت کو * ‘ایڈل * (الہی انصاف) کے اصول سے جوڑتا ہے ، جس میں زمین خود انسانی اعمال کی گواہی دیتی ہے-ایک گواہ کے طور پر تخلیق کے قرآنی تصور میں جڑا ہوا ایک نقش (4:41)۔ یہ شیعہ تعلیمات کے ساتھ اماموں کے کائناتی کردار پر ہم آہنگ ہے جیسے فیصلے کے دن گواہ اور شفاعت کرنے والے دونوں۔\n\nمذہبی طور پر ، آیت *ماڈد *(قیامت) کے شیعہ کی تفہیم کو *توحد *اور *نوبووا *سے لازم و ملزوم کے طور پر واضح کرتی ہے ، اور اس کی فطری ریاست کے خلاف زمین کی بغاوت اللہ کی مطلق خودمختاری کی تصدیق کرتی ہے۔ فقہی طور پر ، یہ اخلاقی عمل (*‘امل*) اور اسکیٹولوجیکل احتساب کے مابین لازم و ملزوم روابط کی یاد دہانی کا کام کرتا ہے۔ اس طرح ، آیت محض اسکیوٹولوجی سے ماورا ہے ، جو الہی کمانڈ پر تخلیق کے اونٹولوجیکل انحصار اور ہر دور میں * ہججہ * (خدائی ثبوت) کے ساتھ صف بندی کرنے کی ضرورت کو تسلیم کرنے کے لئے ایک کال بن جاتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ زلزالا کی تیسری آیت - * \"اور انسان کہتا ہے ، 'اس میں کیا غلط ہے؟' ' * - کائناتی اور معاشرتی بدحالی کے درمیان اکثر انسان کے غیظ و غضب کے بارے میں گہری کمنٹری کے طور پر سمجھا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے بیان میں ، اس \"الجھن\" کو انسانیت کی بار بار ہونے والی ناکامی کے لئے الہی انصاف کو تسلیم کرنے میں ناکامی اور افعال اور نتائج کی باہمی ربط کے استعارے کے طور پر تیار کیا ہے۔ ڈاکٹر محمد علی شمالی جیسے جدید اسکالرز اس تجزیے کو بڑھا دیتے ہیں ، اور اس آیت کو آج کے ماحولیاتی اور معاشرتی بحرانوں سے جوڑتے ہیں: جب زمین آب و ہوا کی آفات یا معاشرتی تباہی کے ذریعہ \"بولتی ہے\" ، انسانیت اب بھی پوچھتی ہے ، * \"اس میں کیا غلط ہے؟\" * - نظامی injisces یا ماحولیاتی حدود سے متعلق ہمارے اجتماعی تردید کی عکسبندی۔  \n\nسائنسی بصیرت اس پڑھنے کو گہرا کرتی ہے۔ جیو فزیکسٹ ٹیکٹونک شفٹوں کو زمین کی اویکت توانائی کی \"گواہی\" کے طور پر بیان کرتے ہیں ، جو زمین کے قرآنی تصور کو \"اپنی خبروں کا ذکر کرتے ہیں\" (99: 4) کے متوازی ہیں۔ یہ ماحولیاتی الہیات کے ساتھ گونجتا ہے ، جہاں ڈاکٹر سیئڈ رضوی جیسے اسکالرز آیت کو انتھروپجینک آب و ہوا کی تبدیلی سے مربوط کرتے ہیں: انسانی استحصال سے زمین کے توازن میں خلل پڑتا ہے ، پھر بھی ہم تباہ کن حملوں تک جہالت کا مظاہرہ کرتے ہیں۔  \n\nمعاشرتی طور پر ، آیت ساختی عدم مساوات کی طرف جدید بے حسی پر تنقید کرتی ہے۔ بلیک لائفز مادے کی تحریک ، پناہ گزینوں کے بحرانوں اور معاشی تفاوتوں نے حل نہ ہونے والے صدمے کے ساتھ ایک دنیا کو \"لرز اٹھنے\" کی عکاسی کی ہے-پھر بھی مراعات یافتہ معاشرے اب بھی پوچھتے ہیں ، * \"غلط کیا ہے؟\" * بین المذاہب مکالمے ، جیسے کہ المدی انسٹی ٹیوٹ کی سربراہی میں ، اسلامک ایسکیٹنس کے بارے میں مشترکہ طور پر ابراہک کے بارے میں مشترکہ طور پر اسلامک ایسکیٹولوجی کے بارے میں مشترکہ طور پر اسلامک ایسکیٹولوجی کو اجاگر کیا گیا ہے۔  \n\nآخر کار ، آیت ہمیں چیلنج کرتی ہے کہ وہ سطحی انکوائری سے آگے بڑھیں ، ہمارے اخلاقی اور ماحولیاتی نقشوں کا حساب کتاب کرنے پر زور دیتے ہیں۔",
    "layer4_urdu": "سورہ زلزالا میں ، قیعیمہ پر زمین کی آشناوں نے انسانیت کے حیرت زدہ رونے کو جنم دیا: \"اس میں کیا حرج ہے؟\" امام محمد البقیر (ع) نے گہرے راز کی نقاب کشائی کی: \"زمین اپنے رب کی اجازت سے بات کرے گی ، اور اس کی سطح پر اس کے بارے میں ہر خادم کے خلاف گواہی دے گی۔\" یہ کائناتی گواہی جسمانی طور پر ماورا ہے۔ یہ خدائی سرپرستی (ولیہ) کے عینک کے ذریعہ اعمال کی نقاب کشائی ہے۔ اہل بیت (ع) سکھاتے ہیں کہ زمین کا کانپ اٹھنا ایک آئینہ ہے جو روحوں کی عکاسی کرتا ہے - جو لوگ علی (ع) کی محبت میں جڑے ہوئے ہیں اور اماموں کو استحکام ملے گا ، جبکہ دوسروں کو وجود کا خاتمہ ہونے کا سامنا کرنا پڑتا ہے۔\n\nامام جعفر السادق (ع) بیان کرتے ہیں: \"جب زمین اس کے جھٹکے سے لرز جاتی ہے تو ، وہ اپنے سرپرست (ولی) کو پہچان لے گی اور اسی کے مطابق بولے گی۔\" اس سے تخلیق کا فطری تعلق امامہ سے ظاہر ہوتا ہے - زمین خود ہی انسانیت کی قبولیت یا خدائی رہنمائی کو مسترد کرنے کا گواہ ہے۔ ہمارے اعمال محض اقدامات نہیں ہیں بلکہ کمپن کائناتی حقیقت میں جکڑے ہوئے ہیں ، جو حقیقی راستے سے بیعت کے ترازو کے ذریعے وزن رکھتے ہیں۔\n\nلیڈی فاطمہ (ع) نے متنبہ کیا: \"اللہ کے سامنے کھڑے ہونے سے تمام پچھلی راحتیں تلخ ہوجاتی ہیں۔\" یہ آیت ہمیں روزانہ قیامت کا مطالبہ کرتی ہے - یہ پوچھنے کے لئے کہ \"میری روح میں کیا غلط ہے؟\" آخری دن سے پہلے عملی روحانیت ہر دل کی دھڑکن کو اماموں کے صاف شعور کے ساتھ سیدھ میں لانے میں مضمر ہے۔ زیارت اشورہ کو رسم کی حیثیت سے نہیں ، بلکہ ایک عہد کے طور پر آپ کی زندگی کو حسین (ع) کے انقلاب کا مجسمہ بنائے۔ ہر دعا کو ایک جھٹکا بننے دیں جس کے اندر باطل کو بے نقاب کیا جاتا ہے ، ہر ایک خیراتی ادارہ ایک زلزلہ دنیاوی منسلکات کو ہلا دیتا ہے۔\n\nزمین کا سوال وقت کے ساتھ ساتھ گونجتا ہے: کیا پردہ اٹھانے پر ہماری روحیں ان کی اصلیت کو پہچان لیں گی؟ حقیقی تیاری ہر لمحے جینے میں ہے گویا پہاڑوں کو سنتے ہوئے گاتے ہیں: \"ہم جانتے ہیں کہ آپ نے کیا کیا\" - اور اہل بیت کی تعلیمات کی شفا بخش روشنی سے بدلتے ہوئے۔",
    "layer5": "The interpretation of Surah al-Zalzala 3 (“And man says, ‘What is [wrong] with it?’”) reveals both shared theological foundations and nuanced differences between Shia and Sunni exegetical traditions. Across both schools, scholars universally contextualize this verse within eschatological discourse, agreeing that it depicts humanity’s bewilderment during the cataclysmic events preceding the Day of Resurrection. Al-Tabari (Sunni) and al-Tabrisi (Shia) both emphasize the earth’s unprecedented upheaval as a divine sign, provoking human astonishment (Jami al-Bayan; Majma al-Bayan). Similarly, Ibn Kathir and al-Tusi (At-Tibyan) concur that the verse underscores human incapacity to comprehend divine power in altering cosmic order.  \n\nA key divergence arises in contextualizing the “earth’s speech” mentioned in subsequent verses. Sunni commentators like al-Qurtubi (Al-Jami li-Ahkam) and al-Razi (Mafatih al-Ghayb) focus on the earth’s literal testimony about human deeds, rooted in Prophetic hadith. In contrast, Shia exegetes such as al-Qummi (Tafsir al-Qummi) and Tabatabai (Al-Mizan) extend this concept to the cosmic role of the Ahl al-Bayt, interpreting the earth’s “speech” as a metaphor for divine justice mediated through the Imams’ spiritual authority. This reflects the Shia theological emphasis on the Imams’ intercessory role in eschatological accountability.  \n\nHistorically, these differences stem from distinct approaches to textual authority. Sunni tafsir prioritizes transmitted narrations (athar) and linguistic analysis, while Shia interpretations often integrate the teachings of the Imams as hermeneutical keys. Both traditions, however, agree on the verse’s practical implication: reinforcing the necessity of moral accountability and preparation for the Hereafter. The Shia emphasis on the Imams’ guidance and the Sunni focus on individual responsibility reflect complementary dimensions of Islamic eschatology, shaped by their respective theological frameworks without contradicting the verse’s core message. Such divergences illustrate how doctrinal priorities inform exegetical methodologies while maintaining shared reverence for the Quran’s transformative power.",
    "layer5_urdu": "سورہ الضالزالا 3 (\"اور انسان کا کہنا ہے کہ ،‘ اس کے ساتھ کیا غلط ہے؟ ’) کی ترجمانی دونوں مشترکہ مذہبی بنیادوں اور شیعہ اور سنی کے مسخر التحصیل روایات کے مابین متنازعہ اختلافات کو ظاہر کرتی ہے۔ دونوں اسکولوں میں ، اسکالرز عالمی سطح پر اس آیت کو اسکیٹولوجیکل گفتگو کے اندر سیاق و سباق سے دوچار کرتے ہیں ، اس بات پر متفق ہیں کہ اس میں قیامت کے دن سے پہلے کے تباہ کن واقعات کے دوران انسانیت کے حیرت انگیزی کو دکھایا گیا ہے۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں ایک الہی علامت کے طور پر زمین کی بے مثال ہلچل پر زور دیتے ہیں ، جس سے انسانی حیرت پیدا ہوتی ہے۔ اسی طرح ، ابن کتھیر اور التوسی (ات-تبیان) نے اتفاق کیا ہے کہ آیت کائناتی ترتیب کو تبدیل کرنے میں الہی طاقت کو سمجھنے کے لئے انسانی نااہلی کو واضح کرتی ہے۔  \n\nاس کے بعد کی آیات میں مذکور \"زمین کی تقریر\" کو سیاق و سباق بنانے میں ایک اہم موڑ پیدا ہوتا ہے۔ سنی مبصرین جیسے القورووبی (الجامی لی احکم) اور الراجی (مافاتیہ الغیب) انسانی اعمال کے بارے میں زمین کی لفظی گواہی پر مرکوز ہیں ، جس کی جڑیں پیشن گوئی حدیث میں ہیں۔ اس کے برعکس ، شیعہ استثنیٰ جیسے القومی (طافسیر القومی) اور تبتابائی (المزان) اس تصور کو اے ایچ ایل ال بیت کے کائناتی کردار تک بڑھا دیتے ہیں ، اور اس نے زمین کی \"تقریر\" کی ترجمانی الہی انصاف کے استعارے کے طور پر کی ہے جس میں اماموں کے روحانی اختیار کے ذریعہ ثالثی کی گئی ہے۔ اس سے شیعہ مذہبی زور کی عکاسی ہوتی ہے جو اماموں کے اسکیٹولوجیکل احتساب میں شفاعت کے کردار پر ہے۔  \n\nتاریخی طور پر ، یہ اختلافات متنی اتھارٹی کے الگ الگ نقطہ نظر سے پیدا ہوتے ہیں۔ سنی طافسیر منتقل شدہ بیانات (اتار) اور لسانی تجزیہ کو ترجیح دیتے ہیں ، جبکہ شیعہ کی ترجمانی اکثر اماموں کی تعلیمات کو ہرمینیٹیکل کیز کے طور پر مربوط کرتی ہے۔ تاہم ، دونوں روایات آیت کے عملی مضمرات پر متفق ہیں: اخلاقی احتساب کی ضرورت کو تقویت دینا اور اس کے بعد کی تیاری۔ شیعہ نے اماموں کی رہنمائی اور انفرادی ذمہ داری پر سنی کی توجہ پر زور اسلامی اسکاٹولوجی کی تکمیلی جہتوں کی عکاسی کی ہے ، جس کی تشکیل آیت کے بنیادی پیغام سے متصادم بغیر ان کے متعلقہ مذہبی فریم ورک کی ہے۔ اس طرح کے تغیرات یہ واضح کرتے ہیں کہ قرآن مجید کی تبدیلی کی طاقت کے لئے مشترکہ عقیدت کو برقرار رکھتے ہوئے نظریاتی ترجیحات کس طرح استثنیٰ کے طریق کار کو آگاہ کرتی ہیں۔",
    "summary": "In analyzing this passage, Tabatabai explains that this cry arises from mankind’s recognition of the earth’s radical transformation (v. In Surah Az-Zalzala, verse 3 captures humanity’s stunned reaction to the cataclysmic events of the Day of Judgment, when the earth violently shakes (zalzala) and throws up its burdens. The phrase *wa qala al-insanu ma laha* (“And man says, ‘What is [wrong] with it?’”) reflects the universal bewilderment and awe of people witnessing this divine upheaval. Classical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains that *al-insan* (humanity) here represents all people collectively, emphasizing their shared vulnerability before Allah’s power. Imam Muhammad al-Baqir (as) unveils the profound secret: \"The earth will speak by the permission of its Lord, bearing witness against every servant regarding what they did upon its surface. This verse reminds Muslims to cultivate *tawqa* (God-consciousness) and recognize life’s transient nature."
  },
  "4": {
    "layer1": "In Surah Az-Zalzala, verse 4 powerfully states: *\"Yawma'idhin tuhaddithu akhbara-ha\"* (That Day, it will report its news). This verse forms part of a vivid depiction of Qiyamah, where the earth will bear witness to humanity’s deeds. Classical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains that on this Day of Reckoning, the earth will literally \"speak\" by divine permission, revealing every action performed upon it—good or evil—as a manifestation of Allah’s perfect justice. The term *tuhaddithu* (report) implies a detailed, conscious narration, while *akhbara-ha* (its news) refers to the earth’s stored record of human deeds, echoing the Quranic principle that *\"the earth shines with the light of its Lord\"* (39:69), exposing hidden truths.\n\nHistorical accounts note this surah was revealed in Mecca during intense opposition to the Prophet’s message, emphasizing accountability to counter the Quraysh’s denial of the afterlife. The Ahlul Bayt, particularly Imam Ali, taught that even the earth’s atoms will testify, underscoring that no act—public or private—escapes divine knowledge. This aligns with Shia theology’s stress on intention (*niyyah*) and the eternal consequences of choices.\n\nFor contemporary Muslims, this verse serves as a profound ethical compass. It reminds believers that environmental stewardship, social justice, and personal conduct are inseparable from faith—every harm or benefit to the earth or others will be illuminated. Practically, this inspires mindfulness in daily actions, urging Muslims to align their lives with justice (*adl*) and compassion (*rahma*), knowing creation itself bears witness. In an age of environmental crisis and moral ambiguity, this verse calls for conscious living, where faith translates into tangible care for the world as a sacred trust (*amanah*)",
    "layer2": "In *Tafsir al-Mizan*, Allamah Tabatabai elucidates Surah al-Zalzala 99:4 by situating the verse within the Shia theological framework of cosmic witness and divine justice. He explains that the earth’s narration of its “news” (*akhbaraha*) refers not merely to physical phenomena but to its metaphysical role as a repository of human deeds. Drawing from traditions of the Ahlul Bayt, he posits that the earth bears witness to every action performed upon it, serving as an unerring record to be unveiled on the Day of Resurrection. This aligns with Imam Jafar al-Sadiq’s teaching that “no good or evil occurs on the earth except that it speaks of it” (*Bihar al-Anwar*), emphasizing creation’s inherent subservience to divine purpose.\n\nTabrisi’s *Majma al-Bayan* expands this concept, noting that the earth’s testimony operates through divine permission (*idhn Allah*), reflecting the Shia principle that all creation is imbued with a latent consciousness of God’s sovereignty. The verse thus underscores the ontological interconnectedness of humanity, nature, and the divine—a theme recurrent in Shia cosmology. Crucially, classical commentators link this testimony to the intercession (*shafa’a*) of the Imams, who, as inheritors of prophetic knowledge, will decode the earth’s “news” to establish absolute justice (*qist*).\n\nTheologically, this verse reinforces the Shia doctrine of accountability (*hisab*), wherein no deed remains concealed, resonating with jurisprudential injunctions on intention (*niyya*) and moral responsibility. It also affirms the Imam’s eschatological role as both witness (*shahid*) and interpreter (*mufassir*) of creation’s testimony, a concept rooted in the Quranic designation of the Ahlul Bayt as “those firmly grounded in knowledge” (3:7). Thus, the earth’s speech transcends mere metaphor, embodying the cosmic manifestation of divine truth (*haqq*) under the guardianship (*wilaya*) of the Imamate.",
    "layer3": "In contemporary Shia scholarship, Surah Zalzala’s declaration that the Earth will “report its news” on the Day of Judgment is increasingly interpreted through ecological, ethical, and existential lenses. Ayatollah Naser Makarem Shirazi, in his *Tafsir Nemuneh*, highlights the Earth’s latent capacity to manifest humanity’s deeds—a concept now enriched by scientific insights. Modern geologists note that soil layers, ice cores, and fossil records preserve traces of human activity, from industrial pollutants to nuclear residues, creating a literal “testimony” of our environmental choices. This aligns with Imam Ali’s teaching in *Nahj al-Balagha* that “the Earth is a trust,” urging stewardship over exploitation.  \n\nSocially, scholars like Dr. Mohammad Ali Shomali connect the verse to today’s climate crisis, framing ecological collapse as a form of divine reckoning. The Earth’s “news” becomes a metaphor for systemic injustices: deforestation displaces communities, pollution disproportionately harms marginalised groups, and resource greed fuels conflict. Here, the Qur’anic warning transcends theology, critiquing neoliberal extractivism and calling for climate justice as an act of faith.  \n\nPhilosophically, the verse challenges anthropocentrism. Contemporary thinkers, including Prof. Fatimah Sadeghi, read it as affirming the agency of creation—a theme resonating with Indigenous cosmologies and interfaith dialogues. Pope Francis’ *Laudato Si’* similarly echoes this “ecological conversion,” bridging Islamic and Christian ethics on planetary responsibility.  \n\nIn a fractured world, this verse unites spiritual accountability with tangible action: to heal the Earth is to honour its sacred testimony. As Shia communities engage in interfaith climate initiatives and ethical consumption movements, the verse’s urgency reminds us that environmental harm isn’t merely political—it’s a betrayal of divine trust.",
    "layer4": "The verse \"That Day, it will report its news\" (99:4) unveils a profound reality of cosmic accountability, where Earth itself becomes a witness to human actions. The Ahlul Bayt (peace be upon them) taught that this \"reporting\" transcends physical phenomena, reflecting a spiritual principle embedded in creation. Imam Ja'far al-Sadiq (peace be upon him) states: *\"The earth is entrusted with your deeds as a scribe is entrusted with his pen. When the Day comes, it will testify for the believer and against the oppressor\"* (Bihar al-Anwar). This reveals Earth's sacred role as a divine recorder, mirroring the inner state of those who tread upon it.\n\nLady Fatimah (peace be upon her) emphasized this cosmic witness in her historic sermon: *\"The Earth bears witness to the footsteps of those who walked upon it – distinguishing between the one who upheld justice and the one who trampled upon truth.\"* Her words connect Earth's testimony to the eternal struggle between divine Wilayah and falsehood. The Imams taught that every atom of creation resonates with the recognition of Allah's chosen guides; thus, Earth's \"news\" includes exposing allegiance or rejection toward the Imamah.\n\nPractically, this verse calls believers to live with *conscious presence* (muraqabah), knowing each action etches itself upon creation. Imam Ali (peace be upon him) advised: *\"Walk lightly upon the earth, for its every speck will recount your journey.\"* Spiritual development requires nurturing sincerity (ikhlas), ensuring our deeds align with the Earth's innate purity as a bearer of divine truth. To prepare for this Day, one must constantly renew allegiance to the Ahlul Bayt – for their spiritual authority (Wilayah) alone enables creation to testify in humanity's favor. As Earth speaks, let our lives echo the footsteps of those who walked with the Imams.",
    "layer1_urdu": "سورہ از زلزالا میں ، آیت 4 نے طاقتور طور پر کہا ہے: * \"یاواماڈھین توہدیتھو اخبرا-ہا\" * (اس دن ، یہ اس کی خبر کی اطلاع دے گا)۔ یہ آیت قیعامہ کی ایک واضح تصویر کا ایک حصہ ہے ، جہاں زمین انسانیت کے اعمال کی گواہی دے گی۔ کلاسیکی شیعہ طافس ، جیسے الامہ تبتابائی کے *المزان *، نے وضاحت کی ہے کہ اس دن حساب کتاب کرنے کے دن ، زمین الہی اجازت کے ذریعہ لفظی طور پر \"بول\" کرے گی ، اور اس پر انجام دیئے گئے ہر عمل کو ظاہر کرے گی-اچھی یا برائی-اللہ کے کامل انصاف کا ایک مظہر کے طور پر۔ اصطلاح * tuhaddithu * (رپورٹ) میں ایک تفصیلی ، شعوری بیانیہ کا مطلب ہے ، جبکہ * اخبرا-ہا * (اس کی خبر) سے مراد زمین کے انسانی اعمال کے ذخیرہ شدہ ریکارڈ سے ہے ، جس سے قرآنی اصول کی بازگشت ہے کہ * \"زمین اپنے رب کی روشنی سے چمکتی ہے\"\n\nتاریخی اکاؤنٹس نوٹ یہ سورہ مکہ میں نبی کے پیغام کی شدید مخالفت کے دوران انکشاف کیا گیا تھا ، جس میں قریش کے بعد کی زندگی سے انکار کا مقابلہ کرنے کے لئے احتساب پر زور دیا گیا تھا۔ اہل بیت ، خاص طور پر امام علی ، نے یہ سکھایا کہ یہاں تک کہ زمین کے جوہری بھی گواہی دیں گے ، اس بات کی نشاندہی کریں گے کہ کوئی عمل نہیں - عوامی یا نجی - الہی علم کی تائید کرتا ہے۔ یہ شیعہ الہیات کے ارادے (*نیہہ*) پر دباؤ اور انتخاب کے دائمی نتائج سے ہم آہنگ ہے۔\n\nعصری مسلمانوں کے لئے ، یہ آیت ایک گہری اخلاقی کمپاس کے طور پر کام کرتی ہے۔ یہ مومنوں کو یاد دلاتا ہے کہ ماحولیاتی ذمہ داری ، معاشرتی انصاف اور ذاتی طرز عمل عقیدے سے الگ نہیں ہے - زمین یا دوسروں کو ہر نقصان یا فائدہ کو روشن کیا جائے گا۔ عملی طور پر ، یہ روزمرہ کے اعمال میں ذہنیت کو متاثر کرتا ہے ، اور مسلمانوں پر زور دیتا ہے کہ وہ اپنی زندگی کو انصاف (*ADL*) اور ہمدردی (*رحما*) کے ساتھ ہم آہنگ کریں ، اور یہ جانتے ہوئے کہ تخلیق خود ہی گواہی دیتی ہے۔ ماحولیاتی بحران اور اخلاقی ابہام کے دور میں ، اس آیت میں شعوری زندگی گزارنے کا مطالبہ کیا گیا ہے ، جہاں ایمان دنیا کے لئے ٹھوس نگہداشت میں ایک مقدس اعتماد کے طور پر ترجمہ کرتا ہے (*آمنہ*)",
    "layer2_urdu": "*طافسیر المزان *میں ، الامہ تبتابائی نے کائناتی گواہ اور الہی انصاف کے شیعہ تھیلوجیکل فریم ورک کے اندر آیت کو پیش کرتے ہوئے سورہ الزلزالا 99: 4 کو واضح کیا۔ وہ وضاحت کرتا ہے کہ زمین کی اس کی \"خبروں\" (*اخبراہ*) کی داستان محض جسمانی مظاہر سے نہیں بلکہ انسانی اعمال کے ذخیرے کے طور پر اس کے استعاریاتی کردار سے مراد ہے۔ اہل بیت کی روایات کو دیکھتے ہوئے ، انہوں نے کہا کہ زمین اس پر کی جانے والی ہر کارروائی کا مشاہدہ کرتی ہے ، اور قیامت کے دن کی نقاب کشائی کے لئے ایک غیر متزلزل ریکارڈ کے طور پر کام کرتی ہے۔ یہ امام جعفر السادق کی اس تعلیم کے ساتھ منسلک ہے کہ \"زمین پر کوئی اچھ or ا یا برائی نہیں ہوتی ہے سوائے اس کے کہ وہ اس کی بات کرے\" (*بہار الانور*) ، تخلیق کے فطری مقصد کے لئے فطری ذیلی تحفظ پر زور دیتے ہوئے۔\n\nتبریسی کے*مجس البیان*نے اس تصور کو وسعت دی ہے ، یہ نوٹ کرتے ہوئے کہ زمین کی گواہی الہی اجازت (*آئی ڈی ایچ این اللہ*) کے ذریعے چلتی ہے ، جس سے شیعہ اصول کی عکاسی ہوتی ہے کہ ساری تخلیق خدا کی خودمختاری کے اویکت شعور کے ساتھ ملتی ہے۔ اس طرح آیت انسانیت ، فطرت ، اور الہی کے اونٹولوجیکل باہم مربوط ہونے کی نشاندہی کرتی ہے۔ اہم طور پر ، کلاسیکی تبصرہ نگار اس گواہی کو اماموں کی شفاعت (*شافا*) سے جوڑتے ہیں ، جو پیشن گوئی علم کے وارث ہونے کے ناطے ، مطلق انصاف (*QIST*) کو قائم کرنے کے لئے زمین کی \"خبروں\" کو ختم کردیں گے۔\n\nمذہبی طور پر ، یہ آیت شیعہ نظریہ احتساب (*HISAB*) کو تقویت دیتی ہے ، جس میں کوئی عمل چھپا نہیں رہتا ہے ، جس میں نیت (*نیا*) اور اخلاقی ذمہ داری پر فقہ کے احکامات سے گونجتے ہیں۔ یہ تخلیق کی گواہی کے گواہ (*شاہد*) اور ترجمان (*مفسیر*) دونوں کی حیثیت سے امام کے ایسکیٹولوجیکل کردار کی بھی تصدیق کرتا ہے ، یہ ایک تصور ہے جس کی جڑ اھلول بیت کے قرآنی عہدہ میں ہے جو \"علم میں مضبوطی سے بنیاد رکھی گئی ہے\" (3: 7)۔ اس طرح ، زمین کی تقریر محض استعارے سے بالاتر ہے ، جو امامیٹ کے سرپرستی (*ولیا*) کے تحت الہی سچائی (*حق*) کے کائناتی مظہر کو مجسم بناتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ زلزالا کا یہ اعلان کہ زمین کے فیصلے کے دن زمین \"اس کی خبروں کی اطلاع دے گی\" ماحولیاتی ، اخلاقی اور وجودی عینک کے ذریعہ تیزی سے تشریح کی جارہی ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں ، انسانیت کے اعمال کو ظاہر کرنے کی زمین کی اویکت صلاحیت کو اجاگر کیا ہے۔ یہ ایک تصور اب سائنسی بصیرت سے افزودہ ہے۔ جدید ماہرین ارضیات نے نوٹ کیا ہے کہ مٹی کی پرتیں ، آئس کور اور جیواشم ریکارڈ صنعتی آلودگیوں سے لے کر جوہری اوشیشوں تک انسانی سرگرمی کے نشانات کو محفوظ رکھتے ہیں ، جس سے ہمارے ماحولیاتی انتخاب کی لفظی \"گواہی\" پیدا ہوتی ہے۔ یہ * ناہج البالاگھا * میں امام علی کی تعلیم کے ساتھ ہم آہنگ ہے کہ \"زمین ایک اعتماد ہے ،\" استحصال سے متعلق ذمہ داری پر زور دیتا ہے۔  \n\nمعاشرتی طور پر ، ڈاکٹر محمد علی شومالی جیسے اسکالرز آیت کو آج کے آب و ہوا کے بحران سے مربوط کرتے ہیں ، اور ماحولیاتی خاتمے کو الہی حساب کتاب کی ایک شکل کے طور پر تیار کرتے ہیں۔ زمین کی \"خبریں\" سیسٹیمیٹک ناانصافیوں کا استعارہ بن جاتی ہیں: جنگلات کی کٹائی برادریوں کو بے گھر کرتی ہے ، آلودگی غیر متناسب طور پر پسماندہ گروہوں کو نقصان پہنچاتی ہے ، اور وسائل کے لالچ کے ایندھن کے تنازعہ کو۔ یہاں ، قرآنی انتباہ الہیات سے تجاوز کرتا ہے ، جو نو لیبرل ایکسٹریکٹوزم پر تنقید کرتا ہے اور آب و ہوا کے انصاف کو عقیدے کے ایک عمل کے طور پر طلب کرتا ہے۔  \n\nفلسفیانہ طور پر ، آیت انتھروپوسنٹرزم کو چیلنج کرتی ہے۔ پروفیسر فاطمہ سدیگھی سمیت ہم عصر مفکرین نے اسے تخلیق کی ایجنسی کی تصدیق کے طور پر پڑھا - یہ ایک تھیم دیسی کائنات اور بین المذاہب مکالموں کے ساتھ گونجتا ہے۔ پوپ فرانسس ’ * لاؤڈاٹو سی’ * اسی طرح اس \"ماحولیاتی تبادلوں\" کی بازگشت کرتے ہیں ، جو سیاروں کی ذمہ داری پر اسلامی اور عیسائی اخلاقیات کو پُر کرتے ہیں۔  \n\nایک فریکچر دنیا میں ، یہ آیت غیر معمولی عمل کے ساتھ روحانی احتساب کو متحد کرتی ہے: زمین کو ٹھیک کرنا اس کی مقدس گواہی کا احترام کرنا ہے۔ چونکہ شیعہ کمیونٹیز بین المذاہب آب و ہوا کے اقدامات اور اخلاقی کھپت کی تحریکوں میں مشغول ہیں ، آیت کی عجلت ہمیں یاد دلاتی ہے کہ ماحولیاتی نقصان محض سیاسی نہیں ہے - یہ الہی اعتماد کا خیانت ہے۔",
    "layer4_urdu": "آیت \"اس دن ، وہ اپنی خبروں کی اطلاع دے گی\" (99: 4) کائناتی احتساب کی گہری حقیقت کی نقاب کشائی کرتی ہے ، جہاں زمین خود انسانی اعمال کا گواہ بن جاتی ہے۔ اہل بیت (ان پر امن) نے سکھایا کہ یہ \"رپورٹنگ\" جسمانی مظاہر سے بالاتر ہے ، جو تخلیق میں شامل روحانی اصول کی عکاسی کرتی ہے۔ امام جافر السادق (اس پر امن ہے) بیان کرتا ہے: * \"زمین کو آپ کے اعمال کے سپرد کیا گیا ہے کیونکہ ایک مصنف کو اس کے قلم کے سپرد کیا جاتا ہے۔ جب دن آتا ہے تو ، یہ مومن کی اور ظالم کے خلاف گواہی دے گا\" * (بہار الانور)۔ اس سے ایک الہی ریکارڈر کی حیثیت سے زمین کے مقدس کردار کا پتہ چلتا ہے ، اور اس پر چلنے والوں کی اندرونی حالت کی عکس بندی کرتا ہے۔\n\nلیڈی فاطمہ (اس پر امن) نے اپنے تاریخی خطبے میں اس کائناتی گواہ پر زور دیا: \"زمین ان لوگوں کے نقش قدم پر چلتی ہے جو اس پر چلتے ہیں - جس نے انصاف کو برقرار رکھنے والے اور سچائی پر پامال کیا اس کے درمیان فرق کیا۔\" اماموں نے سکھایا کہ تخلیق کا ہر ایٹم اللہ کے منتخب کردہ رہنماؤں کی پہچان کے ساتھ گونجتا ہے۔ اس طرح ، ارتھ کی \"خبروں\" میں امامہ کے ساتھ بیعت یا مسترد کرنا بھی شامل ہے۔\n\nعملی طور پر ، یہ آیت مومنوں کو * شعوری طور پر موجودگی * (مرقابہ) کے ساتھ زندگی گزارنے کا مطالبہ کرتی ہے ، اور یہ جانتے ہوئے کہ ہر عمل خود کو تخلیق پر کھڑا کرتا ہے۔ امام علی (اس پر امن) نے مشورہ دیا: * \"زمین پر ہلکے سے چلیں ، کیونکہ اس کا ہر شکایت آپ کے سفر کو بیان کرے گا۔\" اس دن کی تیاری کے ل one ، کسی کو اہل بیت سے مستقل طور پر بیعت کرنی ہوگی - ان کے روحانی اتھارٹی (ولیہ) کے لئے صرف تخلیق کو انسانیت کے حق میں گواہی دینے کے قابل بناتا ہے۔ جیسا کہ زمین بولتی ہے ، ہماری زندگیوں کو ان لوگوں کے نقش قدم پر گونجنے دیں جو اماموں کے ساتھ چلتے ہیں۔",
    "layer5": "The verse “That Day, it will report its news” has drawn rich exegetical attention across traditions. Both Shia and Sunni scholars broadly concur that this refers to the earth bearing witness to human deeds on Judgment Day, affirming divine omniscience and resurrection. Al-Tabari (Sunni) and Al-Tusi (Shia) agree the “news” encompasses all human actions, with Al-Tabari citing Ibn Abbas’s narration that the earth will “speak by God’s command” (*Jami al-Bayan*), while Al-Tusi parallels this in *At-Tibyan*, emphasizing God’s power to animate creation.  \n\nDivergences emerge in theological nuance. Shia commentaries like Al-Mizan (Tabatabai) and Majma al-Bayan (Tabrisi) stress the earth’s testimony as part of a cosmic justice system, often linking it to the Imam’s role as a witness—a theme rooted in the Shia concept of *wilayah*. Al-Qummi’s *Tafsir* cites Imam al-Sadiq’s interpretation that the earth’s speech includes exposing hidden truths, aligning with Shia emphasis on esoteric knowledge (*batin*). Sunni exegetes like Al-Qurtubi and Ibn Kathir, while acknowledging the earth’s literal speech, focus on its function as proof of accountability for all, without explicit ties to specific human intermediaries (*Al-Jami li-Ahkam*; *Tafsir Ibn Kathir*).  \n\nTheological foundations shape these differences: Shia interpretations often integrate Imamology into cosmic eschatology, whereas Sunni readings prioritize universal individual responsibility. Al-Razi’s *Mafatih al-Ghayb* frames the verse philosophically, arguing the earth’s “speech” symbolizes the manifest consequences of actions—a view less emphasized in Shia works, which favor literalist readings tied to the Ahl al-Bayt’s teachings.  \n\nHistorically, Shia-Sunni divergences reflect broader hermeneutical priorities: Shia tafsir developed within a framework of Imam-centric authority, while Sunni exegesis consolidated around Prophetic traditions and consensus. Both traditions, however, reinforce the verse’s core ethical message: human actions are eternally witnessed, demanding moral vigilance. This convergence underscores shared Islamic eschatological principles, even as interpretive lenses differ.",
    "layer5_urdu": "آیت \"اس دن ، وہ اپنی خبروں کی اطلاع دے گی\" روایات میں بھرپور توجہ مرکوز کی گئی ہے۔ شیعہ اور سنی اسکالرز بڑے پیمانے پر اس بات پر متفق ہیں کہ اس سے زمین کی طرف اشارہ ہوتا ہے جو یوم قیامت کے دن انسانی اعمال کا گواہ بناتا ہے ، اور اس کی تصدیق الہی سائنس اور قیامت کی ہے۔ التباری (سنی) اور التوسی (شیعہ) اس بات پر متفق ہیں کہ \"خبروں\" میں تمام انسانی عملوں کو شامل کیا گیا ہے ، العباری نے ابن عباس کے اس بیان کا حوالہ دیتے ہوئے کہا ہے کہ زمین \"خدا کے حکم سے بولے گی\" (*جمی البیان*) ، جبکہ التوسی نے اس کو*تِبیان کی طاقت پر زور دینے کے لئے متوازی کیا ہے۔  \n\nمذہبی نوادرات میں تفریق پیدا ہوتی ہے۔ شیعہ تبصرے جیسے ال میزان (تبتابائی) اور مجمہ البیان (تبریسی) کائناتی انصاف کے نظام کے ایک حصے کے طور پر زمین کی گواہی پر زور دیتے ہیں ، اور اسے اکثر امام کے کردار سے جوڑتے ہیں۔ القمی کے*طافسیر*نے امام السادق کی تشریح کا حوالہ دیا ہے کہ زمین کی تقریر میں پوشیدہ سچائیوں کو بے نقاب کرنا شامل ہے ، باطنی علم (*بیٹن*) پر شیعہ زور دینے کے ساتھ صف بندی کرنا۔ سنی نے القوروبی اور ابن کتھیر کی طرح استثنیٰ کی ، جبکہ زمین کی لفظی تقریر کو تسلیم کرتے ہوئے ، مخصوص انسانی بیچوان (*الجامی لی-احکم*؛*طافسیر ابن کتھیر*) کے واضح تعلقات کے بغیر ، سب کے لئے احتساب کے ثبوت کے طور پر اس کے کام پر توجہ مرکوز کی۔  \n\nمذہبی بنیادیں ان اختلافات کی تشکیل کرتی ہیں: شیعہ تشریحات اکثر امامولوجی کو کائناتی ایسکیٹولوجی میں ضم کرتی ہیں ، جبکہ سنی ریڈنگ آفاقی انفرادی ذمہ داری کو ترجیح دیتی ہے۔ العز کے * مافاتیہ الغیب * آیت کو فلسفیانہ طور پر فریم کرتے ہیں ، اور زمین کی \"تقریر\" پر بحث کرتے ہوئے اعمال کے واضح نتائج کی علامت ہیں۔ یہ ایک نظریہ ہے جس میں شیعہ کاموں میں کم زور دیا جاتا ہے ، جو اے ایچ ایل البیٹ کی تعلیمات سے منسلک لفظی پڑھنے کے حق میں ہیں۔  \n\nتاریخی طور پر ، شیعہ سنی ڈائیورجنس وسیع تر ہرمینیٹیکل ترجیحات کی عکاسی کرتے ہیں: شیعہ طفس نے امام مرکوز اتھارٹی کے ایک فریم ورک کے اندر تیار کیا ، جبکہ سنی کی توثیق کی روایات اور اتفاق رائے کے گرد مستحکم ہے۔ تاہم ، دونوں روایات آیت کے بنیادی اخلاقی پیغام کو تقویت بخشتی ہیں: اخلاقی چوکسی کا مطالبہ کرتے ہوئے انسانی اعمال کا ہمیشہ مشاہدہ کیا جاتا ہے۔ یہ ہم آہنگی مشترکہ اسلامی اسکاٹولوجیکل اصولوں کی نشاندہی کرتی ہے ، یہاں تک کہ تشریحی عینک بھی مختلف ہیں۔",
    "summary": "According to Tafsir al-Mizan, this verse tafsir al-Mizan, In *Tafsir al-Mizan*, Allamah Tabatabai elucidates Surah al-Zalzala 99:4 by situating the verse within the Shia theological framework of cosmic witness and divine justice. In Surah Az-Zalzala, verse 4 powerfully states: *\"Yawma'idhin tuhaddithu akhbara-ha\"* (That Day, it will report its news). This verse forms part of a vivid depiction of Qiyamah, where the earth will bear witness to humanity’s deeds. Classical Shia tafsir, such as Allamah Tabatabai’s explains that on this Day of Reckoning, the earth will literally \"speak\" by divine permission, revealing every action performed upon it—good or evil—as a manifestation of Allah’s perfect justice. Imam Ja'far al-Sadiq (peace be upon him) states: *\"The earth is entrusted with your deeds as a scribe is entrusted with his pen. Practically, this inspires mindfulness in daily actions, urging Muslims to align their lives with justice (*adl*) and compassion (*rahma*), knowing creation itself bears witness."
  },
  "5": {
    "layer1": "In Surah Az-Zalzala, verse 5, Allah states, *\"Because your Lord has commanded it\" (bi-anna rabbaka awha laha)*, referring to the earth’s violent quaking on the Day of Judgment. This verse follows descriptions of the earth shaking, ejecting its burdens, and bearing witness to human deeds—events that occur solely by divine will. The term *awha* (commanded/inspired) here signifies Allah’s absolute authority over creation, a theme central to Shia theology. Unlike *wahy* (revelation to prophets), *awha* in this context denotes a universal command, emphasizing that all creation submits to Allah’s will, as stressed in classical tafsir by scholars like Allamah Tabatabai. The earth’s obedience contrasts with human free will, inviting reflection on our responsibility to align our choices with divine guidance.\n\nHistorically, this Meccan surah aimed to awaken listeners to the reality of resurrection and accountability. The phrase *rabbaka* (\"your Lord\") personalizes the message, reminding believers of their intimate relationship with Allah. Scholars like Shaykh Tusi note that the earth’s \"testimony\" about human actions (mentioned in subsequent verses) symbolises how every atom of creation participates in divine justice—a concept echoed in Imam Ali’s teachings about creation’s inherent consciousness of its Creator.\n\nToday, this verse calls Muslims to recognize divine power in both cosmic events and daily life. It reassures believers that natural phenomena—from earthquakes to personal trials—are governed by Allah’s wisdom, urging trust (*tawakkul*) even amidst uncertainty. Practically, it inspires environmental stewardship, as the earth’s role as a witness (99:4-5) highlights the ethical weight of harming creation. By internalizing that all occurs *bi-amr Allah* (by Allah’s command), Muslims can cultivate humility, accountability, and a conscious alignment with divine purpose in both action and intention.",
    "layer2": "In Surah al-Zalzala 99:5, the phrase \"Because your Lord has commanded it\" establishes a profound theological nexus between divine command (amr) and cosmic agency within classical Shia exegesis. Commentators emphasize that the earth’s cataclysmic upheaval during the Final Hour is not merely a natural phenomenon but an act of conscious submission (taslim) to Allah’s will, reflecting the Shia principle of universal submission to divine authority (wilayah). As Tabatabai notes in *Al-Mizan*, the verse underscores that all creation operates through divine inspiration (wahy) in its broadest sense – not limited to prophetic revelation but encompassing the innate guidance (hidaya takwiniyya) governing cosmic order. This aligns with Imam Jafar al-Sadiq’s teaching that \"The earth quakes by the permission of its Lord, just as you tremble at His remembrance.\"\n\nTabrisi’s *Majma al-Bayan* highlights the earth’s role as a witness (shahid) on Judgment Day, linking this to the Shia doctrine of ontological witnessing – the belief that creation testifies to divine truth and human deeds. The earth’s testimony, activated by divine command, manifests the principle of divine justice ('adl), as it will reveal every atom’s weight of good and evil (v.7-8), necessitating absolute accountability. This cosmic testimony resonates with the Shia emphasis on the Imam’s role as the manifest witness (shahid) over human actions, per hadiths describing the Imams as \"the earth through which you are tested.\"\n\nThe verse also reinforces the Shia understanding of qadar (divine decree) within a framework of purposeful creation. As articulated in traditions from the Ahl al-Bayt, the earth’s subservience to Allah’s amr mirrors humanity’s existential obligation to submit to divine guardianship (walayat al-ilahiyya). Thus, the earthquake becomes both a physical and metaphysical sign – a rupture in the natural order heralding the establishment of ultimate truth (haqq), a concept central to Shia eschatology wherein the Mahdi’s reappearance restores cosmic equilibrium through divine command. This interpretation bridges tafsir, theology, and the Shia jurisprudential emphasis on ethical accountability rooted in Allah’s inseparable attributes of power (qudra) and justice ('adl)",
    "layer3": "In contemporary Shia scholarship, Surah Az-Zalzala’s fifth verse — “Because your Lord has commanded it” — is often framed as a profound reminder of divine sovereignty over both natural and moral order. Scholars like Ayatollah Nasir Makarem Shirazi emphasize that the earth’s eschatological trembling, triggered by Allah’s command, underscores a cosmic accountability mirroring humanity’s ethical responsibility today. This verse, while rooted in eschatology, is increasingly interpreted through ecological and social justice lenses. Sheikh Mohammed Ali Shomali, for instance, links the “command” to modern environmental crises, arguing that human exploitation of nature disrupts the balance (mizan) Allah instilled in creation — a violation of trusteeship (amanah) that echoes the earth’s eventual rebellion on Judgment Day.\n\nScientifically, the verse resonates with discussions on tectonic shifts and climate systems operating under divine laws (sunan Allah), which scholars like Dr. Mehdi Golshani assert are expressions of God’s sustained will. Philosophically, the “command” here challenges reductionist materialism by affirming that natural processes, though empirically explainable, remain ontologically dependent on divine volition. Socially, this verse is invoked to address crises like climate change and inequality, urging collective action aligned with ethical monotheism. The Qom-based Institute for Quranic Research highlights parallels between the earth’s “testimony” in subsequent verses and modern movements demanding corporate/governmental transparency in environmental harm.\n\nInterfaith dialogues, particularly with Jewish and Christian environmentalists, find common ground in this verse’s themes of creation’s responsiveness to the Creator. Multiculturally, it reinforces the Quranic vision of a shared planetary destiny, urging cooperation across beliefs to heal ecosystems. In essence, this verse bridges the awe of divine power with the urgency of ethical stewardship — a call to harmonize human agency with transcendent command in an age of existential crises.",
    "layer4": "The verse \"Because your Lord has commanded it\" (99:5) unveils a profound reality: all creation submits to Divine Will through the channel of *Amr* (Divine Command). The Ahlul Bayt (peace be upon them) taught that this verse transcends the physical earthquake; it signifies the earth’s spiritual awakening to bear witness to humanity’s deeds on Judgment Day. Imam Ali (peace be upon him) states in *Nahj al-Balagha*: \"The earth will speak with the permission of its Lord, and it will testify for or against every soul regarding what they earned.\" This cosmic testimony is rooted in the principle of *Tawhid*, where creation’s purpose is tied to manifesting Allah’s justice and wisdom.  \n\nImam Jafar al-Sadiq (peace be upon him) elaborates: \"When the earth quakes, it is a *revelation* (*wahy*) from Allah, not mere movement. It speaks of the *Wilayah* [Divine Authority] of the Ahlul Bayt, for the earth’s obedience mirrors the believer’s duty to submit to the Imam’s guidance.\" Here, the \"command\" (*awha*) reflects the inseparable link between Divine Decree and the *Imamah*—the earth itself becomes a *wali* (ally) of truth, testifying to the eternal covenant of allegiance to the Chosen Ones.  \n\nLady Fatimah (peace be upon her) taught that every tremor is a reminder to awaken the heart: \"The shaking of the earth is a call to shake off negligence, to remember the Day when secrets are laid bare.\" Practically, this verse urges believers to align their actions with the *Ma’rifah* (recognition) of the Imams, ensuring their deeds resonate with the purity the earth will ultimately proclaim. To internalize this, one must daily reflect: *Does my life reflect the *amr* of Allah as perfectly as the earth does?* Strive to embody the earth’s humility—silent in service, yet thunderous in truth when commanded.",
    "layer1_urdu": "سورت اذزالہ میں ، آیت 5 ، اللہ تعالی ، میں کہا گیا ہے ، *\"کیونکہ آپ کے رب نے اس کا حکم دیا ہے\" (دو- انا رببکا آوا لاہا) *، جو فیصلے کے دن زمین کے پرتشدد کوڑے کا حوالہ دیتے ہیں۔ یہ آیت زمین کے لرزتے ہوئے ، اس کے بوجھ کو نکالنے ، اور انسانی اعمال کا گواہی دینے کے بارے میں تفصیل کے مطابق ہے۔ اصطلاح * آوا * (کمانڈ/حوصلہ افزائی) یہاں تخلیق پر اللہ کے مطلق اتھارٹی کی نشاندہی کرتی ہے ، جو شیعہ الہیات کا مرکزی خیال ہے۔ * واہی * (نبیوں کا انکشاف) کے برعکس ، * آوحہ * اس تناظر میں ایک عالمگیر حکم کی نشاندہی کرتا ہے ، اس بات پر زور دیتے ہوئے کہ تمام تخلیق اللہ کی مرضی کے سامنے پیش کرتی ہے ، جیسا کہ الامہ تبتابائی جیسے اسکالرز کے کلاسیکی طافسر میں زور دیا گیا ہے۔ زمین کی اطاعت انسانی آزاد مرضی سے متصادم ہے ، جو ہمارے انتخاب کو الہی رہنمائی کے ساتھ سیدھ میں لانے کی ہماری ذمہ داری پر عکاسی کرتی ہے۔\n\nتاریخی طور پر ، اس مکہ سرہ کا مقصد سننے والوں کو قیامت اور احتساب کی حقیقت سے بیدار کرنا تھا۔ جملہ * ربباکا * (\"آپ کا رب\") اس پیغام کو ذاتی نوعیت دیتا ہے ، اور مومنوں کو اللہ کے ساتھ ان کے گہرے تعلقات کی یاد دلاتا ہے۔ شیخ توسی جیسے اسکالرز نوٹ کرتے ہیں کہ انسانی اعمال کے بارے میں زمین کی \"گواہی\" (اس کے بعد کی آیات میں ذکر کی گئی ہے) اس بات کی علامت ہے کہ تخلیق کا ہر ایٹم الہی انصاف میں کس طرح حصہ لیتا ہے۔\n\nآج ، یہ آیت مسلمانوں کو کائناتی واقعات اور روزمرہ کی زندگی دونوں میں الہی طاقت کو تسلیم کرنے کا مطالبہ کرتی ہے۔ اس سے مومنین کو یقین دلایا جاتا ہے کہ قدرتی مظاہر - زلزلے سے لے کر ذاتی آزمائشوں تک allah اللہ کی دانشمندی کے تحت چل رہے ہیں ، اور غیر یقینی صورتحال کے درمیان بھی اعتماد (*تاواکول*) پر زور دیتے ہیں۔ عملی طور پر ، یہ ماحولیاتی ذمہ داری کو متاثر کرتا ہے ، کیونکہ ایک گواہ کی حیثیت سے زمین کا کردار (99: 4-5) تخلیق کو نقصان پہنچانے کے اخلاقی وزن کو اجاگر کرتا ہے۔ اندرونی طور پر یہ کہ سب * دو عمرو اللہ * (اللہ کے حکم کے مطابق) ہوتا ہے ، مسلمان عمل اور ارادے دونوں میں خدائی مقصد کے ساتھ عاجزی ، احتساب اور شعوری صف بندی کاشت کرسکتے ہیں۔",
    "layer2_urdu": "سورہ الزالزالا 99: 5 میں ، یہ جملہ \"کیوں کہ آپ کے رب نے اس کا حکم دیا ہے\" کلاسیکی شیعہ استثنیٰ کے اندر الہی کمانڈ (اے ایم آر) اور کائناتی ایجنسی کے مابین گہرا الہیات گٹھ جوڑ قائم کرتا ہے۔ مبصرین اس بات پر زور دیتے ہیں کہ آخری گھنٹہ کے دوران زمین کی تباہ کن ہلچل محض ایک قدرتی رجحان نہیں ہے بلکہ اللہ کی مرضی کے مطابق شعوری طور پر پیش کرنے کا ایک عمل ہے ، جو الہی اتھارٹی (ولیہ) کے عالمگیر جمع کرانے کے شیعہ اصول کی عکاسی کرتا ہے۔ جیسا کہ تبتابائی نے *المزان *میں نوٹ کیا ہے ، آیت اس بات کی نشاندہی کرتی ہے کہ تمام تخلیق الہی الہام (WAHY) کے ذریعہ اپنے وسیع معنوں میں چلتی ہے-پیشن گوئی کے انکشاف تک ہی محدود نہیں بلکہ کائنات کے نظم و ضبط پر گورننگ کے نظم و نسق کو شامل کرتی ہے۔ یہ امام جعفر السادق کی اس تعلیم سے ہم آہنگ ہے کہ \"زمین اپنے رب کی اجازت سے ، جس طرح آپ اس کی یاد سے کانپتے ہیں۔\"\n\nتبریسی کے * ماجما البیان * یوم قیامت کے موقع پر ایک گواہ (شاہد) کی حیثیت سے زمین کے کردار کو اجاگر کرتے ہیں ، اور اس کو شیعہ نظریے کے نظریہ سے جوڑتے ہیں-یہ عقیدہ کہ تخلیق الہی سچائی اور انسانی اعمال کی گواہی دیتی ہے۔ الہی کمانڈ کے ذریعہ چالو ہونے والی زمین کی گواہی ، الہی انصاف ('ADL) کے اصول کو ظاہر کرتی ہے ، کیونکہ اس سے ہر ایٹم کے اچھ and ے اور برائی (v.7-8) کے وزن کو ظاہر کیا جائے گا ، جس میں مطلق احتساب کی ضرورت ہے۔ یہ کائناتی گواہی شیعہ کے ساتھ انسانی اعمال پر ظاہر گواہ (شاہد) کے کردار پر شیعہ پر زور دینے کے ساتھ گونجتی ہے ، جس میں حدیثوں نے \"جس زمین کے ذریعے آپ کا تجربہ کیا ہے\" کے طور پر حدیث کو بیان کیا گیا ہے۔\n\nیہ آیت بامقدار تخلیق کے ایک فریم ورک کے اندر قادر (خدائی فرمان) کے بارے میں شیعہ تفہیم کو بھی تقویت دیتی ہے۔ جیسا کہ اے ایچ ایل البائٹ کی روایات میں بیان کیا گیا ہے ، اللہ کے امر کے لئے زمین کا سبق انسانیت کی وجودی ذمہ داری کو خدائی سرپرستی (والیت اللحیہ) کے سامنے پیش کرنے کی آئینہ دار ہے۔ اس طرح ، زلزلہ جسمانی اور استعاریاتی علامت دونوں بن جاتا ہے - حتمی سچائی (حق) کے قیام کی قدرتی ترتیب میں پھٹ جانا ، یہ تصور شیعہ اسکیٹولوجی کا مرکزی خیال ہے جس میں مہدی کی ظاہری شکل الہی کمانڈ کے ذریعہ کائناتی توازن کو بحال کرتی ہے۔ یہ تشریح ٹافسیر ، الہیات ، اور شیعہ فقہ اخلاقی احتساب پر اللہ کی لازم و ملزوم اقتدار (کوئڈرا) اور انصاف ('ADL) میں جڑے ہوئے شیعہ فقہ پر زور دیتا ہے (' ADL)",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ از زلزالا کی پانچویں آیت-\"کیونکہ آپ کے رب نے اس کا حکم دیا ہے\"-کو اکثر فطری اور اخلاقی نظم و ضبط دونوں پر الہی خودمختاری کی گہری یاد دہانی کے طور پر تیار کیا جاتا ہے۔ آیت اللہ ناصر مکارم شیرازی جیسے اسکالرز اس بات پر زور دیتے ہیں کہ اللہ کے حکم سے زمین کے اسکیوٹولوجیکل کانپتے ہوئے ، آج انسانیت کی اخلاقی ذمہ داری کو آئینہ دار کرنے کے لئے ایک کائناتی احتساب کی نشاندہی کرتا ہے۔ یہ آیت ، جبکہ اسکیٹولوجی میں جڑی ہوئی ہے ، ماحولیاتی اور معاشرتی انصاف کے لینسوں کے ذریعہ تیزی سے تشریح کی جارہی ہے۔ مثال کے طور پر ، شیخ محمد علی شمالی ، \"کمانڈ\" کو جدید ماحولیاتی بحرانوں سے جوڑتے ہیں ، اور یہ استدلال کرتے ہیں کہ فطرت کے انسانی استحصال سے توازن (میزان) اللہ نے تخلیق میں پیدا کیا ہے۔\n\nسائنسی طور پر ، آیت الہی قوانین (سنن اللہ) کے تحت کام کرنے والے ٹیکٹونک شفٹوں اور آب و ہوا کے نظام پر بات چیت کے ساتھ گونجتی ہے ، جس پر ڈاکٹر مہدی گولشانی جیسے اسکالرز خدا کی مستقل مرضی کے اظہار ہیں۔ فلسفیانہ طور پر ، یہاں \"کمانڈ\" اس بات کی تصدیق کرکے تخفیف پسند مادیت کو چیلنج کرتا ہے کہ قدرتی عمل ، اگرچہ تجرباتی طور پر قابل وضاحت قابل ہیں ، الہٰی طور پر الہامی طور پر انحصار کرتے ہیں۔ معاشرتی طور پر ، اس آیت کو آب و ہوا کی تبدیلی اور عدم مساوات جیسے بحرانوں سے نمٹنے کے لئے درخواست کی گئی ہے ، اور اخلاقی توحید کے ساتھ منسلک اجتماعی کارروائی پر زور دیا گیا ہے۔ قوم پر مبنی انسٹی ٹیوٹ برائے قرآنی ریسرچ نے ماحولیاتی نقصان میں کارپوریٹ/حکومتی شفافیت کا مطالبہ کرنے والی آیات اور جدید تحریکوں میں زمین کی \"گواہی\" کے مابین متوازی کو اجاگر کیا ہے۔\n\nبین المذاہب مکالمے ، خاص طور پر یہودی اور عیسائی ماحولیات کے ماہرین کے ساتھ ، اس آیت کے تخلیق کار کے تخلیق کار کے ردعمل کے موضوعات میں مشترکہ بنیاد تلاش کرتے ہیں۔ کثیر الثقافتی طور پر ، یہ مشترکہ سیاروں کی تقدیر کے قرآنی وژن کو تقویت دیتا ہے ، اور ماحولیاتی نظام کو ٹھیک کرنے کے لئے عقائد میں تعاون پر زور دیتا ہے۔ خلاصہ یہ ہے کہ یہ آیت اخلاقی ذمہ داری کی فوری ضرورت کے ساتھ الہی طاقت کے خوف کو ختم کرتی ہے۔",
    "layer4_urdu": "آیت \"کیونکہ آپ کے رب نے اس کا حکم دیا ہے\" (99: 5) ایک گہری حقیقت کی نقاب کشائی کرتا ہے: تمام تخلیق * امر * (الہی کمانڈ) کے چینل کے ذریعہ الہی مرضی کے سامنے پیش کرتی ہے۔ اہل بیت (ان پر امن) نے سکھایا کہ یہ آیت جسمانی زلزلے سے ماورا ہے۔ یہ یوم قیامت کے دن انسانیت کے اعمال کی گواہی دینے کے لئے زمین کی روحانی بیداری کی نشاندہی کرتا ہے۔ امام علی (اس پر سلامتی ہے) *ناہج البالاگھا *میں بیان کرتے ہیں: \"زمین اپنے رب کی اجازت سے بات کرے گی ، اور یہ ان کی کمائی کے بارے میں ہر روح کے لئے یا اس کے خلاف گواہی دے گی۔\" اس کائناتی گواہی کی جڑ *توحد *کے اصول میں ہے ، جہاں تخلیق کا مقصد اللہ کے انصاف اور حکمت کو ظاہر کرنے کے لئے بندھا ہوا ہے۔  \n\nامام جعفر السادق (اس پر امن ہے) نے وضاحت کی ہے: \"جب زمین کی کھدائی ہوتی ہے تو ، یہ محض تحریک نہیں ، اللہ کی طرف سے ایک*وحی*(*واہ*) ہوتا ہے۔ یہ احل بیت کے*ولیہ*[خدائی اتھارٹی] کے بارے میں بات کرتا ہے ، کیونکہ زمین کی اطاعت نے مومن کے فرض کو آئی ایم اے ایم کے رہنمائی میں پیش کرنے کا فرض بنایا ہے۔\" یہاں ، \"کمانڈ\" (*آوا*) خدائی فرمان اور*امامہ*کے مابین لازم و ملزوم روابط کی عکاسی کرتا ہے - زمین خود حق کا ایک*ولی*(اتحادی) بن جاتی ہے ، جو منتخب کردہ افراد سے وفاداری کے دائمی عہد کی گواہی دیتی ہے۔  \n\nلیڈی فاطمہ (اس پر امن) نے یہ سکھایا کہ ہر زلزلے سے دل کو بیدار کرنے کی یاد دہانی ہوتی ہے: \"زمین کا لرز اٹھنے سے غفلت ختم کرنے ، اس دن کو یاد کرنے کا مطالبہ ہے جب راز پوشیدہ ہیں۔\" عملی طور پر ، یہ آیت مومنوں سے التجا کرتی ہے کہ وہ اپنے اعمال کو اماموں کے * مآرفہ * (پہچان) کے ساتھ سیدھ میں لائیں ، اور اس بات کو یقینی بناتے ہوئے کہ ان کے اعمال زمین کی پاکیزگی کے ساتھ گونج اٹھیں۔ اس کو اندرونی بنانے کے ل one ، کسی کو روزانہ عکاسی کرنا چاہئے: * کیا میری زندگی اللہ کے * عمرو * کی عکاسی کرتی ہے جتنی زمین کی طرح ہے؟",
    "layer5": "In interpreting Surah al-Zalzala 5 (\"Because your Lord has commanded it\"), both Shia and Sunni scholars converge on the foundational principle of divine omnipotence. Al-Tabari (Sunni) and al-Tabrisi (Shia) agree the verse affirms Allah’s absolute authority over creation, with the earth’s cataclysmic movements during Judgment Day occurring solely by His will. Ibn Kathir and al-Tusi similarly emphasize this as a reminder of cosmic submission to divine command, resonating with Quranic themes of Allah’s unchallenged sovereignty (e.g., 36:82).\n\nDivergences emerge in theological implications. Sunni exegetes like al-Qurtubi and al-Razi focus on Allah’s direct agency, interpreting the \"command\" (awha) as a unique act unrelated to intermediary causes. Al-Razi’s *Mafatih al-Ghayb* frames this as reinforcing *tawhid al-rububiyya* (oneness of lordship), distancing from any perceived delegation of divine power. In contrast, Shia commentaries such as al-Qummi’s tafsir and Tabatabai’s *Al-Mizan* incorporate narrations from the Ahl al-Bayt, suggesting the earth’s testimony about human deeds (v. 2-4) is intrinsically linked to the divine command, with some traditions symbolically tying this to the eschatological role of the Imams. Al-Tibyan by al-Tusi notes the earth’s \"inspiration\" (awha) reflects a teleological wisdom manifest through divinely appointed guides.\n\nThese differences stem from distinct epistemological frameworks: Sunni exegesis prioritizes textual literalism and prophetic tradition, while Shia interpretations integrate Imamite theology. Practically, this shapes eschatological expectations—Sunni thought emphasizes individual accountability, whereas Shia views may connect cosmic events to the Imam Mahdi’s reappearance. Historically, these trajectories reflect early theological developments post-Prophet Muhammad, with Shia thought crystallizing around the Ahl al-Bayt’s hermeneutical authority and Sunni scholarship consolidating around companion-based transmission. Both traditions, however, uphold the verse’s core message: creation’s submission to divine will heralds ultimate justice.",
    "layer5_urdu": "سورہ الضالزالا 5 کی ترجمانی کرتے ہوئے (\"کیونکہ آپ کے رب نے اس کا حکم دیا ہے\") ، شیعہ اور سنی اسکالرز دونوں ہی الہی اومنیپوٹینس کے بنیادی اصول پر اکٹھے ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) اس بات پر متفق ہیں کہ اس آیت کی تخلیق پر اللہ کے مطلق اختیار کی تصدیق ہوتی ہے ، اس کے ساتھ ہی اس کی مرضی کے مطابق فیصلے کے دن زمین کی تباہ کن حرکتیں ہوتی ہیں۔ ابن کتھیر اور التوسی نے اسی طرح الہی کمانڈ کے لئے کائناتی جمع کرانے کی یاد دہانی کے طور پر اس بات پر زور دیا ہے ، اللہ کی غیر منقولہ خودمختاری (جیسے ، 36:82) کے قرآنی موضوعات سے گونجتے ہوئے۔\n\nمذہبی مضمرات میں تغیرات ابھرتے ہیں۔ سنی کی نمائندگی جیسے القوروبی اور الراجی نے اللہ کی براہ راست ایجنسی پر توجہ مرکوز کی ، اور \"کمانڈ\" (اے ڈبلیو ایچ اے) کی ترجمانی ایک انوکھی کارروائی کے طور پر کی ہے جو بیچوان کی وجوہات سے وابستہ نہیں ہے۔ العرزی کا * مافاتیہ الغیب * اس کو تقویت دینے کے طور پر فریم کرتا ہے۔ اس کے برعکس ، شیعہ کی تفسیر جیسے القومی کے طافسیر اور تبتابائی کے * المزان * اے ایچ ایل ال بیت سے بیانات کو شامل کرتے ہیں ، جو انسانی اعمال (بمقابلہ 2-4) کے بارے میں زمین کی گواہی کو تجویز کرتے ہیں ، اس کے ساتھ ہی کچھ روایات کو علامت کے ساتھ آئی ایم ایس کے شعور سے باندھ دیا جاتا ہے۔ التبیان از ال توسی نے زمین کی \"پریرتا\" (اے ڈبلیو ایچ اے) نوٹ کیا ہے کہ ایک ٹیلیولوجی حکمت کی عکاسی کرتی ہے جو الہی مقرر کردہ رہنماؤں کے ذریعہ ظاہر ہوتی ہے۔\n\nیہ اختلافات الگ الگ علمی فریم ورک سے پیدا ہوتے ہیں: سنی کی اصلاح متنی خواندہ اور پیشن گوئی کی روایت کو ترجیح دیتی ہے ، جبکہ شیعہ تشریحات امامائٹ الہیات کو مربوط کرتی ہیں۔ عملی طور پر ، اس سے ایسکیٹولوجیکل توقعات کو شکل دی جاتی ہے۔ تاریخی طور پر ، یہ چالیں ابتدائی مذہبی پیشرفت کے بعد کے پروفیوٹ محمد کی عکاسی کرتی ہیں ، جس کے بارے میں شیعہ نے سوچا کہ اے ایچ ایل البائٹ کی ہرمینیٹیکل اتھارٹی اور سنی اسکالرشپ کو ساتھی پر مبنی ٹرانسمیشن کے ارد گرد مستحکم کیا گیا ہے۔ تاہم ، دونوں روایات آیت کے بنیادی پیغام کو برقرار رکھتی ہیں: تخلیق کی الہی کے لئے جمع کرانے سے حتمی انصاف ہوگا۔",
    "summary": "Tafsir al-Mizan offers profound insights, with Tabatabai noting that this verse underscores that all creation operates through divine inspiration (wahy) in its broadest sense – not limited to prophetic revelation but encompassing the innate guidance (hidaya takwiniyya) governing cosmic order. In Surah Az-Zalzala, verse 5, Allah states, *\"Because your Lord has commanded it\" (bi-anna rabbaka awha laha)*, referring to the earth’s violent quaking on the Day of Judgment. This verse follows descriptions of the earth shaking, ejecting its burdens, and bearing witness to human deeds—events that occur solely by divine will. The term *awha* (commanded/inspired) here signifies Allah’s absolute authority over creation, a theme central to Shia theology. Imam Ali (peace be upon him) states in *Nahj al-Balagha*: \"The earth will speak with the permission of its Lord, and it will testify for or against every soul regarding what they earned. This verse calls Muslims to recognize divine power in both cosmic events and daily life."
  },
  "6": {
    "layer1": "In Surah Az-Zalzala verse 6, Allah describes the Day of Judgment as a time when humanity will emerge from their graves \"ashtatan\" – scattered into distinct groups – to witness the consequences of their deeds. The term *yawma'idhin* (\"That Day\") underscores the inevitability and awe of divine reckoning, while *yasduru* (\"depart\") conveys movement toward a decisive destination. The word *ashtatan* (derived from *shatt*, meaning \"to split\") signifies a profound separation of people based on their spiritual states, reflecting the Quranic principle that ultimate justice categorizes individuals by their actions and intentions. Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains that this division isn’t arbitrary but rooted in the moral weight of each soul’s choices, aligning with the teachings of the Ahlul Bayt that every deed, however small, is eternally recorded (as echoed in verse 7-8).\n\nHistorically, this Meccan surah addressed early Muslims facing persecution, reinforcing the certainty of resurrection and accountability – a core belief challenged by pre-Islamic Arab skeptics. The verse’s imagery of dispersal and exposure of deeds (*liyuraw a'malahum*) served as both a warning and a comfort: oppressors would face justice, while the steadfast would be vindicated. For contemporary Muslims, this verse invites self-reflection on how daily actions – from kindness to dishonesty – shape eternal outcomes. It dismantles illusions of anonymity in a digital age, reminding believers that true \"visibility\" lies in divine scrutiny, not social media. Practically, it encourages aligning choices with Quranic ethics and the guidance of the Imams, who taught that preparation for *yawma'idhin* begins with self-accountability (*muhasaba*) here and now. By viewing life as a continuum leading to that ultimate \"departure,\" Muslims can cultivate consciousness (*taqwa*) in both private and public conduct, ensuring their \"group\" on that Day reflects devotion to truth and justice.",
    "layer2": "In Surah al-Zalzala 99:6, the Qur’an describes the Day of Resurrection as a moment when humanity emerges from the grave in distinct groups (ashtatan) to witness the consequences of their deeds. Classical Shia exegetes, such as Allama Tabatabai in *Al-Mizan*, emphasize that this “separation” is not merely physical but reflects the ontological reality of human souls divided by their spiritual states. Drawing from the teachings of the Ahl al-Bayt, he explains that deeds are not abstract acts but intrinsic qualities imprinted on the soul, which manifest visibly on Judgment Day. Thus, the “showing” of deeds (liyuraw a’malahum) is not a passive display but a divine unveiling of the soul’s true nature, as articulated in the famous hadith: “Deeds are presented [to God] in their forms” (*Al-Kafi*, Vol. 2).  \n\nTabrisi, in *Majma al-Bayan*, highlights the ethical dimension of this separation, noting that groups will be categorized by their belief (iman), hypocrisy (nifaq), or disbelief (kufr), with the righteous destined for the intercession (shafa’a) of the Prophet and his family. This aligns with the Shia theological principle that divine justice (‘adl) necessitates individualized accountability, where no soul bears another’s burden (Qur’an 53:38–39). The verse also underscores the inseparable link between doctrine and jurisprudence in Shia thought: deeds are judged not only by outward compliance but by their alignment with the wilayah (guardianship) of the Imams, who serve as the spiritual and ethical guides of the ummah.  \n\nThe “showing” of deeds further invokes the Shia concept of witnessing (shahada), wherein the Imams themselves bear witness to the actions of their followers, as stated in traditions where Imam Jafar al-Sadiq declares, “We are the witnesses over creation” (*Bihar al-Anwar*, Vol. 7). Thus, the verse encapsulates the Shia worldview of resurrection as both a divine reckoning and a cosmic affirmation of the Ahl al-Bayt’s eternal role in guiding humanity toward salvation.",
    "layer3": "In contemporary Shia scholarship, Surah Zalzala’s sixth verse is often framed as a profound meditation on accountability, both individual and collective. Ayatollah Nasir Makarem Shirazi, in his *Tafsir Nemuneh*, emphasizes that the “separation” (*ashtatan*) of humanity reflects the ultimate unveiling of moral choices—a day when societal hierarchies collapse, and each soul stands exposed by its deeds. Modern scholars like Dr. Mohammad Ali Shomali connect this to today’s hyperconnected yet fragmented world, where social media algorithms and political polarization increasingly divide people into ideological “categories,” mirroring the Qur’anic imagery of scattered groups. This duality—between unity in creation and fragmentation in action—resonates with philosophical debates about identity and ethics in a globalized age.  \n\nScientifically, the verse’s focus on deeds being “shown” aligns with emerging discussions in neuroscience and quantum physics. Scholars such as Sayyid Kamal al-Haydari reference quantum entanglement to metaphorically illustrate how actions ripple through existence, leaving indelible traces—a concept paralleling the Islamic notion of *mizan* (divine balance). Socially, the verse critiques systemic injustices: climate activists like Dr. Seyyed Mostafa Mohaghegh Ahmadabadi link environmental destruction to the verse’s warning, arguing that ecological harm is a “deed” humanity will reckon with collectively.  \n\nInterfaith dialogues highlight shared eschatological themes: the Buddhist concept of karma and Christian teachings on final judgment echo this Qur’anic vision. In multicultural societies, the verse invites reflection on how moral accountability transcends borders—urging cooperation on crises like refugee displacement or AI ethics. Ultimately, the verse challenges modern readers to see their choices as cosmic threads woven into a tapestry of divine justice, demanding both personal integrity and collective responsibility.",
    "layer4": "On the Day of Rising described in Surah Zalzala, humanity will emerge as scattered groups, their eternal fate determined by the spiritual weight of their deeds. The Ahlul Bayt (as) teach that this \"separation\" is not merely physical but a manifestation of inner realities shaped by one’s allegiance to divine truth. Imam Ali (as) states, *\"People are of two types: the friend of God and the friend of Satan; the follower of truth and the follower of falsehood\"* (Nahj al-Balagha, Sermon 62). This division reflects the foundational Shia principle of *Wilayah* – the recognition and loyalty to the divinely appointed Imams, which becomes the criterion for evaluating deeds.\n\nImam Jafar al-Sadiq (as) explains this verse’s deeper dimension: *\"On that Day, none shall stand except upon the light of their recognition (ma'rifah) of us. Their deeds will be presented according to how they upheld our guardianship\"* (Tafsir al-Qummi). Here, the \"showing of deeds\" transcends superficial actions; it unveils whether one’s worship, ethics, and struggles were rooted in the luminous guidance of the Ahlul Bayt (as). Lady Fatimah (as) warned in her historic sermon: *\"Deeds are but branches planted upon the soil of submission to divine authority (Imamah).\"*\n\nPractically, this verse calls believers to daily self-accountability: Do my prayers strengthen my connection to the Imams? Do my transactions reflect justice taught by Ali (as)? Do my choices align with the path of Hussain (as)? The \"scattered groups\" emerge from cumulative spiritual choices – each moment of upholding truth coalescing into eternal proximity to the Ahlul Bayt (as), each compromise distancing the soul into darkness. As Imam Zayn al-Abidin (as) guides in Sahifa Sajjadiyya: *\"Make my faith a lamp to my heart, my tongue its wick, and my organs its oil, ignited by the fire of longing for Your pleasure.\"* Thus, the Day of Separation begins today – in every act of conscious love for the Chosen Ones.",
    "layer1_urdu": "سور Surah ایز زلزالا آیت 6 میں ، اللہ نے فیصلے کے دن کو ایک ایسے وقت کے طور پر بیان کیا ہے جب انسانیت ان کی قبروں سے \"اشاتان\"-الگ الگ گروہوں میں بکھرے گی-تاکہ ان کے اعمال کے نتائج کا مشاہدہ کریں۔ اصطلاح * Yawma'idhin * (\"اس دن\") الہی حساب کتاب کی ناگزیر اور خوف کی نشاندہی کرتی ہے ، جبکہ * یاسڈورو * (\"روانگی\") ایک فیصلہ کن منزل کی طرف تحریک پیش کرتی ہے۔ لفظ *اشاتان *( *شیٹ *سے ماخوذ ہے ، جس کا مطلب ہے \"تقسیم کرنا\") ان کی روحانی ریاستوں پر مبنی لوگوں کی گہری علیحدگی کی نشاندہی کرتا ہے ، جو قرآنی اصول کی عکاسی کرتا ہے جو حتمی انصاف افراد کو ان کے اعمال اور ارادوں کی درجہ بندی کرتا ہے۔ شیعہ طافسر ، جیسے الامہ تبتابائی کے *المزان *، نے وضاحت کی ہے کہ یہ تقسیم صوابدیدی نہیں ہے بلکہ ہر روح کے انتخاب کے اخلاقی وزن میں جکڑی ہوئی ہے ، اور اہل بیت کی تعلیمات کے مطابق ہے کہ ہر عمل ، اگرچہ چھوٹا ہے ، ہمیشہ کے لئے ریکارڈ کیا جاتا ہے (جیسا کہ آیت 7-8 میں گونج ہوا ہے)۔\n\nتاریخی طور پر ، اس مکہ سرہ نے ابتدائی مسلمانوں کو ظلم و ستم کا سامنا کرنا پڑا ، جس نے قیامت اور احتساب کی یقین کو تقویت بخشی-ایک بنیادی عقیدہ جو اسلام سے قبل کے عرب شکیوں کے ذریعہ چیلنج کیا گیا ہے۔ آیت کی منتقلی اور اعمال کی نمائش کی منظر کشی (*لیئوراوا امالہوم*) نے ایک انتباہ اور راحت دونوں کے طور پر کام کیا: جابروں کو انصاف کا سامنا کرنا پڑے گا ، جبکہ ثابت قدمی کو ثابت کیا جائے گا۔ عصری مسلمانوں کے ل this ، یہ آیت خود عکاسی کی دعوت دیتی ہے کہ کس طرح روزانہ کے اعمال-شفقت سے لے کر بے ایمانی تک-ابدی نتائج کی تشکیل کرتے ہیں۔ یہ ڈیجیٹل دور میں گمنامی کے وہموں کو ختم کرتا ہے ، اور مومنوں کو یاد دلاتا ہے کہ سوشل میڈیا نہیں بلکہ سچ \"مرئیت\" الہی جانچ پڑتال میں ہے۔ عملی طور پر ، یہ قرآنی اخلاقیات اور اماموں کی رہنمائی کے ساتھ انتخاب کی صف بندی کی حوصلہ افزائی کرتا ہے ، جنہوں نے*Yawma'idhin*کے لئے اس تیاری کو سکھایا وہ یہاں اور اب خود حساب کتاب (*محسابا*) سے شروع ہوتا ہے۔ زندگی کو ایک تسلسل کے طور پر دیکھ کر جو اس حتمی \"روانگی\" کی طرف جاتا ہے ، مسلمان نجی اور عوامی طرز عمل میں شعور (*تقوا*) کاشت کرسکتے ہیں ، اور اس دن اپنے \"گروپ\" کو یقینی بناتے ہوئے سچائی اور انصاف کی عقیدت کی عکاسی کرتے ہیں۔",
    "layer2_urdu": "سورہ الضالزالا 99: 6 میں ، قرآن مجید نے قیامت کے دن کو ایک ایسے لمحے کے طور پر بیان کیا ہے جب انسانیت ان کے اعمال کے نتائج کا مشاہدہ کرنے کے لئے الگ الگ گروہوں (اشاتان) میں قبر سے ابھرتی ہے۔ کلاسیکی شیعہ استثنیٰ ، جیسے *المزان *میں علامہ تبتابائی ، اس بات پر زور دیتے ہیں کہ یہ \"علیحدگی\" محض جسمانی نہیں ہے بلکہ ان کی روحانی ریاستوں کے ذریعہ تقسیم کردہ انسانی روحوں کی نظریاتی حقیقت کی عکاسی کرتی ہے۔ اے ایچ ایل ال بیت کی تعلیمات سے دیکھتے ہوئے ، وہ وضاحت کرتے ہیں کہ اعمال خلاصہ کام نہیں ہیں بلکہ روح پر نقوش کی داخلی خصوصیات ہیں ، جو فیصلے کے دن واضح طور پر ظاہر ہوتی ہیں۔ اس طرح ، اعمال کا \"نمائش\" (لیورو a’malahum) ایک غیر فعال ڈسپلے نہیں ہے بلکہ روح کی اصل فطرت کی ایک الہی کی نقاب کشائی ہے ، جیسا کہ مشہور حدیث میں بیان کیا گیا ہے: \"اعمال [خدا کے سامنے] ان کی شکلوں میں پیش کیے جاتے ہیں\" (*الکفی*، جلد 2)۔  \n\nتبریسی ، *مجس البیان *میں ، اس علیحدگی کی اخلاقی جہت کو اجاگر کرتے ہیں ، یہ کہتے ہوئے کہ گروہوں کو ان کے عقیدے (ایمان) ، منافقت (نیفق) ، یا کفر (کوفر) کے ذریعہ درجہ بندی کیا جائے گا ، جس میں شفاعت اور اس کے کنبہ کے شفاعت (شافا) کے لئے مقدر ہیں۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ الہی انصاف (‘ADL) انفرادی طور پر احتساب کی ضرورت ہے ، جہاں کوئی روح کسی دوسرے کا بوجھ برداشت نہیں کرتی ہے (قرآن 53: 38–39)۔ اس آیت میں شیعہ میں نظریہ اور فقہ کے مابین لازم و ملزوم روابط کی بھی نشاندہی کی گئی ہے: اعمال نہ صرف ظاہری تعمیل کے ذریعہ بلکہ اماموں کے ولیہ (سرپرستی) کے ساتھ ان کی صف بندی کے ذریعہ بھی ان کا اندازہ لگایا جاتا ہے ، جو امت کے روحانی اور اخلاقی رہنمائی کے طور پر کام کرتے ہیں۔  \n\nاعمال کی \"نمائش\" میں گواہ (شاہڈا) کے شیعہ تصور کو مزید تقویت ملی ہے ، جس میں خود ہی امام اپنے پیروکاروں کے اقدامات کا مشاہدہ کرتے ہیں ، جیسا کہ روایات میں کہا گیا ہے جہاں امام جعفر السادق نے اعلان کیا ہے ، \"ہم تخلیق کے بارے میں گواہ ہیں\" (*بہار الانور*، جلد 7)۔ اس طرح ، آیت قیامت کے شیعہ عالمی نظریہ کو الہی حساب کتاب اور نجات کی طرف انسانیت کی رہنمائی کرنے میں اے ایچ ایل البائٹ کے ابدی کردار کی ایک کائناتی تصدیق کے طور پر شامل کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ زلزالا کی چھٹی آیت اکثر انفرادی اور اجتماعی دونوں ہی احتساب پر گہری مراقبہ کے طور پر تیار کی جاتی ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے*طافسیر نمونیہ*میں ، اس بات پر زور دیا ہے کہ انسانیت کی \"علیحدگی\" (*اشاتان*) اخلاقی انتخاب کی حتمی نقاب کشائی کی عکاسی کرتی ہے۔ یہ ایک دن جب معاشرتی درجہ بندی ٹوٹ جاتا ہے ، اور ہر روح اس کے اعمال سے بے نقاب ہوتی ہے۔ ڈاکٹر محمد علی شومالی جیسے جدید اسکالرز اس کو آج کی ہائپر کنیکٹیڈ ابھی تک بکھرے ہوئے دنیا سے مربوط کرتے ہیں ، جہاں سوشل میڈیا الگورتھم اور سیاسی پولرائزیشن تیزی سے لوگوں کو نظریاتی \"زمرے\" میں تقسیم کرتی ہے ، جو بکھرے ہوئے گروہوں کی قرآنی امیجری کو آئینہ دار کرتی ہے۔ یہ دوہری - تخلیق اور عمل میں ٹکڑے ٹکڑے کرنے میں اتحاد کے درمیان - عالمگیر عمر میں شناخت اور اخلاقیات کے بارے میں فلسفیانہ مباحثے کا شکار ہے۔  \n\nسائنسی لحاظ سے ، آیت کی توجہ \"دکھائے جانے\" پر \"دکھائی گئی\" پر مرکوز ہے جو نیورو سائنس اور کوانٹم فزکس میں ابھرتی ہوئی گفتگو کے ساتھ منسلک ہے۔ سیدٹ کمال الحیداری حوالہ کوانٹم جیسے اسکالرز استعاراتی طور پر الجھاتے ہیں کہ کس طرح عمل سے وجود کے ذریعے عمل ہوتا ہے ، جس سے انمٹ نشانات رہتے ہیں۔ یہ ایک تصور * میزان * (الہی توازن) کے اسلامی تصور کے متوازی ہے۔ معاشرتی طور پر ، آیت سیسٹیمیٹک ناانصافیوں پر تنقید کرتی ہے: ڈاکٹر سیئڈ مصطفی موہگھیگ احمد آبادی جیسے آب و ہوا کے کارکن ماحولیاتی تباہی کو آیت کی انتباہ سے جوڑتے ہیں ، اور یہ استدلال کرتے ہیں کہ ماحولیاتی نقصان ایک \"عمل\" ہے انسانیت اجتماعی طور پر اس کا حساب کتاب کرے گی۔  \n\nبین المذاہب مکالموں نے مشترکہ ایسکیٹولوجیکل تھیمز کو اجاگر کیا: حتمی فیصلے پر کرما اور عیسائی تعلیمات کا بدھ مت کے تصور نے اس قرآنی وژن کی بازگشت کی۔ کثیر الثقافتی معاشروں میں ، آیت اس بات کی عکاسی کی دعوت دیتی ہے کہ اخلاقی احتساب سرحدوں کو کس طرح آگے بڑھاتا ہے۔ بالآخر ، آیت جدید قارئین کو چیلنج کرتی ہے کہ وہ اپنے انتخاب کو کائناتی دھاگوں کے طور پر دیکھیں جو الہی انصاف کی ٹیپسٹری میں بنے ہوئے ہیں ، اور ذاتی سالمیت اور اجتماعی ذمہ داری دونوں کا مطالبہ کرتے ہیں۔",
    "layer4_urdu": "سورہ زلزالا میں بیان کردہ عروج کے دن ، انسانیت بکھرے ہوئے گروہوں کی حیثیت سے ابھرے گی ، ان کی ابدی تقدیر ان کے اعمال کے روحانی وزن سے طے شدہ ہے۔ اہل بیت (ع) سکھاتے ہیں کہ یہ \"علیحدگی\" محض جسمانی نہیں بلکہ اندرونی حقائق کا مظہر ہے جس کی تشکیل الہی سچائی سے کسی کی وفاداری ہے۔ امام علی (ع) میں کہا گیا ہے ، * \"لوگ دو اقسام کے ہیں: خدا کا دوست اور شیطان کا دوست ؛ سچائی کا پیروکار اور باطل کا پیروکار\" * (ناہج البالاگھا ، خطبہ 62)۔ یہ تقسیم * ولیہ * کے بنیادی شیعہ اصول کی عکاسی کرتی ہے۔\n\nامام جعفر السادق (ع) اس آیت کی گہری جہت کی وضاحت کرتا ہے: * \"اس دن ، کوئی بھی نہیں کھڑا ہوگا سوائے اس کے کہ ہم ان کی پہچان (مآرفہ) کی روشنی پر۔ یہاں ، \"اعمال کا مظاہرہ\" سطحی اقدامات سے ماورا ہے۔ اس کی نقاب کشائی کی گئی ہے کہ آیا کسی کی عبادت ، اخلاقیات اور جدوجہد کی جڑیں اہل بیت (ع) کی برائٹ رہنمائی میں تھیں۔ لیڈی فاطمہ (ع) نے اپنے تاریخی خطبہ میں متنبہ کیا: *\"اعمال ہیں لیکن الہی اتھارٹی (امامہ) کو جمع کرانے کی سرزمین پر لگائی گئی شاخیں۔\" *\n\nعملی طور پر ، یہ آیت مومنوں کو روزانہ کی خود حساب کتاب کی طرف راغب کرتی ہے: کیا میری دعائیں اماموں سے میرا تعلق مضبوط کرتی ہیں؟ کیا میرے لین دین علی (ع) کے ذریعہ سکھائے جانے والے انصاف کی عکاسی کرتے ہیں؟ کیا میرے انتخاب حسین (ع) کے راستے سے ہم آہنگ ہیں؟ \"بکھرے ہوئے گروہ\" مجموعی روحانی انتخاب سے ابھرتے ہیں - حقیقت کو برقرار رکھنے کے ہر لمحے احلول بیت (ع) کے لئے ابدی قربت میں ہم آہنگی کرتے ہیں ، ہر ایک سمجھوتہ روح کو اندھیرے میں دور کرتا ہے۔ جیسا کہ امام زین العبدین (ع) ساہفا سججدیہ میں رہنمائی کرتے ہیں: * \"میرے عقیدے کو میرے دل کے لئے ایک چراغ بنائیں ، میری زبان اس کی آواز ، اور میرے اعضاء کو اس کا تیل ، جو آپ کی خوشنودی کی آرزو کی آگ سے بھڑک رہا ہے۔\"",
    "layer5": "In interpreting Surah al-Zalzala 6, both Shia and Sunni exegetes converge on core eschatological themes. All agree the verse depicts humanity’s division on Judgment Day to witness their deeds’ consequences, affirming divine justice and individual accountability. Al-Tabari (Sunni) and Al-Tusi (Shia) both emphasize the literal “separation” (ashtatan) into groups based on spiritual states, with Al-Qurtubi adding this reflects moral distinctions recorded in heavenly registers—a notion paralleled in Al-Tabrisi’s (Shia) description of distinct ranks determined by deeds. Ibn Kathir and Al-Qummi similarly stress the unveiling of deeds as central to divine recompense, underscoring shared beliefs in resurrection and ethical responsibility.\n\nDivergences emerge in theological nuances. Sunni commentators like Al-Razi frame the “showing” of deeds as a manifestation of God’s absolute power to judge, aligning with Ash‘ari emphasis on divine omnipotence over human agency. In contrast, Shia sources like Al-Mizan (Tabatabai) interpret this disclosure through the lens of intrinsic justice, arguing deeds naturally yield consequences under God’s equitable system, reflecting Mu‘tazili-influenced theology. Al-Tabrisi further links the separation to allegiance to the Ahl al-Bayt, suggesting spiritual rank depends on recognizing divine guides—a perspective absent in Sunni tafsirs, which avoid explicit connections to leadership disputes.\n\nThese differences stem from distinct theological frameworks: Sunni exegesis often prioritizes God’s transcendent will, while Shia interpretations integrate Imamate theology into cosmic justice. Practically, Shia readings may emphasize adherence to Imamah as integral to righteous deeds, whereas Sunni focus remains on individual accountability. Historically, such variations arose from early debates over authority and scriptural hermeneutics, with Shia scholars incorporating hadiths from the Imams into their exegetical tradition. Both traditions, however, uphold the verse’s core ethical imperative: deeds indelibly shape eternal destiny.",
    "layer5_urdu": "سورہ الزالزالا 6 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں ہی بنیادی اسکیٹولوجیکل موضوعات پر تبادلہ خیال کرتے ہیں۔ سب متفق ہیں اس آیت میں ان کے اعمال کے نتائج کا مشاہدہ کرنے کے لئے یوم قیامت کے موقع پر انسانیت کی تقسیم کو دکھایا گیا ہے ، جس میں الہی انصاف اور انفرادی احتساب کی تصدیق کی گئی ہے۔ التباری (سنی) اور التوسی (شیعہ) دونوں روحانی ریاستوں پر مبنی گروہوں میں لفظی \"علیحدگی\" (اشاتان) پر زور دیتے ہیں ، الکوروبی نے مزید کہا کہ اس سے آسمانی رجسٹروں میں درج اخلاقی امتیازات کی عکاسی ہوتی ہے۔ ابن کتھیر اور القومی اسی طرح پر زور دیتے ہیں کہ وہ الہی بدلہ لینے کے لئے اعمال کی نقاب کشائی کرتے ہیں ، اور قیامت اور اخلاقی ذمہ داری میں مشترکہ عقائد کی نشاندہی کرتے ہیں۔\n\nمذہبی باریکیوں میں تغیرات ابھرتے ہیں۔ سنی مبصرین جیسے العزار نے خدا کی مطلق طاقت کے مظہر کے طور پر کاموں کی \"نمائش\" کو فریم کیا ہے ، جو انسانی ایجنسی پر خدائی قیدی پر اشاری پر زور دیتے ہیں۔ اس کے برعکس ، شیعہ کے ذرائع المزان (تبتابائی) جیسے اندرونی انصاف کے عینک کے ذریعہ اس انکشاف کی ترجمانی کرتے ہیں ، اور یہ بحث کرنے والے اعمال قدرتی طور پر خدا کے مساوی نظام کے تحت نتائج برآمد کرتے ہیں ، جس سے موٹازیلی سے متاثرہ الہیات کی عکاسی ہوتی ہے۔ الاتبریسی مزید علیحدگی کو اے ایچ ایل البائٹ سے بیعت سے جوڑتا ہے ، جس کی تجویز پیش کرتے ہیں کہ روحانی عہدے کا انحصار الہی رہنماؤں کو تسلیم کرنے پر ہے۔\n\nیہ اختلافات الگ الگ تھیلوجیکل فریم ورک سے پیدا ہوتے ہیں: سنی کی نمائندگی اکثر خدا کی ماورائی مرضی کو ترجیح دیتی ہے ، جبکہ شیعہ تشریحات امامیٹ الہیات کو کائناتی انصاف میں ضم کرتی ہیں۔ عملی طور پر ، شیعہ ریڈنگس امامہ پر عمل پیرا ہونے پر زور دے سکتی ہے کیونکہ وہ نیک اعمال کے ساتھ لازمی ہے ، جبکہ سنی کی توجہ انفرادی احتساب پر ہے۔ تاریخی طور پر ، اس طرح کی مختلف حالتیں اتھارٹی اور صحیفاتی ہرمینیٹکس کے بارے میں ابتدائی مباحثوں سے پیدا ہوئی ہیں ، شیعہ اسکالرز نے اماموں سے حدیث کو اپنی واضح روایت میں شامل کیا ہے۔ تاہم ، دونوں روایات آیت کی بنیادی اخلاقی لازمی کو برقرار رکھتی ہیں: اعمال غیر یقینی طور پر دائمی تقدیر کی تشکیل کرتے ہیں۔",
    "summary": "As articulated in Tafsir al-Mizan, this “separation” is not merely physical but reflects the ontological reality of human souls divided by their spiritual states. In Surah Az-Zalzala verse 6, Allah describes the Day of Judgment as a time when humanity will emerge from their graves \"ashtatan\" – scattered into distinct groups – to witness the consequences of their deeds. The term *yawma'idhin* (\"That Day\") underscores the inevitability and awe of divine reckoning, while *yasduru* (\"depart\") conveys movement toward a decisive destination. The word *ashtatan* (derived from *shatt*, meaning \"to split\") signifies a profound separation of people based on their spiritual states, reflecting the Quranic principle that ultimate justice categorizes individuals by their actions and intentions. Imam Ali (as) states, *\"People are of two types: the friend of God and the friend of Satan; the follower of truth and the follower of falsehood\"* (Nahj al-Balagha, Sermon 62). This verse invites self-reflection on how daily actions – from kindness to dishonesty – shape eternal outcomes."
  },
  "7": {
    "layer1": "Surah al-Zalzala, revealed in Medina, powerfully describes the Day of Judgment when the earth will violently shake, revealing humanity’s deeds. Verse 7 declares, *\"So whoever does an atom’s weight of good will see it\"* (fa-man ya‘mal mithqāla dharratin khayran yarahu), emphasizing Allah’s meticulous justice. The term *mithqāl* (weight) paired with *dharratin* (a speck, atom, or the smallest ant) underscores that no act—no matter how tiny—is overlooked. In Shia tafsir, scholars like Allamah Tabatabai (Al-Mizan) explain that this verse reaffirms the principle of divine recompense: every good deed, even hidden intentions, is eternally recorded and rewarded. Historical narrations suggest this verse comforted early Muslims, reminding them that minor acts of kindness, charity, or patience hold immense value, countering the pre-Islamic mindset that only grand gestures mattered.  \n\nThe phrase *\"yara-hu\"* (will see it) signifies both recognition and manifestation—on Judgment Day, believers will witness their deeds materialized, as Imam Ali emphasized in Nahj al-Balagha: \"The scale of justice does not ignore a single breath.\" This instills hope and responsibility: small daily choices—helping a neighbor, speaking kindly, resisting gossip—become eternal investments. For modern Muslims, this verse is a call to integrity in an age of moral relativism. It teaches that ethical consistency matters more than public recognition, aligning with the Shia emphasis on *niyyah* (sincere intention). In a world obsessed with scale, this verse reminds us that Allah’s justice transcends quantity—He values the purity of our actions, urging us to build a life of conscious goodness, one \"atom\" at a time.",
    "layer2": "In interpreting Surah al-Zalzala 99:7, classical Shia exegetes emphasise the ontological reality of human actions and the precision of divine justice (ʿadl), foundational to Shia theology. Both Tabrisi in *Majma al-Bayan* and Tabatabai in *Al-Mizan* underscore that the verse’s declaration — “whoever does an atom’s weight of good will see it” — transcends metaphorical abstraction, affirming instead the tangible manifestation of deeds in the hereafter. Tabrisi notes that the “atom” (dharrah) signifies the smallest measurable unit, illustrating that no act escapes divine reckoning, however insignificant it may seem in worldly perception. This aligns with the Shia principle of divine omniscience and the belief that human deeds acquire an eternal, objective existence (haqiqah) that will be unveiled on the Day of Resurrection.\n\nTabatabai expands this concept philosophically, arguing that deeds are not transient events but enduring realities inscribed in the soul and cosmos. The “seeing” (yara-hu) mentioned in the verse thus denotes direct experiential knowledge, where one’s deeds become self-evident truths, inseparable from one’s resurrected being. This mirrors the Shia understanding of Qiyamah as a disclosure of metaphysical realities (kashf al-haqa’iq), where actions are judged not merely by external standards but by their intrinsic spiritual weight.\n\nThe verse also intersects with Shia juridical thought, as scholars like Shaykh al-Tusi link it to the necessity of ikhlas (sincerity) in worship, since even minor acts gain eternal significance when performed with pure intention under the guidance of the Ahl al-Bayt. The theological nexus between divine justice, human accountability, and the intercessory role of the Imams is implicit here: while justice demands exact recompense, the mercy channeled through the Imams’ wilayah offers hope that righteous deeds — however small — will be magnified. Thus, the verse encapsulates the Shia worldview where cosmic justice and redemptive mercy coexist through divine wisdom and the custodianship of the Maʿsumin.",
    "layer3": "In contemporary Shia scholarship, Surah Zalzala’s declaration that *\"whoever does an atom’s weight of good will see it\"* resonates profoundly in an age defined by interconnectedness and accountability. Ayatollah Nasir Makarim Shirazi, in his *Tafsir Nemuneh*, frames this verse as a cosmic affirmation of divine precision: every micro-action ripples through creation, aligning with modern physics’ understanding of quantum interdependence. The \"atom\" (dharr) here symbolises both scientific minutiae and moral granularity, urging believers to recognise that ethical choices—no matter how small—shape collective realities.  \n\nModern scholars like Dr. Mohammad Ali Shomali emphasise its social implications: systemic injustices, climate crises, or digital footprints all reflect how individual \"atoms\" of action aggregate into societal transformation. A donation to a food bank, a climate-conscious choice, or an online act of solidarity becomes part of a divinely witnessed ledger. Philosopher Sayyid Kamal al-Haydari links this to existential responsibility, noting that social media’s global reach amplifies the visibility of deeds, echoing the verse’s promise that goodness will be \"seen\"—both materially and metaphysically.  \n\nInterfaith dialogues highlight parallels: Jewish teachings on *tikkun olam* (repairing the world) and Buddhist karma ethics mirror this Quranic principle. In multicultural societies, the verse becomes a bridge, advocating universal moral agency amid polarisation. For youth grappling with nihilism, it offers hope: small acts of kindness counterbalance despair, affirming that no effort is wasted.  \n\nUltimately, this verse challenges modernity’s obsession with scale, recentering spirituality on intention’s sanctity. As artificial intelligence and climate thresholds redefine human impact, the \"atom’s weight\" reminds us that ethical living—rooted in Imam Ali’s maxim \"Do not regard any good as insignificant\"—is both a spiritual duty and a planetary necessity.",
    "layer4": "The verse from Surah Zalzala unveils the profound reality that no deed - however small - escapes Divine reckoning. Imam Ali (peace be upon him) taught that this \"seeing\" of one's deeds refers not merely to physical vision, but to the soul's awakening to its eternal record. He states: *\"On that Day, the scrolls of deeds will speak with the tongue of their owners, and every limb will testify against its companion.\"* (Nahj al-Balagha). This cosmic unveiling is inseparable from the Shia understanding of Divine Justice and the interlinked reality of Imamah - for it is the purified Guides who embody the scales of spiritual valuation.\n\nImam Jafar al-Sadiq (peace be upon him) illuminates the verse's depth: *\"The 'atom's weight' refers to the love of Muhammad's Progeny. Even if one's good deeds fill the earth but lack love for us, they will not be accepted.\"* (Bihar al-Anwar). Here, the Imam connects microscopic deeds to the macroscopic reality of Wilayah - the spiritual axis that gives meaning to all actions. A single sincere invocation of \"Ya Ali\" borne from recognition of his divine guardianship outweighs mountains of empty ritual.\n\nLady Fatimah (peace be upon her) taught that true \"good\" is measured by its alignment with truth: *\"Deeds are lifeless forms; it is the secret intentions within them that give them life.\"* (Bihar al-Anwar). This verse thus becomes a call to infuse every atom of our existence with God-consciousness through the luminous path of the Ahlul Bayt. Practical spirituality lies in embracing their teachings as the lens through which we evaluate our smallest thoughts and acts - from a smile given for Allah's sake to standing for justice when silence seems easier.\n\nLet this verse remind us that eternity is built moment by moment through deeds anchored in the love and obedience of those whom Allah made the Ark of Salvation. As Imam Zayn al-Abidin (peace be upon him) whispers in the Sahifa Sajjadiyya: *\"Make my good deeds worthy of being preserved, and my evil deeds worthy of being erased.\"* Our spiritual development lies in polishing each 'atom' of our being through the mirror of the Fourteen Luminaries.",
    "layer1_urdu": "مدینہ میں انکشاف کیا گیا ہے کہ سورت الزالزالا نے انکشاف کیا ہے کہ اس دن کے فیصلے کے دن کی وضاحت کی گئی ہے جب زمین انسانیت کے اعمال کو ظاہر کرتی ہے۔ آیت 7 نے اعلان کیا ہے ، * \"لہذا جو بھی ایٹم کا اچھا وزن اٹھاتا ہے اسے دیکھے گا\" * (ایف اے-مین یامل میتقلا دھارٹن خیران یاراہو) ، اللہ کے پیچیدہ انصاف پر زور دیتے ہوئے۔ اصطلاح * میتھقیل * (وزن) * دھارٹن * (ایک اسپیک ، ایٹم ، یا سب سے چھوٹی چیونٹی) کے ساتھ جوڑ بنائی گئی ہے جس کی نشاندہی کی جاتی ہے کہ کوئی عمل نہیں - چاہے اس سے کوئی فرق نہیں پڑتا ہے کہ کتنا چھوٹا سا نظرانداز ہے۔ شیعہ طافسیر میں ، علامہ تبتابائی (العزان) جیسے اسکالرز وضاحت کرتے ہیں کہ یہ آیت الہی بدلہ کے اصول کی تصدیق کرتی ہے: ہر نیک عمل ، یہاں تک کہ پوشیدہ ارادے ، ہمیشہ کے لئے ریکارڈ اور انعام دیا جاتا ہے۔ تاریخی بیانات تجویز کرتے ہیں کہ اس آیت نے ابتدائی مسلمانوں کو تسلی دی ، اور انہیں یاد دلاتے ہوئے کہا کہ مہربانی ، خیرات ، یا صبر کی معمولی حرکتیں اسلامی ذہنیت سے نمٹنے کے لئے بے حد اہمیت رکھتی ہیں ، جس سے صرف عظیم اشارے ہی اہمیت رکھتے ہیں۔  \n\n* \"یارا-ہو\" * (اس کو دیکھیں گے) جملہ پہچان اور اظہار دونوں کی نشاندہی کرتا ہے-یوم قیامت کے بعد ، مومن اپنے اعمال کو مشاہدہ کریں گے ، کیونکہ امام علی نے ناہج البالاگھا میں زور دیا ہے: \"انصاف کی پیمائش ایک ہی سانس کو نظرانداز نہیں کرتی ہے۔\" اس سے امید اور ذمہ داری پیدا ہوتی ہے: چھوٹے روزانہ کے انتخابات - پڑوسی کی مدد کرتے ہوئے ، حسن سلوک کرتے ہوئے ، گپ شپ کی مزاحمت کرتے ہیں - ابدی سرمایہ کاری۔ جدید مسلمانوں کے لئے ، یہ آیت اخلاقی تعلق کے دور میں سالمیت کی کال ہے۔ یہ سکھاتا ہے کہ اخلاقی مستقل مزاجی عوامی پہچان سے کہیں زیادہ اہمیت رکھتی ہے ، جو * نیہہ * (مخلص نیت) پر شیعہ زور دینے کے ساتھ صف بندی کرتی ہے۔ ایک ایسی دنیا میں جس میں پیمانے کا جنون ہے ، یہ آیت ہمیں یاد دلاتی ہے کہ اللہ کا انصاف مقدار سے تجاوز کرتا ہے۔",
    "layer2_urdu": "سورہ الضالزالا 99: 7 کی ترجمانی کرتے ہوئے ، کلاسیکی شیعہ استثنیٰ انسانی اعمال کی نظریاتی حقیقت اور الہی انصاف کی صحت سے متعلق پر زور دیتے ہیں ، جو شیعہ الہیات کی بنیاد ہے۔ * الجزان * میں * ماجما البیان * اور تبتابائی میں تبریسی دونوں اس بات کی نشاندہی کرتے ہیں کہ آیت کا اعلان-\"جو بھی ایٹم کا اچھا وزن اٹھاتا ہے اسے دیکھئے گا\"-استعاراتی تجرید سے آگے بڑھتا ہے ، اور اس کے بجائے اس کی تصدیق کرتا ہے کہ اس کے بجائے حٹر میں اعمال کے ٹھوس مظہر کی تصدیق ہوگی۔ تبریسی نے نوٹ کیا ہے کہ \"ایٹم\" (دھڑہ) سب سے چھوٹی پیمائش کرنے والی یونٹ کی نشاندہی کرتا ہے ، جس میں یہ واضح کیا گیا ہے کہ کوئی بھی ایکٹ الہی حساب سے بچ نہیں سکتا ہے ، تاہم یہ اہمیت نہیں ہے کہ یہ دنیاوی تاثرات میں لگتا ہے۔ یہ خدائی اصول کے شیعہ اصول اور اس عقیدے کے ساتھ منسلک ہے کہ انسانی اعمال ایک ابدی ، معروضی وجود (حق) حاصل کرتے ہیں جو قیامت کے دن نقاب کشائی کی جائے گی۔\n\nتبتابائی نے اس تصور کو فلسفیانہ طور پر وسعت دی ہے ، اور یہ استدلال کیا ہے کہ اعمال عارضی واقعات نہیں ہیں بلکہ روح اور برہمانڈیی میں لکھے ہوئے حقائق ہیں۔ آیت میں ذکر کردہ \"دیکھنا\" (یارا-ہو) اس طرح براہ راست تجرباتی علم کی نشاندہی کرتا ہے ، جہاں کسی کے اعمال خود واضح سچائیاں بن جاتے ہیں ، جو کسی کے جی اٹھے ہوئے وجود سے الگ نہیں ہوتے ہیں۔ اس سے استعفہ کے بارے میں شیعہ تفہیم کو استعاریاتی حقائق (کاشف الحقائق) کے انکشاف کے طور پر آئینہ دار بنایا گیا ہے ، جہاں اعمال کو محض بیرونی معیارات کے ذریعہ نہیں بلکہ ان کے اندرونی روحانی وزن سے اندازہ کیا جاتا ہے۔\n\nیہ آیت شیعہ فقہی فکر کے ساتھ بھی آپس میں ملتی ہے ، کیوں کہ شیخ التوسی جیسے اسکالر اسے عبادت میں اخلا (اخلاص) کی ضرورت سے جوڑتے ہیں ، کیوں کہ یہاں تک کہ معمولی حرکتیں بھی ابدی اہمیت حاصل کرتی ہیں جب اہل البیت کی رہنمائی کے تحت خالص ارادے کے ساتھ انجام دیا جاتا ہے۔ خدائی انصاف ، انسانی احتساب ، اور اماموں کے شفاعت کے کردار کے مابین مذہبی گٹھ جوڑ یہاں مضمر ہے: اگرچہ انصاف عین مطابق بدلہ لینے کا مطالبہ کرتا ہے ، لیکن اماموں کے ذریعہ دی گئی رحمت نے امید کی پیش کش کی ہے کہ نیک اعمال - حالانکہ چھوٹے - کو بڑھاوا دیا جائے گا۔ اس طرح ، آیت شیعہ کے عالمی نظریہ کو گھیرے میں لیتی ہے جہاں کائناتی انصاف اور نجات دہندہ رحمت کے ساتھ الہی حکمت اور ماسومین کی تائید کے ذریعہ ایک ساتھ رہتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ زلزالا کا یہ اعلان کہ * \"جو بھی ایٹم کا اچھا وزن اٹھاتا ہے اسے دیکھے گا\" * باہمی ربط اور احتساب کے ذریعہ بیان کردہ اس دور میں گہری گونجتا ہے۔ آیت اللہ ناصر مکارم شرازی ، اپنے *طافسیر نمونیہ *میں ، اس آیت کو الہی صحت سے متعلق کائناتی اثبات کے طور پر تیار کرتا ہے: تخلیق کے ذریعہ ہر مائکرو ایکشن کی لہریں ، جدید طبیعیات کے ساتھ صف بندی کرتے ہوئے ’کوانٹم باہمی انحصار کی تفہیم۔ یہاں \"ایٹم\" (دھار) سائنسی منٹویا اور اخلاقی دانے دار دونوں کی علامت ہے ، اور مومنین پر زور دیتا ہے کہ وہ اخلاقی انتخاب کو تسلیم کریں - چاہے اس سے قطع نظر کہ اجتماعی حقائق کتنی چھوٹی ہیں۔  \n\nڈاکٹر محمد علی شومالی جیسے جدید اسکالرز اپنے معاشرتی مضمرات پر زور دیتے ہیں: نظامی ناانصافی ، آب و ہوا کے بحرانوں ، یا ڈیجیٹل پیروں کے نشانات سب کی عکاسی کرتے ہیں کہ کس طرح معاشرتی تبدیلی میں مجموعی طور پر عمل کے انفرادی \"جوہری\" جمع ہوتے ہیں۔ کسی فوڈ بینک کو عطیہ ، آب و ہوا سے آگاہ انتخاب ، یا یکجہتی کا ایک آن لائن عمل ایک خدائی گواہ والے لیجر کا حصہ بن جاتا ہے۔ فلسفی سید کمل الحیداری اس کو وجودی ذمہ داری سے جوڑتے ہیں ، اور یہ کہتے ہوئے کہ سوشل میڈیا کی عالمی سطح پر اعمال کی نمائش کو بڑھاوا دیتا ہے ، اس آیت کے اس وعدے کی بازگشت کرتے ہیں کہ مادی اور استعاراتی طور پر نیکی کو \"دیکھا جائے گا\"۔  \n\nبین المذاہب مکالمے متوازی کو اجاگر کرتے ہیں: یہودی تعلیمات * ٹِکون اولم * (دنیا کی مرمت) اور بدھ مت کے کرما اخلاقیات اس قرآنی اصول کو آئینہ دار کرتی ہیں۔ کثیر الثقافتی معاشروں میں ، آیت ایک پل بن جاتی ہے ، جو پولرائزیشن کے درمیان عالمگیر اخلاقی ایجنسی کی حمایت کرتی ہے۔ نوجوانوں کے لئے نحموں کے ساتھ جکڑے ہوئے ، یہ امید کی پیش کش کرتا ہے: شفقت کی چھوٹی چھوٹی حرکتوں سے مایوسی کی مایوسی ، اس بات کی تصدیق کرتے ہوئے کہ کوئی کوشش ضائع نہیں ہوتی ہے۔  \n\nآخر کار ، یہ آیت جدیدیت کے جنون کو پیمانے کے ساتھ چیلنج کرتی ہے ، نیت کے تقدس پر روحانیت کو ظاہر کرتی ہے۔ چونکہ مصنوعی ذہانت اور آب و ہوا کی دہلیز انسانی اثرات کو نئی شکل دیتی ہے ، \"ایٹم کا وزن\" ہمیں یاد دلاتا ہے کہ اخلاقی زندگی - جو امام علی کے میکسم میں جڑی ہوئی ہے \"کسی بھی اچھ .ے کو ایک اہمیت نہیں مانتی\" - یہ ایک روحانی فرض اور سیاروں کی ضرورت دونوں ہے۔",
    "layer4_urdu": "سورہ زلزلہ کی آیت اس گہری حقیقت کی نقاب کشائی کرتی ہے کہ کوئی عمل - اگرچہ چھوٹا - الہی حساب سے بچ جاتا ہے۔ امام علی (اس پر امن) نے سکھایا کہ کسی کے اعمال کی یہ \"دیکھنے\" کا مطلب محض جسمانی وژن سے نہیں ہوتا ، بلکہ روح کے بیداری کو اس کے ابدی ریکارڈ سے بیدار کرنا ہے۔ وہ بیان کرتا ہے: \"اس دن ، اعمال کی کتابیں اپنے مالکان کی زبان سے بات کریں گی ، اور ہر اعضاء اس کے ساتھی کے خلاف گواہی دے گا۔\" * (ناہج البالاگھا)۔ یہ کائناتی نقاب کشائی الہی انصاف کے بارے میں شیعہ تفہیم اور امامہ کی باہم حقیقت سے لازم و ملزوم ہے - کیونکہ یہ صاف ستھرا رہنما ہیں جو روحانی تشخیص کے ترازو کو مجسم بناتے ہیں۔\n\nامام جعفر السادق (اس پر امن) آیت کی گہرائی کو روشن کرتا ہے: * \"ایٹم کا وزن 'محمد کی اولاد کی محبت سے مراد ہے۔ یہاں تک کہ اگر کسی کے اچھے کام زمین کو بھرتے ہیں لیکن ہمارے لئے محبت کا فقدان ہے تو ، ان کو قبول نہیں کیا جائے گا۔\" * (بہار الانور)۔ یہاں ، امام مائکروسکوپک اعمال کو ولیہ کی میکروسکوپک حقیقت سے جوڑتا ہے - روحانی محور جو تمام اعمال کو معنی بخشتا ہے۔ اس کی الہی سرپرستی کے اعتراف سے پیدا ہونے والے \"یا علی\" کی ایک واحد مخلصانہ درخواست خالی رسم کے پہاڑوں سے کہیں زیادہ ہے۔\n\nلیڈی فاطمہ (اس پر امن ہے) نے سکھایا کہ سچ کے ساتھ اس کی سیدھ سے حقیقی \"اچھ\" ا \"ماپا جاتا ہے: *\" اعمال بے جان شکل ہیں۔ یہ ان کے اندر خفیہ ارادے ہیں جو انہیں زندگی بخشتے ہیں۔ \" * (بہار الانور)۔ اس طرح یہ آیت اپنے وجود کے ہر ایٹم کو خدا کے شعور سے متاثر کرنے کا مطالبہ بن جاتی ہے جو اہل بائٹ کے برائٹ راہ کے ذریعے۔ عملی روحانیت ان کی تعلیمات کو لینس کے طور پر قبول کرنے میں مضمر ہے جس کے ذریعے ہم اپنے چھوٹے چھوٹے خیالات اور اعمال کا اندازہ کرتے ہیں - اللہ کی خاطر دی جانے والی مسکراہٹ سے لے کر جب خاموشی آسان معلوم ہوتی ہے۔\n\nاس آیت کو ہمیں یہ یاد دلانے دیں کہ ابدی لمحہ لمحہ لمحہ بہ لمحہ ان لوگوں کی محبت اور اطاعت کے ذریعے لنگر انداز کیا جاتا ہے جن کو اللہ نے نجات کا صندوق بنایا تھا۔ جیسا کہ امام زین العبدین (اس پر امن ہے) ساہفا سججدیہ میں سرگوشیاں کرتے ہیں: * \"میرے نیک اعمال کو محفوظ رکھنے کے لائق بنائیں ، اور میرے برے کاموں کو مٹا دینے کے لائق بنائیں۔",
    "layer5": "The verse’s emphasis on divine justice and meticulous accountability for deeds forms a point of convergence between Shia and Sunni exegetical traditions. Both schools affirm its literal meaning: every good act, however minute, will be manifestly rewarded. Al-Tabari (Sunni) underscores universal accountability, stating this verse dismantles human complacency by affirming that \"no soul is exempt from divine scrutiny\" (*Jami al-Bayan*). Similarly, Al-Tabrisi (Shia) in *Majma al-Bayan* highlights Allah’s infinite justice, noting that even a \"molecule’s weight\" of goodness is preserved in divine records, resonating with Al-Qurtubi’s (Sunni) assertion in *Al-Jami li-Ahkam* that divine justice transcends human perceptions of insignificance.  \n\nDivergences emerge in theological implications. Shia commentaries often integrate this verse into frameworks of intercession (*shafa‘a*) and the ontological role of the Ahl al-Bayt. Al-Tabarsi and Al-Tusi (*At-Tibyan*) link the \"seeing\" of deeds to the eschatological unveiling (*kashf*) mediated by the Imams, reflecting the Shia belief in their role as spiritual guides in the hereafter. In contrast, Ibn Kathir (Sunni) in his *Tafsir* avoids intermediary roles, framing the \"seeing\" as direct divine recompense, emphasizing individual responsibility—a view echoed by Fakhr al-Din al-Razi (Sunni), who interprets the verse through Ash‘ari occasionalism, where Allah’s absolute will determines reward without necessitating intermediaries (*Mafatih al-Ghayb*).  \n\nPractically, Shia interpretations may reinforce devotion to the Imams as channels of divine grace, while Sunni readings stress personal vigilance in ethical conduct. These differences stem from distinct theological priorities: Shia exegesis often embeds verses within narratives of the Imams’ cosmic significance, whereas Sunni scholarship prioritizes Allah’s unmediated sovereignty. Both traditions, however, share a core ethical imperative: the necessity of moral consciousness anchored in the certainty of ultimate justice.",
    "layer5_urdu": "الہی انصاف اور اعمال کے لئے پیچیدہ احتساب پر آیت کا زور شیعہ اور سنی سے متعلق اصلاحی روایات کے مابین ایک نقطہ نظر کی حیثیت رکھتا ہے۔ دونوں اسکول اس کے لغوی معنی کی تصدیق کرتے ہیں: ہر اچھ act ے عمل ، تاہم ، ایک منٹ ، اس کا واضح طور پر اجر دیا جائے گا۔ التباری (سنی) نے عالمگیر احتساب کی نشاندہی کی ، اس آیت کو یہ کہتے ہوئے کہ \"کسی بھی روح کو الہی چھان بین سے مستثنیٰ نہیں ہے\" (*جمی البیان*) کی تصدیق کرتے ہوئے انسانی خوشنودی کو ختم کیا گیا ہے۔ اسی طرح ، * ماجما البیان * میں الاترسی (شیعہ) نے اللہ کے لامحدود انصاف کو اجاگر کیا ، یہ نوٹ کرتے ہوئے کہ نیکی کا ایک \"انو کا وزن\" بھی خدائی ریکارڈوں میں محفوظ ہے ، جو الکوروبی کے (سنی) کی علامت کے ساتھ گونج رہا ہے۔  \n\nمذہبی مضمرات میں تغیرات ابھرتے ہیں۔ شیعہ کی تبصرے اکثر اس آیت کو شفاعت کے فریم ورک (*شفاع*) اور اے ایچ ایل ال بیت کے آنٹولوجیکل کردار میں ضم کرتی ہیں۔ التابرسسی اور التوسی (*ایٹ-تبیان*) اعمال کی \"دیکھنے\" کو اسچٹولوجیکل نقاب کشائی (*کاشف*) سے مربوط کرتے ہیں جو آئیماموں کے ذریعہ ثالثی کرتے ہیں ، جو اس کے بعد میں روحانی ہدایت نامہ کے طور پر ان کے کردار میں شیعہ کے عقیدے کی عکاسی کرتے ہیں۔ اس کے برعکس ، ابن کتھیر (سنی) اپنے*طافیر*میں ثالثی کے کرداروں سے گریز کرتے ہیں ، اور \"دیکھنے\" کو براہ راست الہی بدلہ دیتے ہیں ، اور انفرادی ذمہ داری پر زور دیتے ہیں۔ الغیب*)۔  \n\nعملی طور پر ، شیعہ تشریحات الٰہی فضل کے چینلز کی حیثیت سے اماموں سے عقیدت کو تقویت بخش سکتی ہیں ، جبکہ سنی ریڈنگ اخلاقی طرز عمل میں ذاتی چوکسی پر زور دیتی ہے۔ یہ اختلافات الگ الگ مذہبی ترجیحات سے پیدا ہوتے ہیں: شیعہ کی اصلاح اکثر آیات کو اماموں کی کائناتی اہمیت کے بیانیہ میں شامل کرتی ہے ، جبکہ سنی اسکالرشپ اللہ کی غیر منقسم خودمختاری کو ترجیح دیتی ہے۔ تاہم ، دونوں روایات ایک بنیادی اخلاقی لازمی طور پر شریک ہیں: حتمی انصاف کی یقین میں اخلاقی شعور کی ضرورت۔",
    "summary": "According to classical exegesis in Tafsir al-Mizan, *Majma al-Bayan* and Tabatabai in *Al-Mizan* underscore that the verse’s declaration — “whoever does an atom’s weight of good will see it” — transcends metaphorical abstraction, affirming instead the tangible manifestation of deeds in the hereafter. Surah al-Zalzala, revealed in Medina, powerfully describes the Day of Judgment when the earth will violently shake, revealing humanity’s deeds. Verse 7 declares, *\"So whoever does an atom’s weight of good will see it\"* (fa-man ya‘mal mithqāla dharratin khayran yarahu), emphasizing Allah’s meticulous justice. The term *mithqāl* (weight) paired with *dharratin* (a speck, atom, or the smallest ant) underscores that no act—no matter how tiny—is overlooked. Imam Ali (peace be upon him) taught that this \"seeing\" of one's deeds refers not merely to physical vision, but to the soul's awakening to its eternal record. This verse reminds us that Allah’s justice transcends quantity—He values the purity of our actions, urging us to build a life of conscious goodness, one \"atom\" at a time."
  },
  "8": {
    "layer1": "The verse \"وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍۢ شَرًّۭا يَرَهُۥ\" from Surah Az-Zalzala (99:8) powerfully reinforces Islam’s core principle of divine justice. It declares that every person will witness even the smallest evil they committed, measured as \"mithqala dharratin\" (the weight of an atom). This phrase uses \"dharratin,\" a term for the tiniest particle, to stress that no deed—good or bad—is overlooked by Allah. The verse complements the preceding one (99:7), which promises reward for the smallest good, creating a balance that reflects divine fairness.  \n\nHistorically, this Meccan surah was revealed during intense persecution of early Muslims, offering both warning and hope. It reminded the oppressed community that their minor acts of patience and faith mattered, while assuring their oppressors that tyranny would not go unaccounted. Classical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, explains that the \"seeing\" of deeds on Judgment Day isn’t merely visual—it’s a profound awareness of how each action shaped one’s soul and destiny. The Ahlul Bayt, particularly Imam Ali, emphasised that this verse dismantles excuses for sin; even hidden wrongs are recorded and will manifest.  \n\nToday, this verse calls Muslims to ethical mindfulness. In an era where \"minor\" sins—gossip, dishonesty, or neglecting others’ rights—are often normalised, the Quran reminds us that spiritual consequences transcend human perceptions of scale. It encourages self-accountability: daily reflection on actions, seeking forgiveness for faults, and valuing small acts of kindness. Practically, this means avoiding the trap of thinking “just this once” for harmful choices and finding hope in the eternal impact of minor good deeds. By internalising this balance, Muslims cultivate taqwa (God-consciousness) that permeates every facet of life, trusting in a justice system far more precise than any human construct.",
    "layer2": "In classical Shia exegesis, Surah al-Zalzala’s eighth verse epitomizes the principle of divine justice (ʿadl) and meticulous accountability central to Twelver theology. Allamah Tabatabai in *Al-Mizan* underscores that the verse’s declaration — that even an atom’s weight of evil will be manifest — affirms God’s absolute knowledge and the ontological reality of human actions. He explains that deeds are not merely abstract legal categories but existential realities (haqaʾiq wujūdiyya) inscribed in the soul, which will be fully actualized in the hereafter. This aligns with the Shia metaphysical view of resurrection as the \"unveiling\" (kashf) of deeds’ intrinsic consequences rather than arbitrary reward or punishment.\n\nTabrisi’s *Majma al-Bayan* complements this by citing Imam Jafar al-Sadiq’s interpretation: the \"seeing\" (yara-hu) of evil refers not merely to visual perception but to experiential confrontation with one’s deeds as inseparable aspects of one’s resurrected identity. The Imam emphasizes that the scales of justice will encompass both outward acts and hidden intentions (niyyat), resonating with Shia juridical principles that prioritize intentionality in determining moral accountability. \n\nThe verse’s theological depth is further enriched by its connection to the Shia doctrine of intercession (shafaʿa). Classical commentators note that while divine justice necessitates the exposure of all deeds, the mercy mediated through the Ahl al-Bayt — as custodians of divine grace — transforms this confrontation into a means of purification for believers. This balance between justice and mercy reflects the Shia understanding of God’s attributes as harmoniously coexistent, not contradictory. Jurisprudentially, the verse reinforces the ethical imperative of vigilance (muraqaba) in minor acts, as emphasized in narrations from the Imams warning against dismissing \"small\" sins. Thus, the verse serves as both a warning and a reminder of the ontological gravity embedded in human moral agency.",
    "layer3": "In contemporary Shia scholarship, Surah Zalzala’s declaration that every “atom’s weight of evil” will be witnessed resonates profoundly in an age of hyper-connectivity and moral accountability. Ayatollah Naser Makarem Shirazi emphasizes that this verse transcends literal atoms, symbolizing the inescapable ripple effects of human actions—a concept mirrored in quantum physics’ observation that particles leave traces, and chaos theory’s “butterfly effect,” where minor acts trigger vast consequences. Modern scholars like Dr. Mohammad Ali Shomali link this to today’s social ecosystems: a single discriminatory tweet or microaggression, though seemingly insignificant, perpetuates systemic harm, just as individual carbon footprints collectively fuel climate crises.  \n\nThe verse’s ethical imperative intersects with existential philosophy—Sartre’s “man is responsible for what he is”—but grounds it in divine justice. Contemporary Shia thinkers, such as Sayyid Ammar Nakshawani, contextualize it within social justice movements, urging believers to recognize how structural inequalities (economic disparity, Islamophobia) emerge from accumulated “atom-sized” injustices. Here, the Ahlul Bayt’s teachings on *mizan* (divine balance) inspire holistic activism: addressing both personal ethics and systemic reform.  \n\nInterfaith parallels abound. The Buddhist concept of karma and Christian teachings on reaping sown actions (Galatians 6:7) echo this cosmic accountability, fostering interreligious solidarity in tackling global challenges. In multicultural societies, the verse becomes a call to mindfulness: in an era of viral misinformation and environmental collapse, every choice—plastic use, online behavior—carries eschatological weight. Ultimately, the verse bridges divine omniscience with modern empiricism, urging humanity to see itself as both morally indivisible and eternally answerable.",
    "layer4": "The verse from Surah Zalzala pierces the heart with its profound warning, reminding believers that no deed—however minute—escapes divine justice. The Ahlul Bayt (peace be upon them) taught that this \"seeing\" of evil on Judgment Day is not merely a visual experience but a spiritual unveiling where actions manifest as realities shaping one’s eternal state. Imam Ja’far al-Sadiq (peace be upon him) explained, *“The atom’s weight refers to the recognition (ma’rifah) of the Imam. Whoever rejects the wilayah of the Imam, even slightly, has committed the gravest evil”* (Tafsir al-Qummi). Here, the Imam links the verse’s “evil” to rejecting divine guidance through the Imams, emphasizing that spiritual misalignment—not just physical acts—determines eternal consequences.  \n\nImam Ali (peace be upon him) warned, *“Beware of sins you deem small, for they accumulate until they destroy you”* (Ghurar al-Hikam). This echoes the verse’s lesson: minor evils, if unrepented, crystallize into spiritual ruin. Lady Fatimah (peace be upon her) taught that deeds are judged by their roots in divine love; actions opposing the Ahlul Bayt’s teachings, even if outwardly insignificant, corrupt the soul’s foundation.  \n\nThe Shia understanding ties this verse to the necessity of Imamah—the belief that true accountability requires recognizing the Imams as guides to distinguish good from evil. Without their light, one risks mistaking destructive acts for trivialities. Practical guidance lies in daily self-accountability (muhasabah), seeking forgiveness for even “minor” wrongs, and aligning every intention and action with the love and obedience of the Ahlul Bayt. As Imam al-Baqir (peace be upon him) said, *“Hold fast to our wilayah, for it is the scale by which deeds are weighed”* (Al-Kafi). Through this lens, the verse becomes a call to purify the heart and cling to the rope of divine guardianship (wilayah), ensuring every atom of our existence resonates with truth.",
    "layer1_urdu": "سورت ایز زلزالہ (99: 8) سے تعلق رکھنے والی آیت \" اس نے اعلان کیا ہے کہ ہر شخص اپنی چھوٹی چھوٹی برائی کا بھی مشاہدہ کرے گا ، جس کی پیمائش \"میتقالا دھارٹن\" (ایٹم کا وزن) کے طور پر کی جاتی ہے۔ اس جملے میں \"دھارٹن\" کا استعمال کیا گیا ہے ، جس میں چھوٹے چھوٹے ذرہ کے لئے ایک اصطلاح ہے ، جس پر زور دیا گیا ہے کہ کوئی عمل - اچھا یا برا - اللہ نے نظرانداز کیا ہے۔ آیت پچھلے ایک (99: 7) کی تکمیل کرتی ہے ، جو سب سے چھوٹی بھلائی کے لئے انعام دینے کا وعدہ کرتی ہے ، جس سے ایک توازن پیدا ہوتا ہے جو خدائی انصاف کی عکاسی کرتا ہے۔  \n\nتاریخی طور پر ، یہ میکن سورہ ابتدائی مسلمانوں پر شدید ظلم و ستم کے دوران انکشاف ہوا تھا ، جس میں انتباہ اور امید دونوں کی پیش کش کی گئی تھی۔ اس نے مظلوم برادری کو یاد دلایا کہ ان کے صبر اور عقیدے کی معمولی حرکتوں کا فرق ہے ، جبکہ ان کے جابروں کو یقین دلایا کہ ظلم کا کوئی حساب نہیں ہوگا۔ کلاسیکی شیعہ طافس ، جیسے الامہ تبتابائی کے *المزان *، نے وضاحت کی ہے کہ یوم جمعہ کے موقع پر اعمال کا \"دیکھنا\" محض بصری نہیں ہے-یہ اس بات کی گہری آگاہی ہے کہ کس طرح ہر عمل نے کسی کی روح اور مقدر کی تشکیل کی ہے۔ اہل بیت ، خاص طور پر امام علی نے اس بات پر زور دیا کہ یہ آیت گناہ کے بہانے کو ختم کرتی ہے۔ یہاں تک کہ پوشیدہ غلطیاں بھی ریکارڈ کی جاتی ہیں اور ظاہر ہوں گی۔  \n\nآج ، یہ آیت مسلمانوں کو اخلاقی ذہنیت کو قرار دیتی ہے۔ ایک ایسے دور میں جہاں \"معمولی\" گناہ - گوسپ ، بے ایمانی ، یا دوسروں کے حقوق کو نظرانداز کرتے ہیں - اکثر معمول کو معمول پر لایا جاتا ہے ، قرآن ہمیں یاد دلاتا ہے کہ روحانی نتائج پیمانے کے انسانی تاثرات سے تجاوز کرتے ہیں۔ یہ خود بخود کی حوصلہ افزائی کرتا ہے: اعمال پر روزانہ کی عکاسی ، غلطیوں کے لئے معافی مانگنے ، اور نرمی کی چھوٹی چھوٹی حرکتوں کی قدر کرنا۔ عملی طور پر ، اس کا مطلب ہے کہ نقصان دہ انتخاب کے ل “\" صرف ایک بار \"سوچنے کے جال سے گریز کرنا اور معمولی نیک کاموں کے دائمی اثرات میں امید تلاش کرنا۔ اس توازن کو اندرونی بناتے ہوئے ، مسلمان تقوا (خدا کے شعور) کی کاشت کرتے ہیں جو زندگی کے ہر پہلو کو گھومتے ہیں ، اور کسی بھی انسانی تعمیر سے کہیں زیادہ عین مطابق انصاف کے نظام پر بھروسہ کرتے ہیں۔",
    "layer2_urdu": "کلاسیکی شیعہ استثنیٰ میں ، سورہ الزلزالا کی آٹھویں آیت الہی انصاف (الدال) کے اصول اور ٹوائلور الہیات کے مرکزی مرکزیت کا مرکز بناتی ہے۔ * المزان * میں الامہ تبتابائی نے اس بات کی نشاندہی کی ہے کہ آیت کا اعلان-یہاں تک کہ ایک ایٹم کا برائی کا وزن بھی ظاہر ہوگا-خدا کے مطلق علم اور انسانی اعمال کی نظریاتی حقیقت کی تصدیق کرتا ہے۔ انہوں نے وضاحت کی کہ اعمال محض تجریدی قانونی زمرے نہیں ہیں بلکہ وجودی حقائق (حقائق ووجدیہ) روح میں لکھا ہوا ہے ، جو اس کے بعد میں پوری طرح سے حقیقت میں آجائے گا۔ یہ قیامت کے شیعہ استعاریاتی نظریہ کے ساتھ موافق ہے جو اعمال کے \"نقاب کشائی\" (کاشف) کے طور پر ہے۔\n\nتبریسی کا * مجس البیان * امام جعفر السادق کی تشریح کا حوالہ دے کر اس کی تکمیل کرتا ہے: برائی کی \"دیکھنا\" (یارا-ہو) محض بصری تاثر سے نہیں بلکہ کسی کی تخلیق شدہ شناخت کے لازم و ملزوم پہلوؤں کے طور پر کسی کے اعمال کے ساتھ تجرباتی محاذ آرائی سے مراد ہے۔ امام نے اس بات پر زور دیا ہے کہ انصاف کے ترازو میں ظاہری عمل اور پوشیدہ ارادوں (NIYYAT) دونوں کو شامل کیا جائے گا ، جو اخلاقی احتساب کے تعین میں ارادے کو ترجیح دیتے ہیں۔ \n\nآیت کی مذہبی گہرائی کو اس کے شیعہ نظریہ شفاعت (شافا) سے تعلق سے مزید تقویت ملی ہے۔ کلاسیکی مبصرین نے نوٹ کیا کہ جب خدائی انصاف کو تمام اعمال کی نمائش کی ضرورت ہوتی ہے ، لیکن الہی فضل کے نگران ہونے کے ناطے اے ایچ ایل ال بیت کے ذریعہ ثالثی کی گئی رحمت-اس تصادم کو مومنوں کے لئے طہارت کے ایک ذریعہ میں تبدیل کردیتی ہے۔ انصاف اور رحمت کے مابین یہ توازن خدا کی صفات کے بارے میں شیعہ کو سمجھنے کی عکاسی کرتا ہے جیسا کہ متضاد نہیں ہے ، متضاد نہیں۔ فقہی طور پر ، آیت معمولی حرکتوں میں نظریہ (مرقبہ) کے اخلاقی لازمی کو تقویت دیتی ہے ، جیسا کہ \"چھوٹے\" گناہوں کو مسترد کرنے کے خلاف اماموں کی انتباہ پر زور دیا گیا ہے۔ اس طرح ، یہ آیت انسانی اخلاقی ایجنسی میں سرایت شدہ آنٹولوجیکل کشش ثقل کی ایک انتباہ اور یاد دہانی کے طور پر کام کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ زلزالا کا یہ اعلان کہ ہر \"ایٹم کا وزن برائی\" کا مشاہدہ کیا جائے گا۔ آیت اللہ نصر مکارم شیرازی نے اس بات پر زور دیا ہے کہ یہ آیت لفظی ایٹموں سے بالاتر ہے ، جو انسانی اعمال کے ناگزیر لہروں کی علامت ہے۔ یہ ایک تصور کوانٹم فزکس کے مشاہدے میں آئینہ دار ہے کہ ذرات کے نشانات چھوڑ جاتے ہیں ، اور افراتفری کا نظریہ \"تتلی اثر\" ہوتا ہے ، جہاں معمولی حرکتیں وسیع نتائج کو متحرک کرتی ہیں۔ ڈاکٹر محمد علی شمالی جیسے جدید اسکالرز اس کو آج کے معاشرتی ماحولیاتی نظام سے جوڑتے ہیں: ایک ہی امتیازی ٹویٹ یا مائکروگگریشن ، اگرچہ بظاہر معمولی حد تک اہمیت کا حامل ہے ، جس طرح انفرادی طور پر کاربن کے نقشوں کے نشانات اجتماعی طور پر آب و ہوا کے بحرانوں کو ایندھن دیتے ہیں۔  \n\nآیت کی اخلاقی لازمی وجود کے فلسفے کے ساتھ ملتی ہے۔ سارتر کا \"انسان اس کے لئے ذمہ دار ہے\"۔ معاصر شیعہ مفکرین ، جیسے سید عمار نکشوانی ، معاشرتی انصاف کی تحریکوں کے اندر اس کا سیاق و سباق بنائیں ، مومنین پر زور دیتے ہیں کہ وہ یہ تسلیم کریں کہ کس طرح ساختی عدم مساوات (معاشی تفاوت ، اسلامو فوبیا) جمع شدہ \"ایٹم سائز\" ناانصافیوں سے نکلتی ہے۔ یہاں ، * میزان * (الہی توازن) پر اہل بیت کی تعلیمات جامع سرگرمی کو متاثر کرتی ہیں: ذاتی اخلاقیات اور نظامی اصلاحات دونوں کو حل کرنا۔  \n\nانٹرفیتھ متوازی بہت زیادہ ہے۔ بو بونے والے اقدامات سے متعلق کرما اور عیسائی تعلیمات کا بدھ مت کے تصور (گلتیوں 6: 7) اس کائناتی احتساب کی بازگشت کرتے ہوئے ، عالمی چیلنجوں سے نمٹنے میں باہمی یکجہتی کو فروغ دیتے ہوئے۔ کثیر الثقافتی معاشروں میں ، آیت ذہنیت کی کال بن جاتی ہے: وائرل غلط معلومات اور ماحولیاتی خاتمے کے دور میں ، ہر انتخاب - پلاسٹک کا استعمال ، آن لائن سلوک - کیریجسیٹولوجیکل وزن۔ بالآخر ، آیت جدید ترین امپائریزم کے ساتھ الہی الہٰی سائنس کو پل کرتی ہے ، اور انسانیت پر زور دیتی ہے کہ وہ خود کو اخلاقی طور پر ناقابل تسخیر اور ہمیشہ کے لئے جوابدہ دونوں کے طور پر دیکھیں۔",
    "layer4_urdu": "سورہ زلزالا کی آیت دل کو اپنی گہری انتباہ سے چھیدتی ہے ، اور مومنوں کو یاد دلاتی ہے کہ کوئی عمل - بہرحال ایک منٹ - الہی انصاف کی حمایت کرتا ہے۔ اہل بیت (ان پر امن) نے یہ سکھایا کہ یوم قیامت کے دن برائی کا یہ \"دیکھنا\" محض ایک بصری تجربہ نہیں ہے بلکہ ایک روحانی نقاب کشائی کرنا ہے جہاں عمل کسی کی ابدی حالت کی تشکیل کرنے والی حقائق کے طور پر ظاہر ہوتا ہے۔ امام جافر السادیق (اس پر امن) نے وضاحت کی ، * \"ایٹم کے وزن سے مراد امام کی پہچان (ما rah ہ) ہے۔ جو بھی امام کے ولیہ کو مسترد کرتا ہے ، یہاں تک کہ تھوڑا سا ، اس نے کشش کی برائی کا ارتکاب کیا ہے\" * (طفیر القومی)۔ یہاں ، امام آیت کی \"برائی\" کو اماموں کے ذریعہ الہی رہنمائی کو مسترد کرنے سے جوڑتا ہے ، اس بات پر زور دیتے ہوئے کہ روحانی غلط فہمی - نہ صرف جسمانی حرکتوں - ابدی نتائج کا تعی .ن کرتی ہے۔  \n\nامام علی (اس پر امن) نے متنبہ کیا ، * \"ان گناہوں سے بچو جو آپ چھوٹے سمجھے جاتے ہیں ، کیونکہ وہ اس وقت تک جمع ہوجاتے ہیں جب تک کہ وہ آپ کو ختم کردیں\" * (گھورار الحکام)۔ اس آیت کے سبق کی بازگشت ہے: معمولی برائیوں ، اگر غیر منحصر ہے تو ، روحانی بربادی میں کرسٹل بنائیں۔ لیڈی فاطمہ (اس پر امن) نے یہ سکھایا کہ اعمال کو خدائی محبت میں ان کی جڑوں سے سمجھا جاتا ہے۔ اہل بائٹ کی تعلیمات کی مخالفت کرنے والے اقدامات ، چاہے ظاہری طور پر اہمیت نہ رکھیں ، روح کی بنیاد کو خراب کردیں۔  \n\nشیعہ تفہیم اس آیت کو امامہ کی ضرورت سے جوڑتی ہے۔ یہ عقیدہ ہے کہ حقیقی احتساب کے لئے ائوں کو برائی سے نیکی کو ممتاز کرنے کے رہنما کے طور پر تسلیم کرنا ہوتا ہے۔ ان کی روشنی کے بغیر ، کسی کو چھوٹی چھوٹی چیزوں کے لئے تباہ کن حرکتوں کا خطرہ ہے۔ عملی رہنمائی روزانہ کی خود حساب کتاب (محسابہ) میں ہے ، یہاں تک کہ \"معمولی\" غلطیوں کے لئے بھی معافی مانگتی ہے ، اور ہر ارادے اور عمل کو اہل بیت کی محبت اور اطاعت کے ساتھ سیدھ میں لاتی ہے۔ جیسا کہ امام البقیر (اس پر سلامتی ہے) نے کہا ، * \"ہمارے ولیہ کو تیزی سے تھام لو ، کیونکہ یہ وہ پیمانہ ہے جس کے ذریعہ اعمال کا وزن کیا جاتا ہے\" * (الکافی)۔ اس عینک کے ذریعہ ، آیت دل کو پاک کرنے اور خدائی سرپرستی (ولیہ) کی رسی سے چمٹے رہنے کی کال بن جاتی ہے ، جو ہمارے وجود کے ہر ایٹم کو سچائی سے گونجتی ہے۔",
    "layer5": "The interpretation of Surah Az-Zalzala 8 across Shia and Sunni traditions reveals shared emphasis on divine justice while diverging in theological nuance. Both schools concur that the verse affirms Allah’s meticulous accountability, wherein even the smallest evil deed will be manifest on Judgment Day. Al-Tabari (Sunni) and Al-Tusi (Shia) alike stress the literal reading of “seeing” deeds, underscoring the inescapable nature of divine reckoning. Ibn Kathir and Al-Tabrisi both link this to the Quranic principle of perfect justice (e.g., 21:47), rejecting any notion of divine oversight, a stance echoed in Al-Mizan and Al-Qurtubi’s works.  \n\nDivergences emerge in framing the *mechanism* of accountability. Sunni exegetes like Al-Razi emphasize individual responsibility, interpreting “seeing” as direct, unmediated confrontation with one’s deeds, reflecting Sunni theology’s focus on personal agency. In contrast, Shia commentaries, such as Al-Qummi’s, often contextualize this reckoning within the intercessory role of the Ahl al-Bayt, aligning with Shia doctrines of Imamah and divine mercy mediated through the Imams. Al-Tabatabai’s Al-Mizan further posits that deeds are ontologically “attached” to the soul, manifesting as intrinsic consequences—a view resonating with Shia philosophical traditions.  \n\nThese differences subtly influence religious practice: Sunni discourses often prioritize self-examination and individual repentance, while Shia teachings may integrate devotion to the Imams as a means of spiritual purification. Historically, such distinctions stem from early theological developments—Sunni exegesis crystallized alongside debates on predestination and free will, whereas Shia tafsir evolved within frameworks emphasizing the Imam’s guidance in understanding divine wisdom.  \n\nBoth traditions ultimately uphold the verse’s core message: a profound awareness of ethical responsibility rooted in Allah’s justice, while their interpretive variances reflect rich, complementary explorations of Quranic ontology.",
    "layer5_urdu": "شیعہ اور سنی روایات میں سورہ از زلزالا 8 کی تشریح الہامی انصاف پر مشترکہ زور کو ظاہر کرتی ہے جبکہ مذہبی نوادرات میں مبتلا ہیں۔ دونوں اسکولوں نے اتفاق کیا ہے کہ یہ آیت اللہ کے پیچیدہ احتساب کی تصدیق کرتی ہے ، جس میں یہاں تک کہ سب سے چھوٹا شیطان بھی فیصلے کے دن ظاہر ہوگا۔ التباری (سنی) اور التوسی (شیعہ) ایک ساتھ \"دیکھنے\" کے لفظی پڑھنے پر زور دیتے ہیں ، اور الہی حساب کتاب کی ناگزیر نوعیت کی نشاندہی کرتے ہیں۔ ابن کتھیر اور الاتبریسی دونوں اس کو کامل انصاف کے قرآنی اصول (جیسے ، 21:47) سے جوڑتے ہیں ، اور الہی نگرانی کے کسی بھی تصور کو مسترد کرتے ہیں ، یہ موقف المزان اور القوروبی کے کاموں میں گونجتا ہے۔  \n\nاحتساب کے * میکانزم * کو تیار کرنے میں تغیرات ابھرتے ہیں۔ سنی استثنیٰ جیسے العز نے انفرادی ذمہ داری پر زور دیا ہے ، اور \"دیکھنے\" کی ترجمانی کرتے ہوئے کسی کے اعمال کے ساتھ براہ راست ، غیر متنازعہ محاذ آرائی کی ترجمانی کی ہے ، جو ذاتی ایجنسی پر سنی الہیات کی توجہ کی عکاسی کرتی ہے۔ اس کے برعکس ، شیعہ تبصرے ، جیسے القومی ، اکثر اس حساب سے اے ایچ ایل البائٹ کے شفاعت کے کردار میں ، امامہ کے شیعہ عقائد اور الہامی رحمت کے ساتھ منسلک ہونے والے امام کے ذریعہ ثالثی کرتے ہیں۔ الاتعبطابئی کے المزان نے مزید کہا ہے کہ اعمال روح کے ساتھ غیر منطقی طور پر \"منسلک\" ہیں ، جو اندرونی نتائج کے طور پر ظاہر ہوتے ہیں۔  \n\nیہ اختلافات مذہبی رواج پر پوری طرح اثر انداز ہوتے ہیں: سنی گفتگو اکثر خود جانچ اور انفرادی توبہ کو ترجیح دیتی ہے ، جبکہ شیعہ تعلیمات روحانی تزکیہ کے ایک ذریعہ کے طور پر اماموں کے ساتھ عقیدت کو مربوط کرسکتی ہیں۔ تاریخی طور پر ، اس طرح کے امتیازات ابتدائی مذہبی پیشرفتوں سے پیدا ہوتے ہیں۔ سنی ایکجیسیس پیش گوئی اور آزادانہ مرضی کے بارے میں ہونے والی بحثوں کے ساتھ ساتھ کرسٹاللائزڈ ، جبکہ شیعہ طافس الہی حکمت کو سمجھنے میں امام کی رہنمائی پر زور دیتے ہوئے فریم ورک کے اندر تیار ہوئے۔  \n\nدونوں روایات بالآخر آیت کے بنیادی پیغام کو برقرار رکھتی ہیں: اللہ کے انصاف میں جڑے ہوئے اخلاقی ذمہ داری کے بارے میں گہری آگاہی ، جبکہ ان کی تشریحی تغیرات قرآنی آنٹولوجی کی بھرپور ، تکمیلی تفتیش کی عکاسی کرتی ہیں۔",
    "summary": "This verse, as Allama Tabatabai notes in Al-Mizan, this verse’s declaration — that even an atom’s weight of evil will be manifest — affirms God’s absolute knowledge and the ontological reality of human actions. The verse \"وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍۢ شَرًّۭا يَرَهُۥ\" from Surah Az-Zalzala (99:8) powerfully reinforces Islam’s core principle of divine justice. It declares that every person will witness even the smallest evil they committed, measured as \"mithqala dharratin\" (the weight of an atom). This phrase uses \"dharratin,\" a term for the tiniest particle, to stress that no deed—good or bad—is overlooked by Allah. Imam Ja’far al-Sadiq (peace be upon him) explained, *“The atom’s weight refers to the recognition (ma’rifah) of the Imam. This verse calls Muslims to ethical mindfulness."
  }
}