{
  "1": {
    "layer1": "In Surah Al-Maa’un, verse 1, Allah begins with a striking question: *“Ara’aytalladhi yukadhibu bid-deen?”* (Have you seen the one who denies the Recompense?). The term *ad-deen* here refers specifically to the Day of Judgment and divine accountability, a cornerstone of Islamic belief. Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, emphasizes that rejecting *ad-deen* is not merely theological disbelief but a moral failure with societal consequences. The verse critiques those who, by denying accountability in the Hereafter, become indifferent to ethical obligations, as seen in the following verses describing neglect of orphans and the poor.  \n\nHistorically, this verse is understood to address the hypocrisy of individuals in pre-Islamic Mecca who outwardly practiced rituals but oppressed the vulnerable. While some Sunni commentaries link it to specific figures like Abu Jahl, Shia interpretations often highlight its universal message: denial of divine justice corrupts both faith and action. The Arabic root *kadhib* (to lie/reject) underscores intentional falsehood, suggesting such denial is a conscious choice, not mere ignorance.  \n\nToday, this verse challenges Muslims to reflect on the sincerity of their belief in Allah’s justice. Denying *ad-deen* manifests in modern forms: prioritizing materialism over compassion, performing prayers without humility (*Surah Al-Maa’un, verse 5*), or ignoring societal duties. The Ahlul Bayt, particularly Imam Ali, taught that true faith in the Hereafter compels believers to uphold justice, care for the marginalized, and purify intentions in worship. For contemporary Muslims, this verse is a call to align actions with belief—ensuring charity, prayer, and social responsibility stem from genuine consciousness of divine accountability. It reminds us that faith without ethical practice is hollow, and denial of the Recompense erodes the moral fabric of both individual and community life.",
    "layer2": "In Surah Al-Maa’un (107:1), the verse *“Have you seen the one who denies the Recompense?”* serves as a profound indictment of those who reject the concept of divine accountability. Classical Shia exegetes, drawing from the teachings of the Ahlul Bayt, emphasize that *al-dīn* (the Recompense) here refers not merely to the Day of Judgment but to the entirety of divine justice and the moral-religious order established by God. Tabrisi, in *Majma al-Bayan*, explains that denial of *al-dīn* encompasses both theological rejection of the Hereafter and practical disregard for the ethical obligations of faith, such as care for the vulnerable—a theme expanded in subsequent verses. This duality reflects the Shia principle that belief (*iman*) and righteous action (*amal salih*) are inseparable; denial of one corrupts the other.\n\nTabatabai, in *Al-Mizan*, underscores that such denial stems from arrogance (*istikbar*) and moral desensitization, traits condemned by the Imams. The verse implicitly critiques hypocrisy: those who outwardly profess faith but inwardly negate divine justice, thereby undermining social responsibility. The Shia tradition, as narrated through Imam Jafar al-Sadiq, links this denial to the rejection of *wilayah* (divinely ordained leadership), as acknowledgment of the Hereafter is inseparable from submission to God’s chosen guides. Theologically, this verse reinforces the Shia understanding of *tawhid al-af’al* (unity of divine acts), where rejection of accountability fractures the believer’s recognition of God’s sovereignty over both creation and moral order.\n\nJurisprudentially, the verse’s condemnation of neglecting orphans and the poor (vv. 2-3) ties into Shia ethics, where social justice is a pillar of faith. Classical commentators thus interpret the verse holistically: denial of the Recompense manifests not only in theological deviation but in ethical failure, aligning with the Shia integration of creed, law, and spirituality.",
    "layer3": "Surah Al-Maa’un’s opening verse, *“Have you seen the one who denies the Recompense?”* challenges humanity’s moral compass by questioning the mindset of those who reject divine accountability. Contemporary Shia scholars, such as Ayatollah Naser Makarem Shirazi, emphasize that this verse transcends mere theological denial—it critiques a worldview devoid of ethical responsibility. In *Tafsir Nemuneh*, he links the “denial of Recompense” to modern apathy toward social justice, arguing that rejecting the afterlife’s moral framework erodes empathy and fuels exploitation.  \n\nModern science and philosophy echo this concern. Studies in moral psychology, like those by Jonathan Haidt, reveal that belief in accountability strengthens prosocial behavior. Conversely, nihilistic trends in secular societies—where life’s purpose is reduced to material gain—mirror the “denial” described in the verse. Socially, this manifests in systemic neglect: billionaires hoarding wealth while 800 million face hunger, or governments deprioritizing climate action despite existential threats. The verse’s warning resonates in these imbalances, urging a reconnection between faith and collective welfare.  \n\nInterfaith dialogues amplify this message. Pope Francis’s *Laudato Si’* parallels the Quranic call to stewardship, framing environmental neglect as a moral failure. Similarly, Buddhist teachings on karma align with the idea that actions ripple beyond the self. In multicultural societies, the verse invites reflection on shared ethical foundations: How do we build systems that honor human dignity without divine accountability as a motivator?  \n\nUltimately, Surah Al-Maa’un’s first verse is a timeless mirror. It asks us to confront the consequences of living without reverence for justice—a challenge as urgent today as it was in 7th-century Mecca. As Imam Ali taught, “People are either your brothers in faith or equals in humanity,” reminding us that denying accountability isn’t just theological—it’s a fracture in our shared human contract.",
    "layer4": "The verse’s piercing question, *“Have you seen the one who denies the Recompense?”* transcends mere intellectual rejection of the Hereafter. The Ahlul Bayt (peace be upon them) teach that denying *al-Dīn* (the Recompense) is not limited to doubting the Day of Judgment but signifies a deeper spiritual bankruptcy—a rejection of divine justice, the reality of accountability, and the eternal consequences of one’s actions. Imam Ali (peace be upon him) states in *Nahj al-Balagha*: *“The most wretched person is he who ignores the Hereafter and trades his eternal life for his transient world”* (Sermon 28). This verse, therefore, exposes the hypocrisy of those who claim faith but sever their actions from the consciousness of divine reckoning.  \n\nThe Sixth Imam, Ja’far al-Sadiq (peace be upon him), links this denial to a failure in recognizing *Wilayah* (divine guardianship). He explains: *“Whoever denies the Recompense has denied the Imam, for the Imam is the establisher of justice on the Day of Resurrection”* (*Bihar al-Anwar*). Here, the Imam ties belief in divine justice to acceptance of the *Imamah*—the spiritual and temporal authority of the Ahlul Bayt, who embody the living truth of Allah’s justice. To deny the Recompense is to reject the very purpose of creation: the manifestation of divine guidance through the *Muhammadan Light* and the Imams.  \n\nPractically, this verse calls believers to align their hearts and deeds with the reality of divine accountability. Lady Fatimah (peace be upon her) taught that *“faith is affirmed by the heart, spoken by the tongue, and enacted by the limbs”* (*Bihar al-Anwar*). Thus, true belief in the Recompense demands sincerity in worship, justice in dealings, and unwavering loyalty to the Ahlul Bayt. The one who neglects the orphan, withholds kindness, or prays without presence of heart (as described later in Surah al-Ma’un) reveals a soul detached from the essence of *Din*—a soul that has, in essence, denied the Recompense.  \n\nTo embody this verse’s wisdom, believers must nurture *taqwa* (God-consciousness) through daily reflection on the Hereafter, uphold the rights of others as acts of devotion, and anchor their spiritual journey in the love and obedience of the Ahlul Bayt, the guides to eternal truth.",
    "layer1_urdu": "سورہ المعون میں ، آیت 1 ، اللہ ایک حیرت انگیز سوال کے ساتھ شروع ہوتا ہے: * \"آرا’ aat ل الدھی یوکادیبو بولی ڈین؟ \" * (کیا آپ نے دیکھا ہے کہ جو بدلاؤ کی تردید کرتا ہے؟)۔ یہاں کی اصطلاح * ad-den * یہاں خاص طور پر فیصلے اور خدائی احتساب کے دن سے مراد ہے ، جو اسلامی عقیدے کا سنگ بنیاد ہے۔ شیعہ طافس ، جیسے الامہ تبتابائی کے *المزان *، پر زور دیتا ہے کہ *اشتہار *کو مسترد کرنا محض مذہبی کفر نہیں بلکہ معاشرتی نتائج کے ساتھ اخلاقی ناکامی ہے۔ آیت میں ان لوگوں پر تنقید کی گئی ہے جو ، اس کے بعد احتساب سے انکار کرکے اخلاقی ذمہ داریوں سے لاتعلق ہوجاتے ہیں ، جیسا کہ یتیموں اور غریبوں کی نظرانداز کرنے والی مندرجہ ذیل آیات میں دیکھا گیا ہے۔  \n\nتاریخی طور پر ، اس آیت کو اسلام سے قبل مکہ میں افراد کی منافقت سے نمٹنے کے لئے سمجھا جاتا ہے جنہوں نے ظاہری طور پر رسومات پر عمل کیا لیکن کمزوروں پر ظلم کیا۔ اگرچہ کچھ سنی تبصرے اسے ابو جہل جیسی مخصوص شخصیات سے جوڑتے ہیں ، لیکن شیعہ تشریحات اکثر اس کے آفاقی پیغام کو اجاگر کرتی ہیں: الہی انصاف سے انکار سے عقیدے اور عمل دونوں کو خراب کردیا جاتا ہے۔ عربی جڑ * کدھب * (جھوٹ/مسترد کرنے کے لئے) جان بوجھ کر جھوٹ کی نشاندہی کرتی ہے ، اس طرح کے انکار کی تجویز کرنا ایک شعوری انتخاب ہے ، محض لاعلمی نہیں۔  \n\nآج ، یہ آیت مسلمانوں کو چیلنج کرتی ہے کہ وہ اللہ کے انصاف پر ان کے اعتقاد کے اخلاص پر غور کرے۔ جدید شکلوں میں*اشتہاری**ظاہر ہونے سے انکار کرنا: ہمدردی پر مادیت کو ترجیح دینا ، عاجزی کے بغیر دعائیں کرنا (*سورہ المحون ، آیت 5*) ، یا معاشرتی فرائض کو نظرانداز کرنا۔ اہل بیت ، خاص طور پر امام علی ، نے یہ سکھایا کہ اس کے بعد حقیقی عقیدے مومنین کو انصاف کی حمایت کرنے ، پسماندگی کی دیکھ بھال کرنے اور عبادت میں ارادوں کو پاک کرنے پر مجبور کرنے پر مجبور کرتے ہیں۔ عصری مسلمانوں کے ل this ، یہ آیت عقیدے کے ساتھ کام کرنے کا مطالبہ ہے۔ یہ ہمیں یاد دلاتا ہے کہ اخلاقی عمل کے بغیر ایمان کھوکھلا ہے ، اور بدلے سے انکار انفرادی اور معاشرتی زندگی دونوں کے اخلاقی تانے بانے کو ختم کرتا ہے۔",
    "layer2_urdu": "سورہ المحون (107: 1) میں ، آیت * \"کیا آپ نے ایک ایسا شخص دیکھا ہے جو بدلہ لینے سے انکار کرتا ہے؟\" کلاسیکی شیعہ استثنیٰ ، اہل بیت کی تعلیمات سے ہٹتے ہوئے اس بات پر زور دیتے ہیں کہ * الدین * (بدلہ) یہاں محض فیصلے کے دن نہیں بلکہ خدائی انصاف کی پوری طرح اور خدا کے ذریعہ قائم اخلاقی مذہبی حکم سے مراد ہے۔ تبریسی ، *مجسما البیان *میں ، وضاحت کرتے ہیں کہ *الدون *کے انکار سے عقیدے کی اخلاقی ذمہ داریوں کے لئے اس کے اخلاقی ذمہ داریوں کے لئے اس کے بعد کے مذہبی رد jection عمل اور عملی طور پر نظرانداز کیا گیا ہے ، جیسے کمزوروں کی دیکھ بھال-اس کے بعد کی آیات میں توسیع کی گئی ہے۔ یہ دوہری شیعہ اصول کی عکاسی کرتی ہے کہ عقیدہ (*ایمان*) اور نیک عمل (*امل سالہ*) لازم و ملزوم ہیں۔ ایک سے انکار دوسرے کو خراب کرتا ہے۔\n\nتبتابائی ،*المزان*میں ، اس بات کی نشاندہی کرتی ہے کہ اس طرح کے انکار تکبر (*استک بار*) اور اخلاقی بے حرمتی سے پیدا ہوتا ہے ، اماموں کے ذریعہ مذمت کی جانے والی خصوصیات۔ آیت واضح طور پر منافقت پر تنقید کرتی ہے: وہ لوگ جو ظاہری طور پر عقیدے کا دعوی کرتے ہیں لیکن اندرونی طور پر الہی انصاف کی نفی کرتے ہیں ، اور اس طرح معاشرتی ذمہ داری کو نقصان پہنچاتے ہیں۔ شیعہ روایت ، جیسا کہ امام جعفر السادق کے ذریعہ بیان کیا گیا ہے ، اس انکار کو * ولیاہ * (خدائی طور پر مقرر قیادت) کے مسترد ہونے سے جوڑتا ہے ، کیونکہ اس کے بعد خدا کے منتخب کردہ رہنماؤں کو پیش کرنے سے لازم و ملزوم ہے۔ مذہبی طور پر ، یہ آیت * توحید الافال * (الہی کاموں کا اتحاد) کی شیعہ کی تفہیم کو تقویت دیتی ہے ، جہاں احتساب کو مسترد کرنے سے مومن کی تخلیق اور اخلاقی نظم و ضبط دونوں پر خدا کی خودمختاری کی پہچان ہوتی ہے۔\n\nفقہی طور پر ، آیت کی یتیموں اور غریبوں کو نظرانداز کرنے کی مذمت شیعہ اخلاقیات سے تعلق رکھتی ہے ، جہاں معاشرتی انصاف عقیدے کا ایک ستون ہے۔ کلاسیکی مبصرین اس طرح اس آیت کو مکمل طور پر تشریح کرتے ہیں: بدلاؤ سے انکار نہ صرف مذہبی انحراف میں بلکہ اخلاقی ناکامی میں بھی ظاہر ہوتا ہے ، جو عقیدہ ، قانون اور روحانیت کے شیعہ انضمام کے ساتھ صف بندی کرتا ہے۔",
    "layer3_urdu": "سورہ المعون کی افتتاحی آیت ، * \"کیا آپ نے ایک ایسا شخص دیکھا ہے جو بدلہ لینے سے انکار کرتا ہے؟\" * الہی احتساب کو مسترد کرنے والوں کی ذہنیت پر سوال اٹھاتے ہوئے انسانیت کے اخلاقی کمپاس کو چیلنج کرتا ہے۔ عصر حاضر کے شیعہ اسکالرز ، جیسے آیت اللہ ناصر مکارم شیرازی ، اس بات پر زور دیتے ہیں کہ یہ آیت محض مذہبی انکار سے ماورا ہے۔ *طافسیر نمونیہ *میں ، وہ معاشرتی انصاف کی طرف جدید بے حسی سے \"بدلہ دینے کے انکار\" کو جوڑتا ہے ، اور یہ استدلال کرتا ہے کہ بعد کی زندگی کے اخلاقی فریم ورک کو مسترد کرنے سے ہمدردی اور ایندھن کی وضاحت ختم ہوجاتی ہے۔  \n\nجدید سائنس اور فلسفہ اس تشویش کی بازگشت کرتے ہیں۔ اخلاقی نفسیات کے مطالعے ، جیسے جوناتھن ہیڈٹ کے ذریعہ ، یہ ظاہر کرتے ہیں کہ احتساب پر اعتقاد پیشہ ورانہ طرز عمل کو تقویت بخشتا ہے۔ اس کے برعکس ، سیکولر معاشروں میں غیر منطقی رجحانات - جہاں زندگی کا مقصد مادی فائدہ میں کم ہوجاتا ہے - آیت میں بیان کردہ \"انکار\" کو مرر۔ معاشرتی طور پر ، یہ نظامی نظرانداز میں ظاہر ہوتا ہے: ارب پتیوں نے دولت جمع کی ہے جبکہ 800 ملین بھوک کا سامنا کرنا پڑتا ہے ، یا حکومتوں کو وجودی خطرات کے باوجود آب و ہوا کی کارروائی کو مسترد کرتے ہیں۔ آیت کی انتباہ ان عدم توازن میں گونجتی ہے ، جس میں ایمان اور اجتماعی فلاح و بہبود کے مابین دوبارہ رابطہ قائم کیا گیا ہے۔  \n\nبین المذاہب مکالمے اس پیغام کو بڑھا دیتے ہیں۔ پوپ فرانسس کا * لوداتو سی ’ * قرآنی کال کو سودے بازی کے لئے متوازی کرتا ہے ، جس سے ماحولیاتی نظرانداز اخلاقی ناکامی کے طور پر ہوتا ہے۔ اسی طرح ، کرما پر بدھ مت کی تعلیمات اس خیال کے ساتھ منسلک ہیں کہ اعمال خود سے آگے بڑھتے ہیں۔ کثیر الثقافتی معاشروں میں ، آیت مشترکہ اخلاقی بنیادوں پر عکاسی کی دعوت دیتی ہے: ہم ایسے نظام کیسے بناتے ہیں جو ایک محرک کی حیثیت سے خدائی احتساب کے بغیر انسانی وقار کا احترام کرتے ہیں؟  \n\nآخر کار ، سورہ المعون کی پہلی آیت ایک لازوال آئینہ ہے۔ یہ ہم سے انصاف کے لئے عقیدت کے بغیر زندگی گزارنے کے نتائج کا مقابلہ کرنے کے لئے کہتا ہے۔ آج کل اتنا ہی چیلنج ہے جتنا یہ ساتویں صدی کے مکہ میں تھا۔ جیسا کہ امام علی نے سکھایا ، \"لوگ یا تو آپ کے بھائی ہیں یا انسانیت کے مساوی ہیں ،\" ہمیں یاد دلاتے ہیں کہ احتساب سے انکار کرنا محض مذہبی نہیں ہے - یہ ہمارے مشترکہ انسانی معاہدے میں ایک فریکچر ہے۔",
    "layer4_urdu": "آیت کا چھیدنے والا سوال ، * \"کیا آپ نے ایک ایسا شخص دیکھا ہے جو بدلہ لینے سے انکار کرتا ہے؟\" اہل بیت (ان پر امن ہے) یہ سکھاتا ہے کہ * الدون * (بدلہ دینے والا) انکار کرنا فیصلے کے دن پر شک کرنے تک ہی محدود نہیں ہے بلکہ ایک گہری روحانی دیوالیہ پن کی نشاندہی کرتا ہے۔ امام علی (اس پر امن ہے) *ناہج البالاگھا *میں بیان کرتا ہے: *\"سب سے زیادہ بدترین شخص وہ ہے جو اس کے بعد کو نظرانداز کرتا ہے اور اپنی عارضی دنیا کے لئے اپنی ابدی زندگی کا کاروبار کرتا ہے\" *(خطبہ 28)۔ لہذا ، یہ آیت ان لوگوں کی منافقت کو بے نقاب کرتی ہے جو عقیدے کا دعوی کرتے ہیں لیکن اپنے اعمال کو خدائی حساب کتاب کے شعور سے الگ کرتے ہیں۔  \n\nچھٹا امام ، جافر السادق (اس پر امن ہے) ، اس انکار کو * ولیہ * (خدائی سرپرستی) کو پہچاننے میں ناکامی سے جوڑتا ہے۔ وہ وضاحت کرتے ہیں:*\"جس نے بھی بدلہ لینے سے انکار کیا اس نے امام کی تردید کی ہے ، کیونکہ امام قیامت کے دن انصاف کا قیام ہے\"*(*بہار الانور*)۔ یہاں ، امام الہی انصاف پر اعتقاد کو *امامہ * - اہل بیت کے روحانی اور وقتی اختیار کی قبولیت سے جوڑتا ہے ، جو اللہ کے انصاف کی زندہ سچائی کو مجسم بناتا ہے۔ بدلہ دینے سے انکار کرنا تخلیق کے بہت ہی مقصد کو مسترد کرنا ہے: * محمدان لائٹ * اور اماموں کے ذریعہ الہی رہنمائی کا مظہر۔  \n\nعملی طور پر ، یہ آیت مومنوں کو الہی احتساب کی حقیقت کے ساتھ اپنے دلوں اور اعمال کو سیدھ میں لانے کا مطالبہ کرتی ہے۔ لیڈی فاطمہ (اس پر امن) نے سکھایا کہ*\"ایمان دل کے ذریعہ اس کی تصدیق کی جاتی ہے ، زبان سے بولی جاتی ہے ، اور اعضاء کے ذریعہ نافذ کیا جاتا ہے\"*(*بہار الانور*)۔ اس طرح ، بدلہ لینے پر حقیقی عقیدہ عبادت میں اخلاص ، معاملات میں انصاف ، اور اہل بیت کے ساتھ اٹل وفاداری کا مطالبہ کرتا ہے۔ وہ جو یتیم کو نظرانداز کرتا ہے ، مہربانی کو روکتا ہے ، یا دل کی موجودگی کے بغیر دعا کرتا ہے (جیسا کہ بعد میں سورہ المعون میں بیان کیا گیا ہے) ایک روح کو ظاہر کرتا ہے جو *ڈین *-ایک روح کے جوہر سے الگ ہوتا ہے جس نے جوہر میں ، اس نے بدلاؤ کی تردید کی ہے۔  \n\nاس آیت کی دانشمندی کو مجسم بنانے کے لئے ، مومنین کو لازمی طور پر * تقوا * (خدا کے شعور) کی پرورش کے ذریعہ روزانہ کی عکاسی کے ذریعے ، دوسروں کے حقوق کو عقیدت کی حیثیت سے برقرار رکھنا چاہئے ، اور ان کے روحانی سفر کو اہل بیت کی محبت اور اطاعت میں ، ابدی سچائی کی طرف گائوں کی محبت اور اطاعت میں لنگر انداز کرنا ہے۔",
    "layer5": "In interpreting Surah al-Maa'un verse 1, both Shia and Sunni exegetes broadly agree that the verse condemns those who reject divine accountability (al-dīn, understood here as the Day of Recompense). Classical sources across traditions, including Tabari’s *Jami al-Bayan* and Tabatabai’s *Al-Mizan*, emphasize that denial of eschatological judgment inherently leads to moral corruption, as evidenced by the surah’s subsequent verses detailing unethical behaviors. This consensus reflects a shared theological premise: belief in divine justice underpins ethical conduct.\n\nKey interpretive differences emerge in defining the \"denier.\" Shia commentaries like Tabrisi’s *Majma al-Bayan* and Qummi’s tafsir often contextualize the verse within the framework of *wilayah* (divinely guided leadership), suggesting that rejection of the Imams’ authority—as upholders of divine justice—constitutes an implicit denial of the Hereafter. Tusi’s *At-Tibyan* further links this denial to neglecting social obligations, particularly toward orphans and the poor, aligning with Shia emphasis on communal responsibility. Sunni scholars such as Ibn Kathir and Qurtubi, while acknowledging social ethics, focus more on individual faith, interpreting the denier as one who rejects resurrection doctrinally, irrespective of leadership loyalties. Razi’s *Mafatih al-Ghayb* frames this as a rational failure to acknowledge resurrection’s necessity, reflecting Sunni theological debates on proving the afterlife through reason.\n\nThese distinctions influence religious practice subtly: Shia interpretations reinforce communal ethics tied to the Imams’ teachings, while Sunni readings prioritize correct belief in resurrection as a pillar of faith. Historically, divergent emphases stem from Shia theological integration of leadership into cosmic justice and Sunni focus on individual creedal adherence post the formative debates on Islamic orthodoxy. Both traditions, however, unite in viewing the verse as a warning against spiritual hypocrisy manifesting as moral neglect.",
    "layer5_urdu": "سورہ المحون آیت 1 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی دونوں بڑے پیمانے پر اس بات پر متفق ہیں کہ اس آیت نے خدائی احتساب کو مسترد کرنے والوں کی مذمت کی ہے (الدین ، ​​یہاں بدلہ لینے کے دن کے طور پر سمجھا جاتا ہے)۔ روایات کے کلاسیکی ذرائع ، بشمول تباری کے *جامی البیان *اور تبتابائی کے *المزان *سمیت ، اس بات پر زور دیتے ہیں کہ اسکاٹولوجیکل فیصلے سے انکار فطری طور پر اخلاقی بدعنوانی کا باعث بنتا ہے ، جیسا کہ اس بات کا ثبوت سورت کی بعد کی آیات سے ہوتا ہے جس میں غیر اخلاقی طرز عمل کی تفصیل ہے۔ یہ اتفاق رائے مشترکہ مذہبی بنیاد کی عکاسی کرتا ہے: الہی انصاف پر اعتقاد اخلاقی طرز عمل کی حمایت کرتا ہے۔\n\nکلیدی تشریحی اختلافات \"انکار\" کی وضاحت میں ابھرتے ہیں۔ شیعہ تبصرے جیسے تبریسی کے * مجرو البیان * اور قمی کے طافس اکثر * ولیہ * (خدائی طور پر رہنمائی کی قیادت) کے فریم ورک کے اندر اس آیت کو سیاق و سباق دیتے ہیں ، جس سے یہ تجویز کیا جاتا ہے کہ اماموں کے اختیار کو مسترد کرنے کے طور پر الہی انصاف کے حامل افراد-حلقے کے حامل ہیں۔ توسی کا * ایٹ تبیان * اس انکار کو معاشرتی ذمہ داریوں کو نظرانداز کرنے سے ، خاص طور پر یتیموں اور غریبوں کی طرف ، فرقہ وارانہ ذمہ داری پر زور دینے کے ساتھ منسلک ہے۔ ابن کتھیر اور قربانی جیسے سنی اسکالرز ، جبکہ معاشرتی اخلاقیات کو تسلیم کرتے ہوئے ، انفرادی عقیدے پر زیادہ توجہ مرکوز کرتے ہیں ، اس سے انکار کرنے والے کی ترجمانی کرتے ہیں جو قائدانہ وفاداری سے قطع نظر ، قیامت کو نظریاتی طور پر مسترد کرتا ہے۔ ریزی کے * مافاتیہ الغیب * نے قیامت کی ضرورت کو تسلیم کرنے میں عقلی ناکامی کے طور پر اس کو فریم کیا ہے ، جو وجہ کے ذریعہ بعد کی زندگی کو ثابت کرنے پر سنی مذہبی مباحثے کی عکاسی کرتا ہے۔\n\nیہ امتیازات مذہبی رواج کو ٹھیک طرح سے متاثر کرتے ہیں: شیعہ تشریحات اماموں کی تعلیمات سے منسلک فرقہ وارانہ اخلاقیات کو تقویت دیتی ہیں ، جبکہ سنی ریڈنگ عقیدے کے ستون کے طور پر قیامت کے صحیح اعتقاد کو ترجیح دیتی ہے۔ تاریخی طور پر ، قیادت کے مذہبی انضمام سے کائناتی انصاف میں انضمام اور سنی کے انفرادی طور پر انفرادی عقیدہ کی پابندی پر توجہ مرکوز کرنے کے بعد اسلامی آرتھوڈوکس کے بارے میں ابتدائی بحث و مباحثے پر زور دیتا ہے۔ تاہم ، دونوں روایات آیت کو روحانی منافقت کے خلاف انتباہ کے طور پر دیکھنے میں متحد ہوجاتی ہیں جو اخلاقی نظرانداز کے طور پر ظاہر ہوتی ہیں۔",
    "layer2short": "In Surah Al-Maa’un (107:1), the verse *“Have you seen the one who denies the Recompense?”* serves as a profound indictment of those who reject the concept of divine accountability. Classical Shia exegetes, drawing from the teachings of the Ahlul Bayt, emphasize that *al-dīn* (the Recompense) here refers not merely to the Day of Judgment but to the entirety of divine justice and the moral-religious order established by God. Tabrisi, in *Majma al-Bayan*, explains that denial of *al-dīn* encompasses both theological rejection of the Hereafter and practical disregard for the ethical obligations of faith, such as care for the vulnerable—a theme expanded in subsequent verses. This duality reflects the Shia principle that belief (*iman*) and righteous action (*amal salih*) are inseparable; denial of one corrupts the other.",
    "layer2short_urdu": "سورہ المحون (107: 1) میں ، آیت * \"کیا آپ نے ایک ایسا شخص دیکھا ہے جو بدلہ لینے سے انکار کرتا ہے؟\" کلاسیکی شیعہ استثنیٰ ، اہل بیت کی تعلیمات سے ہٹتے ہوئے اس بات پر زور دیتے ہیں کہ * الدین * (بدلہ) یہاں محض فیصلے کے دن نہیں بلکہ خدائی انصاف کی پوری طرح اور خدا کے ذریعہ قائم اخلاقی مذہبی حکم سے مراد ہے۔ تبریسی ، *مجسما البیان *میں ، وضاحت کرتے ہیں کہ *الدون *کے انکار سے عقیدے کی اخلاقی ذمہ داریوں کے لئے اس کے اخلاقی ذمہ داریوں کے لئے اس کے بعد کے مذہبی رد jection عمل اور عملی طور پر نظرانداز کیا گیا ہے ، جیسے کمزوروں کی دیکھ بھال-اس کے بعد کی آیات میں توسیع کی گئی ہے۔ یہ دوہری شیعہ اصول کی عکاسی کرتی ہے کہ عقیدہ (*ایمان*) اور نیک عمل (*امل سالہ*) لازم و ملزوم ہیں۔ ایک سے انکار دوسرے کو خراب کرتا ہے۔"
  },
  "2": {
    "layer1": "In Surah Al-Maa’un, verse 2, Allah says: *فَذَٰلِكَ ٱلَّذِى يَدُعُّ ٱلْيَتِيمَ* (\"For that is the one who drives away the orphan\"). This verse condemns those who mistreat orphans, a grave moral failing that reflects a deeper spiritual emptiness. The term *yaduʿʿu* (يَدُعُّ) comes from the root *daʿʿa*, meaning to push away harshly or reject with cruelty. It implies not just neglect but active mistreatment of the vulnerable. *Alyateem* (ٱلْيَتِيمَ), the orphan, symbolizes society’s most defenseless members, whom Islam elevates as a test of communal faith and compassion. Historically, this verse is linked to pre-Islamic Meccan society, where powerful tribes often exploited orphans by seizing their inheritance or denying their rights—a practice the Quran sought to eradicate. The verse serves as a rebuke to those who, despite claiming faith, perpetuate such injustice.\n\nIn Shia tafsir, scholars like Allama Tabatabai emphasize that rejecting the orphan violates the Quranic mandate to uphold justice and mercy, core principles embodied by the Ahlul Bayt. Imam Ali (AS) famously said, \"God tests His servants by their treatment of the weak,\" underscoring that care for orphans is a measure of true faith. Today, this verse calls Muslims to actively protect orphans through financial support, emotional care, and advocacy—whether by donating to orphanages, fostering children, or ensuring their rights in legal systems. It also challenges us to examine how societal structures or personal attitudes might \"push away\" the vulnerable through indifference or systemic neglect. By embodying the Quran’s compassion, Muslims fulfill the legacy of the Prophet (PBUH) and his family, who made guardianship of the marginalized a pillar of Islamic ethics.",
    "layer2": "In classical Shia exegesis, Surah al-Maa'un verse 2 (\"For that is the one who drives away the orphan\") is interpreted as a profound condemnation of moral and spiritual corruption, particularly the rejection of social responsibilities central to Islamic ethics. Both Tabrisi in *Majma al-Bayan* and Tabatabai in *Al-Mizan* emphasize that the verse exposes the hypocrisy of those who outwardly perform rituals while neglecting core obligations toward vulnerable members of society. The term *yadu'u* (\"drives away\") is understood to encompass both physical mistreatment of orphans and the denial of their rights to care, compassion, and material support—a grave violation of Quranic injunctions (e.g., 2:83, 4:36) and the Prophetic tradition.\n\nTabrisi notes that the verse’s placement after the condemnation of neglecting prayer (v. 1) underscores the inseparability of worship and social justice in Islam. Tabatabai expands this, arguing that mistreating orphans reveals a fundamental disconnect from divine mercy, as the Quran repeatedly links reverence for God to protecting the vulnerable (93:9). Shia commentators uniquely tie this ethic to the legacy of the Ahlul Bayt, citing Imam Jafar al-Sadiq’s teachings that \"the best house among Muslims is one where an orphan is honored\" (*al-Kafi*). The verse thus becomes a litmus test for sincerity in faith: true belief necessitates upholding the rights of the dispossessed, a principle enshrined in Shia jurisprudence through obligations like *zakat* and *khums*, which prioritize support for orphans.\n\nTheologically, Shia scholars interpret the verse as a rejection of *istikbar* (arrogance)—a spiritual disease that leads to oppression. By linking the abuse of orphans to the rejection of divine guidance (v. 1-3), the verse implicitly affirms the Shia doctrine that moral and social justice are inseparable from the guardianship (*wilaya*) of the Ahlul Bayt, who embody divine compassion. This aligns with the broader Shia worldview, where ethical conduct toward creation is a manifestation of devotion to the Divine.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Maa’un 107:2 is widely interpreted as a condemnation of systemic neglect toward society’s most vulnerable, particularly orphans. Modern scholars like Sayyid Kamal al-Haydari emphasize that the verse transcends literal \"driving away\" of orphans to critique structural indifference—whether through exploitative economic systems, bureaucratic neglect, or cultural stigmatization. Ayatollah Naser Makarem Shirazi’s *Tafsir Nemuneh* links this verse to the Quran’s broader ethos of social justice, arguing that rejecting the orphan symbolizes a failure to uphold the *wilaya* (divinely mandated guardianship) over the marginalized, a core Shia ethical principle rooted in the teachings of Imam Ali, who famously prioritized the rights of orphans.\n\nPsychologically, studies on childhood trauma (e.g., research by Dr. Bruce Perry) reveal how abandonment exacerbates cycles of poverty and violence, aligning with the Quranic warning that societal cruelty breeds collective moral decay. Philosophically, the verse challenges neoliberal individualism, urging communal responsibility—a theme echoed in Pope Francis’ critiques of \"globalized indifference\" and Buddhist teachings on compassion.  \n\nToday, the verse resonates amid crises like the displacement of Ukrainian and Syrian orphans, or the 2.7 million orphaned by COVID-19 globally. It calls Muslims to advocate for equitable foster-care policies, challenge discriminatory inheritance laws, and support NGOs like the Al-Imam Foundation, which integrates Islamic ethics with modern social work. Interfaith collaborations, such as Shia-Sunni orphan initiatives in Lebanon, demonstrate how shared values can bridge sectarian divides. Ultimately, the verse is a timeless mandate: to dismantle systems that \"drive away\" the vulnerable and rebuild societies where no child is excluded.",
    "layer4": "In the luminous teachings of the Ahlul Bayt (peace be upon them), the Quranic condemnation of \"the one who drives away the orphan\" (107:2) transcends mere physical rejection, unveiling profound spiritual bankruptcy and a rupture in divine connection. Imam Ali (as) taught that *\"The orphan is not merely one whose father has died; an orphan is any soul deprived of the light of guidance.\"* This expands the verse's scope to include those denied spiritual kinship through the neglect of their guardians in faith.  \n\nThe 6th Imam, Ja'far al-Sadiq (as), links this verse to the rejection of *Wilayah* (divine guardianship), stating: *\"He who turns away the orphan from his right has turned away from the love of the Commander of the Faithful [Ali], for Ali is the father of every believing orphan.\"* Here, the Imam connects material cruelty to the deeper crime of abandoning the spiritual patronage of the Ahlul Bayt, who are the protectors and guides for all seekers of truth.  \n\nLady Fatimah (sa), the mother of orphans, embodied the antidote to this spiritual disease. Her nightly visits to graveyards to pray for deceased believers, and her tireless care for fatherless children despite her own poverty, exemplify how nurturing orphans – both physically and spiritually – is an act of *tawassul* (intercession) that polishes the soul.  \n\nPractical guidance emerges: To \"drive away the orphan\" includes dismissing the vulnerable seekers of truth who approach us with spiritual questions, or failing to nurture the \"orphaned\" aspects of our own souls starved of divine knowledge. The Imams teach that serving orphans – whether through material aid, emotional support, or guiding souls to the door of the Ahlul Bayt – becomes a mirror of our recognition of the Imam of our time (Imam Mahdi), the ultimate Guardian of humanity's orphaned consciousness.  \n\nAs we recite this verse, let it awaken us to become channels of the Ahlul Bayt's mercy, remembering Imam Zayn al-Abidin's (as) counsel: *\"Your hand is the hand of Allah extended over His creation – let no orphan find it closed.",
    "layer1_urdu": "سورہ المحون میں ، آیت 2 میں ، اللہ کہتے ہیں: * ف ف ف ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ذ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ ٱ. یہ آیت ان لوگوں کی مذمت کرتی ہے جو یتیموں کے ساتھ بدسلوکی کرتے ہیں ، یہ ایک سنگین اخلاقی ناکامی ہے جو گہری روحانی خالی پن کی عکاسی کرتی ہے۔ اصطلاح *یادوؤ *(یعنی ُ ُّ) جڑ *داؤ *سے سامنے آئی ہے ، جس کا مطلب ہے کہ سختی سے دور ہونا یا ظلم کے ساتھ مسترد کرنا۔ اس کا مطلب صرف نظرانداز ہی نہیں بلکہ کمزوروں کے ساتھ فعال بد سلوکی ہے۔ یتیم ، یتیم ، معاشرے کے انتہائی بے دفاع ممبروں کی علامت ہے ، جسے اسلام فرقہ وارانہ عقیدے اور ہمدردی کے امتحان کے طور پر بلند کرتا ہے۔ تاریخی طور پر ، یہ آیت اسلام سے پہلے کے میکن معاشرے سے منسلک ہے ، جہاں طاقتور قبائل اکثر اپنی وراثت پر قبضہ کرکے یا ان کے حقوق سے انکار کرکے یتیموں کا استحصال کرتے تھے۔ یہ آیت ان لوگوں کے لئے سرزنش کا کام کرتی ہے جو ایمان کے دعوے کے باوجود ، اس طرح کی ناانصافی کو برقرار رکھتے ہیں۔\n\nشیعہ طافسیر میں ، علامہ تبتابائی جیسے اسکالرز اس بات پر زور دیتے ہیں کہ یتیم کو مسترد کرنے سے انصاف اور رحمت کو برقرار رکھنے کے قرآنی مینڈیٹ کی خلاف ورزی ہوتی ہے۔ امام علی (ع) نے مشہور طور پر کہا ، \"خدا اپنے خادموں کو کمزوروں کے ساتھ سلوک کرکے جانچتا ہے ،\" اس بات کی نشاندہی کرنا کہ یتیموں کی دیکھ بھال سچے عقیدے کا ایک پیمانہ ہے۔ آج ، یہ آیت مسلمانوں کو مالی مدد ، جذباتی نگہداشت ، اور وکالت کے ذریعہ یتیموں کو فعال طور پر تحفظ فراہم کرنے کا مطالبہ کرتی ہے - چاہے یتیم خانوں کو عطیہ کرکے ، بچوں کو فروغ دے کر ، یا قانونی نظاموں میں ان کے حقوق کو یقینی بنائے۔ اس سے ہمیں یہ بھی چیلنج کیا جاتا ہے کہ معاشرتی ڈھانچے یا ذاتی رویوں سے بے حسی یا نظامی نظرانداز کے ذریعے کمزوروں کو کس طرح \"دور\" کیا جاسکتا ہے۔ قرآن کی شفقت کو مجسم بناتے ہوئے ، مسلمان نبی صلی اللہ علیہ وآلہ وسلم اور اس کے اہل خانہ کی میراث کو پورا کرتے ہیں ، جنہوں نے پسماندہ اسلامی اخلاقیات کے ایک ستون کی سرپرستی کی۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ المحون آیت 2 (\"اس کے لئے وہ ہے جو یتیم کو دور کرتا ہے\") اخلاقی اور روحانی بدعنوانی کی گہری مذمت کے طور پر سمجھا جاتا ہے ، خاص طور پر اسلامی اخلاقیات کے مرکزی معاشرتی ذمہ داریوں کو مسترد کرنا۔ * ال میزان * میں * مجسما البیان * اور تبتابائی میں تبریسی نے اس بات پر زور دیا ہے کہ اس آیت میں معاشرے کے کمزور ممبروں کے لئے بنیادی ذمہ داریوں کو نظرانداز کرتے ہوئے ظاہری طور پر رسومات انجام دینے والوں کی منافقت کو بے نقاب کیا گیا ہے۔ اصطلاح * یادو * (\"ڈرائیو آف\") یتیموں کی جسمانی بدسلوکی اور دیکھ بھال ، شفقت ، اور مادی مدد کے ان کے حقوق سے انکار - قرآنی احکامات (جیسے ، 2:83 ، 4:36) اور پیشن گوئی کی روایت سے انکار دونوں کے لئے سمجھا جاتا ہے۔\n\nتبریسی نے نوٹ کیا ہے کہ نماز کو نظرانداز کرنے کی مذمت کے بعد اس آیت کی جگہ کا تعین (بمقابلہ 1) اسلام میں عبادت اور معاشرتی انصاف کی لازم و ملزوم کی نشاندہی کرتا ہے۔ تبتابائی نے اس میں توسیع کرتے ہوئے یہ استدلال کیا ہے کہ یتیموں کے ساتھ بدسلوکی کرنے سے خدائی رحمت سے ایک بنیادی منقطع ہونے کا پتہ چلتا ہے ، کیونکہ قرآن مجید بار بار خدا کے لئے کمزوروں کو کمزور کرنے کی حفاظت کے لئے مربوط کرتا ہے (93: 9)۔ شیعہ کے مبصرین نے اس اخلاقیات کو اس اخلاقیات کو اہل بیت کی وراثت سے باندھ دیا ، جس میں امام جعفر السادق کی تعلیمات کا حوالہ دیا گیا ہے کہ \"مسلمانوں میں سب سے بہترین مکان وہ ہے جہاں یتیم کو اعزاز سے نوازا جاتا ہے\" (*الکفی*)۔ اس طرح یہ آیت عقیدے میں اخلاص کے لئے ایک لیٹمس امتحان بن جاتی ہے: حقیقی عقیدے کو بے دخل ہونے والے حقوق کو برقرار رکھنے کی ضرورت ہوتی ہے ، جو ایک اصول کو *زکو at ن *اور *خمس *جیسی ذمہ داریوں کے ذریعہ شیعہ فقہ میں شامل کیا جاتا ہے ، جو یتیموں کی حمایت کو ترجیح دیتا ہے۔\n\nمذہبی طور پر ، شیعہ اسکالرز اس آیت کو * استک بار * (تکبر) کے مسترد ہونے کے طور پر تشریح کرتے ہیں۔ یہ ایک روحانی بیماری ہے جو ظلم کا باعث بنتی ہے۔ یتیموں کے غلط استعمال کو الہی رہنمائی (بمقابلہ 1-3) کے مسترد کرنے سے جوڑ کر ، آیت شیعہ کے نظریے کی واضح طور پر اس بات کی تصدیق کرتی ہے کہ اخلاقی اور معاشرتی انصاف اہل بیت کی سرپرستی (*ولیا*) سے لازم و ملزوم ہیں ، جو الہی ہمدردی کا مظاہرہ کرتے ہیں۔ یہ وسیع تر شیعہ ورلڈ ویو کے ساتھ ہم آہنگ ہے ، جہاں تخلیق کے بارے میں اخلاقی طرز عمل الہی کے ساتھ عقیدت کا مظہر ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ المعون 107: 2 کو بڑے پیمانے پر معاشرے کے سب سے زیادہ کمزور ، خاص طور پر یتیموں کی طرف نظامی نظرانداز کی مذمت کے طور پر سمجھا جاتا ہے۔ سید کمال الحیداری جیسے جدید اسکالرز اس بات پر زور دیتے ہیں کہ آیت یتیموں کے لفظی \"ڈرائیونگ\" سے آگے بڑھ جاتی ہے تاکہ ساختی بے حسی پر تنقید کی جاسکے-چاہے استحصالی معاشی نظام ، بیوروکریٹک نظرانداز ، یا ثقافتی بدنامی کے ذریعے۔ آیت اللہ ناصر مکارم شیرازی کی * طافسیر نمونیہ * اس آیت کو قرآن مجید کے معاشرتی انصاف کے وسیع تر اخلاق سے جوڑتی ہے ، اور یہ استدلال کرتے ہیں کہ یتیم کو مسترد کرنے سے * ویلییا * (الہامی طور پر لازمی سرپرستی) کی وجہ سے ، جو ایک بنیادی شیعہ اخلاقی اصول ہے۔\n\nنفسیاتی طور پر ، بچپن کے صدمے سے متعلق مطالعات (جیسے ، ڈاکٹر بروس پیری کی تحقیق) سے یہ ظاہر ہوتا ہے کہ کس طرح ترک کرنا قرآنی انتباہ کے ساتھ مل کر غربت اور تشدد کے چکروں کو بڑھاتا ہے کہ معاشرتی ظلم و ستم کے اخلاقی زوال کو پالتا ہے۔ فلسفیانہ طور پر ، آیت نوآبادیاتی انفرادیت کو چیلنج کرتی ہے ، اور فرقہ وارانہ ذمہ داری پر زور دیتی ہے۔ یہ ایک موضوع پوپ فرانسس میں \"عالمی سطح پر بے حسی\" اور بدھ مت کی تعلیمات کے ہمدردی کے تنقیدوں کی گونج ہے۔  \n\nآج ، آیت یوکرائن اور شامی یتیموں کی نقل مکانی جیسے بحرانوں کے درمیان گونجتی ہے ، یا عالمی سطح پر کوویڈ 19 کے ذریعہ یتیم 2.7 ملین۔ اس نے مسلمانوں کو مساوی رضاعی دیکھ بھال کی پالیسیوں کی وکالت کرنے ، امتیازی وراثت کے قوانین کو چیلنج کرنے ، اور الیمم فاؤنڈیشن جیسی این جی اوز کی حمایت کرنے کا مطالبہ کیا ہے ، جو اسلامی اخلاقیات کو جدید معاشرتی کام کے ساتھ مربوط کرتا ہے۔ لبنان میں شیعہ سنی یتیم اقدامات جیسے بین المذاہب تعاون سے یہ ظاہر ہوتا ہے کہ مشترکہ اقدار فرقہ وارانہ تقسیم کو کس طرح ختم کرسکتی ہیں۔ بالآخر ، آیت ایک لازوال مینڈیٹ ہے: ایسے نظاموں کو ختم کرنا جو کمزور اور دوبارہ تعمیر کرنے والے معاشروں کو \"بھاگتے ہیں\" جہاں کسی بچے کو خارج نہیں کیا جاتا ہے۔",
    "layer4_urdu": "احلول بیت (ان پر امن) کی برائٹ تعلیمات میں ، \"یتیم کو دور کرنے والے\" کی قرآنی مذمت (107: 2) محض جسمانی رد jection کو عبور کرتی ہے ، گہری روحانی دیوالیہ پن اور الہی تعلق میں پھٹ جانے کی نقاب کشائی کرتی ہے۔ امام علی (ع) نے سکھایا کہ * \"یتیم محض وہ نہیں جس کا باپ مر گیا ہے۔ یتیم کوئی بھی روح ہے جو رہنمائی کی روشنی سے محروم ہے۔\"  \n\nچھٹا امام ، جافر السادق (ع) ، اس آیت کو * ولیہ * (خدائی سرپرستی) کے مسترد ہونے سے جوڑتا ہے ، جس میں کہا گیا ہے کہ: \"جو یتیم کو اپنے دائیں سے ہٹاتا ہے وہ اس کے حق سے ہوشیار [علی] کے کمانڈر کی محبت سے ہٹ گیا ہے ، کیونکہ علی ہر ماننے والے یتیم کا باپ ہے۔ اہل بیت کے ، جو سچائی کے تمام متلاشیوں کے لئے محافظ اور رہنمائی ہیں۔  \n\nیتیموں کی ماں لیڈی فاطمہ (ایس اے) نے اس روحانی بیماری کے تریاق کو مجسم کردیا۔ اس کی رات کے دوران قبرستانوں کا دورہ کرنے کے لئے مردہ مومنین کے لئے دعا کرنے کے لئے ، اور اس کی اپنی غربت کے باوجود یتیم بچوں کی انتھک نگہداشت ، اس بات کی مثال دیتی ہے کہ یتیموں کی پرورش کس طرح - جسمانی اور روحانی طور پر - * تواسول * (شفاعت) کا ایک عمل ہے جو روح کو پالش کرتی ہے۔  \n\nعملی رہنمائی ابھرتی ہے: \"یتیم کو دور کرنے\" میں سچائی کے کمزور متلاشیوں کو مسترد کرنا بھی شامل ہے جو روحانی سوالات کے ساتھ ہم سے رجوع کرتے ہیں ، یا ہماری اپنی جانوں کے \"یتیم\" پہلوؤں کی پرورش میں ناکام ہوجاتے ہیں جو الہی علم سے بھوکے مر جاتے ہیں۔ امام سکھاتے ہیں کہ یتیموں کی خدمت کرنا - چاہے وہ مادی امداد ، جذباتی مدد ، یا روحوں کو اہل بیت کے دروازے تک رہنمائی کرنا - ہمارے وقت کے امام (امام مہدی) کے ہمارے پہچان کا آئینہ بن جاتا ہے ، جو انسانیت کے یتیم شعور کے حتمی سرپرست ہیں۔  \n\nجیسا کہ ہم اس آیت کی تلاوت کرتے ہیں ، اس سے ہمیں آھلول بیت کی رحمت کے چینلز بننے کے لئے بیدار ہونے دیں ، امام زین العبدین (ع) کے مشورے کو یاد کرتے ہوئے: \"آپ کا ہاتھ اللہ کا ہاتھ ہے جو اس کی تخلیق پر پھیلا ہوا ہے-کوئی یتیم اسے بند نہ ہونے دیں۔",
    "layer5": "In examining Surah Al-Maa'un (107:2), both Shia and Sunni scholarly traditions converge on the verse’s core ethical message: a condemnation of those who neglect social responsibilities while engaging in ritual acts. Al-Tabari (Sunni) and Al-Tusi (Shia) alike emphasize that mistreating orphans constitutes a grave moral failing, reflecting insincerity in faith. Ibn Kathir and Al-Tabrisi both contextualize this within the Quran’s broader critique of hollow religiosity, linking the verse to hypocrisy in worship (Quran 107:4–6). The Qurtubi and Al-Qummi further agree that the verse underscores Islam’s emphasis on social justice, with Al-Qummi citing Imam Ja‘far al-Sadiq’s narration equating oppressing orphans with rejecting divine authority.\n\nDivergences emerge in theological framing. Shia exegetes like Tabatabai (Al-Mizan) and Tabrisi (Majma al-Bayan) often interpret “driving away the orphan” as symbolic of rejecting the guardianship (wilayah) of the Ahl al-Bayt, tying the verse to the moral consequences of disregarding divinely appointed leadership. This reflects the Shia emphasis on Imamah as the foundation of societal justice. Conversely, Sunni commentators like Al-Razi (Mafatih al-Ghayb) and Ibn Kathir focus on individual moral accountability, interpreting the act as a manifestation of personal hardheartedness and neglect of zakat obligations, rooted in Sunni prioritization of individual piety and adherence to ritual-ethical balance.\n\nThese differences influence religious practice thematically: Shia discourse often connects orphan care to communal responsibility under marja‘iyya (religious authority), while Sunni teachings emphasize individual charity as a pillar of sincere faith. Historically, Shia interpretations arose within contexts of political marginalization, reinforcing the Imam’s role as a social protector, whereas Sunni exegesis developed alongside efforts to harmonize Quranic ethics with state governance. Both traditions, however, uphold the verse’s timeless call to integrate worship with active compassion.",
    "layer5_urdu": "سورہ المعون (107: 2) کی جانچ پڑتال کرتے ہوئے ، شیعہ اور سنی علمی روایات آیت کے بنیادی اخلاقی پیغام پر ایک دوسرے کے ساتھ مل جاتی ہیں: رسمی کارروائیوں میں ملوث ہونے کے دوران معاشرتی ذمہ داریوں کو نظرانداز کرنے والوں کی مذمت۔ التباری (سنی) اور التوسی (شیعہ) یکساں طور پر اس بات پر زور دیتے ہیں کہ یتیموں کے ساتھ بد سلوکی کرنا ایک سنگین اخلاقی ناکامی کا باعث ہے ، جو عقیدے میں بےچینی کی عکاسی کرتا ہے۔ ابن کتھیر اور الاترسی دونوں ہی اس کو کھوکھلی مذہب کے قرآن مجید کے وسیع تر نقاد کے اندر سیاق و سباق دیتے ہیں ، اور اس آیت کو عبادت میں منافقت سے جوڑتے ہیں (قرآن 107: 4–6)۔ قربانی اور القمی نے مزید اتفاق کیا ہے کہ اس آیت میں معاشرتی انصاف پر اسلام کے زور کی نشاندہی کی گئی ہے ، اس کے ساتھ ہی القومی نے امام جافر السادق کی داستان کا حوالہ دیا ہے جس میں ظلم کرنے والے یتیموں کو الہی اتھارٹی کو مسترد کرنے کے ساتھ مساوی کیا گیا ہے۔\n\nمذہبی ڈھانچے میں انحرافات ابھرتے ہیں۔ شیعہ نے تبتابائی (المزان) اور تبریسی (ماجما البیان) جیسے \"یتیم کو دور کرنے\" کی ترجمانی کی طرح اے ایچ ایل ال بیت کی سرپرستی (ولیہ) کو مسترد کرنے کی علامت قرار دیتے ہیں ، اور اس بات کو الہامی طور پر مقرر کردہ الہامی قیادت کو نظرانداز کرنے کے اخلاقی نتائج سے باندھتے ہیں۔ یہ معاشرتی انصاف کی بنیاد کے طور پر امامہ پر شیعہ پر زور دینے کی عکاسی کرتا ہے۔ اس کے برعکس ، سنی مفسرین جیسے الراجی (مافاتیہ الغیب) اور ابن کتھیر انفرادی اخلاقی احتساب پر توجہ مرکوز کرتے ہیں ، اور اس فعل کی ترجمانی کرتے ہیں کہ وہ ذاتی سخت دشمنی اور زکوئٹ کی ذمہ داریوں کو نظرانداز کرتے ہیں ، انفرادی تقویت کی سنی ترجیح اور رسمی طور پر توازن کی پابندی میں ہے۔\n\nیہ اختلافات مذہبی رواج کو موضوعی طور پر متاثر کرتے ہیں: شیعہ گفتگو اکثر یتیم کی دیکھ بھال کو مارجایا (مذہبی اتھارٹی) کے تحت فرقہ وارانہ ذمہ داری سے جوڑتی ہے ، جبکہ سنی تعلیمات انفرادی خیرات پر مخلص عقیدے کے ستون کے طور پر زور دیتے ہیں۔ تاریخی طور پر ، شیعہ تشریحات سیاسی پسماندگی کے سیاق و سباق کے اندر پیدا ہوئی ، جس سے ایک معاشرتی محافظ کی حیثیت سے امام کے کردار کو تقویت ملی ، جبکہ سنی استثنیٰ نے قرآنی اخلاقیات کو ریاستی حکمرانی کے ساتھ ہم آہنگ کرنے کی کوششوں کے ساتھ ساتھ تیار کیا۔ تاہم ، دونوں روایات ، عبادت کو فعال ہمدردی کے ساتھ مربوط کرنے کے لئے آیت کی لازوال کال کو برقرار رکھتی ہیں۔",
    "layer2short": "In classical Shia exegesis, Surah al-Maa'un verse 2 (\"For that is the one who drives away the orphan\") is interpreted as a profound condemnation of moral and spiritual corruption, particularly the rejection of social responsibilities central to Islamic ethics. Both Tabrisi in *Majma al-Bayan* and Tabatabai in *Al-Mizan* emphasize that the verse exposes the hypocrisy of those who outwardly perform rituals while neglecting core obligations toward vulnerable members of society. The term *yadu'u* (\"drives away\") is understood to encompass both physical mistreatment of orphans and the denial of their rights to care, compassion, and material support—a grave violation of Quranic injunctions (e.g., 2:83, 4:36) and the Prophetic tradition.",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ المحون آیت 2 (\"اس کے لئے وہ ہے جو یتیم کو دور کرتا ہے\") اخلاقی اور روحانی بدعنوانی کی گہری مذمت کے طور پر سمجھا جاتا ہے ، خاص طور پر اسلامی اخلاقیات کے مرکزی معاشرتی ذمہ داریوں کو مسترد کرنا۔ * ال میزان * میں * مجسما البیان * اور تبتابائی میں تبریسی نے اس بات پر زور دیا ہے کہ اس آیت میں معاشرے کے کمزور ممبروں کے لئے بنیادی ذمہ داریوں کو نظرانداز کرتے ہوئے ظاہری طور پر رسومات انجام دینے والوں کی منافقت کو بے نقاب کیا گیا ہے۔ اصطلاح * یادو * (\"ڈرائیو آف\") یتیموں کی جسمانی بدسلوکی اور دیکھ بھال ، شفقت ، اور مادی مدد کے ان کے حقوق سے انکار - قرآنی احکامات (جیسے ، 2:83 ، 4:36) اور پیشن گوئی کی روایت سے انکار دونوں کے لئے سمجھا جاتا ہے۔"
  },
  "3": {
    "layer1": "In Surah Al-Maa'un, verse 3 condemns those who neglect the fundamental duty of caring for society’s vulnerable, declaring: *\"And does not encourage the feeding of the poor\" (wa la yahuddu ala ta’am al-miskeen)*. This verse, revealed in Mecca, critiques the hypocrisy of individuals who outwardly perform rituals like prayer (as mentioned in preceding verses) but disregard the ethical and social responsibilities central to faith. Historical accounts note that this rebuke targeted wealthy Meccan elites who rejected Islam’s message of social justice, refusing to support the poor—many of whom were early Muslims marginalized by Quraysh leaders.  \n\nThe term *yahuddu* (encourage) emphasizes proactive advocacy, urging believers not only to give charity personally but to inspire collective action. *Miskeen* refers to those in chronic poverty, distinct from the general term *faqeer* (temporarily needy), highlighting a duty to address systemic deprivation. Classical Shia tafsir, such as Allamah Tabatabai’s *Al-Mizan*, links this verse to the Quran’s broader ethos of *tawhid* (divine unity), which demands that faith manifest as social solidarity. The Ahlul Bayt, particularly Imam Ali, exemplified this by establishing systems like *bayt al-mal* (public treasury) to ensure equitable resource distribution.  \n\nToday, this verse calls Muslims to transcend individual charity and address structural inequities. It challenges us to advocate for food security programs, support community kitchens, or lobby for fair economic policies. In a world where millions face hunger, the verse reminds us that true piety lies in transforming compassion into collective action—feeding the miskeen isn’t optional but a divine mandate binding the spiritual and social dimensions of Islam. As Imam Sadiq taught, “The believer is the brother of the believer: his eyes and his guide; he does not betray him, oppress him, or abandon him.” To “encourage feeding the poor” is thus an act of faith and brotherhood.",
    "layer2": "In classical Shia exegesis, Surah al-Maa’un verse 3, which condemns those who “do not encourage the feeding of the poor,” is interpreted as a profound indictment of spiritual hypocrisy and societal neglect. Both Tabrisi in *Majma al-Bayan* and Tabatabai in *Al-Mizan* emphasize that this verse transcends mere condemnation of withholding charity; it critiques the failure to actively promote collective responsibility toward the marginalized. Tabrisi notes that the verse targets those whose faith lacks tangible social expression, arguing that true belief necessitates advocating for justice and compassion. This aligns with the Shia theological principle that *iman* (faith) is inseparable from *amal* (righteous action), a theme recurrent in the teachings of the Ahlul Bayt.\n\nTabatabai expands this further, linking the verse to the concept of *taklif* (divinely ordained responsibility). He posits that neglecting to “encourage” feeding the poor reflects a deeper moral decay, as Islam obligates both individual charity (*zakat*, *sadaqa*) and communal advocacy for equitable resource distribution. The verse thus underscores a core Shia ethical framework: faith without active engagement in social welfare is hollow. This resonates with Imam Jafar al-Sadiq’s teachings, which stress that supporting the vulnerable is a reflection of one’s recognition of divine sovereignty and the Day of Judgment—themes explicitly mentioned in the preceding verses of the surah.\n\nJurisprudentially, Shia scholars derive from this verse the obligation to enjoin not only charitable acts but also systemic efforts to address poverty, reflecting the integration of *fiqh* (jurisprudence) with social ethics. The failure to do so, as the verse warns, aligns one with the *mukadhibin* (deniers of truth), who reject accountability before God. Thus, the verse serves as a timeless admonition against spiritual complacency and a call to embody the socio-religious vision of the Ahlul Bayt.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Maa’un 107:3 is widely interpreted as a critique of spiritual hypocrisy and societal indifference. Ayatollah Naser Makarem Shirazi, in *Tafsir Nemuneh*, emphasizes that neglecting the poor isn’t merely an individual failing but a systemic moral collapse, where communities normalize apathy toward structural inequality. Modern scholars like Sayyid Kamal al-Haydari extend this analysis, framing the verse as a call to *collective responsibility*: feeding the poor isn’t just charity but a duty to dismantle systems perpetuating poverty, such as exploitative labor practices or unequal resource distribution.  \n\nScientific studies on poverty’s psychological impacts—such as chronic stress and reduced life expectancy—align with Islamic ethics on preserving human dignity. Philosophers like Dr. Reza Shah-Kazemi highlight parallels between this verse and Rawlsian theories of justice, arguing that Islam’s emphasis on socioeconomic equity anticipates modern human rights frameworks. Socially, the verse resonates amid crises like global food insecurity (affecting 735 million people, per UN 2023 data) and climate-driven famines, urging Muslims to advocate for sustainable solutions, not just temporary aid.  \n\nInterfaith dialogues often cite this verse to bridge Islamic *zakat* principles with Christian \"love thy neighbor\" ethics or Sikh *langar* traditions, fostering collaborative anti-poverty efforts. Multiculturally, it challenges consumerist societies to reorient values from accumulation to redistribution. As Ayatollah Sistani’s offices model through global relief networks, the verse isn’t a passive ideal but a mandate for actionable compassion—a timeless reminder that faith without social justice is hollow.",
    "layer4": "In Surah Al-Maa’un, verse 3 condemns those who neglect to \"encourage the feeding of the poor,\" a failing the Ahlul Bayt (as) frame as a spiritual disease rooted in arrogance and detachment from divine purpose. Imam Ja’far al-Sadiq (as) taught that this verse exposes the hypocrisy of those who abandon social responsibility while claiming faith: *\"The one who withholds their hand from giving [to the needy] has invalidated their prayers, for Allah has tied prayer to zakat in His Book\"* (Tafsir al-Burhan). Here, the Imam links the outward act of charity to the inner state of the soul, emphasizing that true worship cannot exist without active compassion.  \n\nThe verse’s deeper wisdom lies in its connection to *Wilayah* (divine guardianship). The Ahlul Bayt (as) taught that recognizing the Imam’s spiritual authority necessitates recognizing the sacredness of serving creation. Lady Fatimah (as) embodied this by famously donating her only meal to the hungry for three consecutive days, despite her own poverty, an act commemorated in the revelation of Surah al-Insan. Her sacrifice illustrates that feeding the poor is not mere charity but a *test of loyalty to Allah’s justice*.  \n\nSpiritually, withholding encouragement to feed others reflects a heart hardened against the light of Imamah. The 6th Imam (as) warned, *\"A soul that does not tremble at the hunger of its brother is a soul distant from us\"* (Bihar al-Anwar). Practical guidance lies in cultivating daily awareness: allocate a portion of wealth for the needy, advocate for systemic support of the vulnerable, and purify intentions by seeing the face of the Imam in every deprived person. True faith, as taught by the Ahlul Bayt (as), demands that worship and social justice be inseparable limbs of the same body of devotion.",
    "layer1_urdu": "سوراہ المعون میں ، آیت 3 ان لوگوں کی مذمت کرتی ہے جو معاشرے کے کمزور افراد کی دیکھ بھال کرنے کے بنیادی فرض کو نظرانداز کرتے ہیں ، یہ اعلان کرتے ہیں: *\"اور غریبوں کو کھانا کھلانے کی حوصلہ افزائی نہیں کرتا ہے\" (وا لا یاہودو الا تام المسکن) *۔ یہ آیت ، مکہ میں انکشاف کی گئی ہے ، ان افراد کی منافقت پر تنقید کرتی ہے جو ظاہری طور پر نماز جیسے رسومات انجام دیتے ہیں (جیسا کہ سابقہ آیات میں ذکر کیا گیا ہے) لیکن اخلاقی اور معاشرتی ذمہ داریوں کو نظرانداز کرتے ہیں جو عقیدے کے مرکزی مقام پر ہیں۔ تاریخی اکاؤنٹس نوٹ کرتے ہیں کہ اس سرزنش نے میکن کے دولت مند اشرافیہ کو نشانہ بنایا جنہوں نے اسلام کے معاشرتی انصاف کے پیغام کو مسترد کردیا ، اور غریبوں کی حمایت کرنے سے انکار کردیا - جن میں سے بہت سے ابتدائی مسلمان قریش کے رہنماؤں نے پسماندہ تھے۔  \n\nاصطلاح * یاہودو * (حوصلہ افزائی) فعال وکالت پر زور دیتی ہے ، اور مومنین پر زور دیتی ہے کہ وہ نہ صرف صدقہ کو ذاتی طور پر دیں بلکہ اجتماعی کارروائی کو متاثر کریں۔ * بدعنوانی* سے مراد دائمی غربت میں مبتلا ہے ، جو عام اصطلاح* عمومی فقیر* (عارضی طور پر ضرورت مند) سے الگ ہے ، جس نے نظامی محرومی سے نمٹنے کے لئے ایک فرض کو اجاگر کیا ہے۔ کلاسیکی شیعہ طافسر ، جیسے الامہ تبتابائی کا *المزان *، اس آیت کو قرآن مجید کی وسیع تر اخلاق *توہد *(الہی اتحاد) سے جوڑتا ہے ، جو مطالبہ کرتا ہے کہ اس عقیدے کو معاشرتی یکجہتی کے طور پر ظاہر کیا جائے۔ قابل وسائل کی تقسیم کو یقینی بنانے کے لئے اہل بیت ، خاص طور پر امام علی ، نے * بیت المل * (عوامی خزانے) جیسے نظام قائم کرکے اس کی مثال دی۔  \n\nآج ، یہ آیت مسلمانوں کو انفرادی خیراتی ادارے کو عبور کرنے اور ساختی عدم مساوات کو دور کرنے کا مطالبہ کرتی ہے۔ یہ ہمیں چیلنج کرتا ہے کہ وہ فوڈ سیکیورٹی پروگراموں کی وکالت کریں ، کمیونٹی کچن کی حمایت کریں ، یا منصفانہ معاشی پالیسیوں کے ل l لابی۔ ایک ایسی دنیا میں جہاں لاکھوں افراد کو بھوک کا سامنا کرنا پڑتا ہے ، آیت ہمیں یاد دلاتی ہے کہ حقیقی تقویٰ اجتماعی عمل میں ہمدردی کو تبدیل کرنے میں مضمر ہے - بدعنوانی کو کھانا کھلانا اختیاری نہیں ہے بلکہ اسلام کے روحانی اور معاشرتی جہتوں کو پابند کرنے والا ایک الہی مینڈیٹ ہے۔ جیسا کہ امام صادق نے سکھایا ، \"مومن مومن کا بھائی ہے: اس کی آنکھیں اور اس کا رہنما۔ وہ اس سے غداری نہیں کرتا ، اس پر ظلم نہیں کرتا ہے ، یا اسے ترک نہیں کرتا ہے۔\" اس طرح \"غریبوں کو کھانا کھلانے\" کی حوصلہ افزائی کرنا ایمان اور اخوت کا ایک عمل ہے۔",
    "layer2_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ المعون آیت 3 ، جو ان لوگوں کی مذمت کرتی ہے جو \"غریبوں کو کھانا کھلانے کی حوصلہ افزائی نہیں کرتے ہیں\" ، روحانی منافقت اور معاشرتی نظرانداز کے گہرے فرد جرم کے طور پر تشریح کی جاتی ہے۔ * الجزان * میں * ماجما البیان * اور تبتابائی میں تبریسی دونوں نے اس بات پر زور دیا ہے کہ یہ آیت صرف روکنے والے خیراتی ادارے کی مذمت سے ماورا ہے۔ یہ پسماندہ افراد کی طرف اجتماعی ذمہ داری کو فعال طور پر فروغ دینے میں ناکامی پر تنقید کرتا ہے۔ تبریسی نے نوٹ کیا ہے کہ اس آیت میں ان لوگوں کو نشانہ بنایا جاتا ہے جن کے عقیدے میں ٹھوس معاشرتی اظہار کا فقدان ہے ، اور یہ استدلال کیا گیا ہے کہ حقیقی عقیدے کو انصاف اور ہمدردی کی وکالت کرنے کی ضرورت ہے۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ * ایمان * (ایمان) * امل * (نیک عمل) سے لازم و ملزوم ہے ، جو اہل بائٹ کی تعلیمات میں ایک موضوع بار بار ہوتا ہے۔\n\nتبتابائی اس کو مزید وسعت دیتے ہیں ، آیت کو * تکلیف * (خدائی طور پر مقرر کردہ ذمہ داری) کے تصور سے جوڑتے ہیں۔ انہوں نے کہا کہ غریبوں کو \"حوصلہ افزائی\" کرنے میں نظرانداز کرنے سے ایک گہری اخلاقی کشی کی عکاسی ہوتی ہے ، کیونکہ اسلام انفرادی چیریٹی (*زکوٰٹ*،*صدقہ*) اور مساوی وسائل کی تقسیم کے لئے فرقہ وارانہ وکالت دونوں پر پابند ہے۔ اس طرح آیت ایک بنیادی شیعہ اخلاقی فریم ورک کی نشاندہی کرتی ہے: معاشرتی بہبود میں فعال مشغولیت کے بغیر ایمان کھوکھلا ہے۔ یہ امام جعفر السادق کی تعلیمات سے گونجتا ہے ، جس پر زور دیا گیا ہے کہ کمزوروں کی حمایت کرنا الہی خودمختاری اور فیصلے کے دن کی پہچان کا عکاس ہے۔\n\nفقہی طور پر ، شیعہ اسکالرز اس آیت سے اخذ کرتے ہیں کہ معاشرتی اخلاقیات کے ساتھ * فیقہ * (فقہ) کے انضمام کی عکاسی کرتے ہوئے ، غربت سے نمٹنے کے لئے نہ صرف خیراتی کاموں کو بلکہ نظامی کوششوں کا بھی پابند ہے۔ اس میں ناکامی ، جیسا کہ آیت نے متنبہ کیا ہے ، وہ ایک * مکدیبین * (سچائی کے انکار) کے ساتھ صف بندی کرتا ہے ، جو خدا کے سامنے احتساب کو مسترد کرتا ہے۔ اس طرح ، آیت روحانی خوشنودی کے خلاف ایک لازوال نصیحت اور اہل بیت کے سماجی و مذہبی وژن کو مجسم بنانے کے لئے ایک بے وقت نصیحت کا کام کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سوراہ المعون 107: 3 کو روحانی منافقت اور معاشرتی بے حسی کے نقاد کے طور پر وسیع پیمانے پر تشریح کیا گیا ہے۔ آیت اللہ ناصر مکارم شیرازی ، *طافسیر نمونیہ *میں ، اس بات پر زور دیتا ہے کہ غریبوں کو نظرانداز کرنا محض ایک فرد ہی ناکام نہیں ہے بلکہ ایک نظامی اخلاقی خاتمہ ہے ، جہاں کمیونٹیز ساختی عدم مساوات سے بے حسی کو معمول بناتی ہیں۔ سید کمال الحیداری جیسے جدید اسکالرز اس تجزیے میں توسیع کرتے ہیں ، اور اس آیت کو *اجتماعی ذمہ داری کی کال کے طور پر مرتب کرتے ہیں: غریبوں کو کھانا کھلانا صرف خیرات نہیں ہے بلکہ غربت کو برقرار رکھنے کے نظام کو ختم کرنے کا فرض ہے ، جیسے استحصال مزدوری کے طریقوں یا غیر مساوی وسائل کی تقسیم۔  \n\nغربت کے نفسیاتی اثرات کے بارے میں سائنسی مطالعات - جیسے دائمی تناؤ اور کم عمر متوقع - انسانی وقار کو محفوظ رکھنے پر اسلامی اخلاقیات کے مطابق۔ ڈاکٹر رضا شاہ-کازیمی جیسے فلسفیوں نے اس آیت اور انصاف کے راولسین نظریات کے مابین ہم آہنگی کو اجاگر کیا ، اور یہ استدلال کیا کہ معاشرتی ایکویٹی پر اسلام کا زور انسانی حقوق کے جدید فریم ورک کی توقع کرتا ہے۔ معاشرتی طور پر ، یہ آیت عالمی غذائی عدم تحفظ (735 ملین افراد کو متاثر کرنے والے 735 ملین افراد کو ، 2023 کے اعداد و شمار پر اثر انداز ہونے) اور آب و ہوا سے چلنے والے قحط جیسے بحرانوں کے درمیان گونجتی ہے ، جس سے مسلمانوں پر زور دیا گیا ہے کہ وہ صرف عارضی امداد ہی نہیں ، پائیدار حل کی وکالت کریں۔  \n\nبین الاقوامی مکالمے اکثر اس آیت کو اسلامی * زکاط * کو عیسائی \"اپنے پڑوسی سے پیار کرتے ہیں\" اخلاقیات یا سکھ * لانگار * روایات کے ساتھ اصولوں کو ختم کرنے کے لئے پیش کرتے ہیں ، جس سے باہمی تعاون کے ساتھ غربت سے متعلق کوششوں کو فروغ ملتا ہے۔ کثیر الثقافتی طور پر ، یہ صارفین کے معاشروں کو چیلنج کرتا ہے کہ وہ جمع سے دوبارہ تقسیم تک اقدار کو دوبارہ ترتیب دیں۔ عالمی امداد کے نیٹ ورکس کے ذریعہ آیت اللہ سسٹانی کے دفاتر کے ماڈل کی حیثیت سے ، آیت ایک غیر فعال مثالی نہیں ہے بلکہ قابل عمل ہمدردی کا مینڈیٹ ہے۔",
    "layer4_urdu": "سورہ المعون میں ، آیت 3 ان لوگوں کی مذمت کرتی ہے جو \"غریبوں کو کھانا کھلانے کی حوصلہ افزائی\" کرنے میں نظرانداز کرتے ہیں ، ایک روحانی بیماری کے طور پر ایک اہل بیت (ع) فریم کو الہی مقصد سے تکبر اور لاتعلقی میں جکڑا ہوا ہے۔ امام جافر السادق (ع) نے سکھایا کہ یہ آیت ان لوگوں کی منافقت کو بے نقاب کرتی ہے جو عقیدے کا دعوی کرتے ہوئے معاشرتی ذمہ داری کو ترک کرتے ہیں: \"جو شخص [ضرورت مندوں کو] دینے سے اپنا ہاتھ روکتا ہے ، نے ان کی دعاوں کو غلط قرار دیا ہے ، کیونکہ اللہ نے اپنی کتاب میں زکات سے دعا کی ہے۔ یہاں ، امام صدقہ کے ظاہری عمل کو روح کی اندرونی حالت سے جوڑتا ہے ، اس بات پر زور دیتے ہوئے کہ حقیقی عبادت فعال شفقت کے بغیر موجود نہیں ہوسکتی ہے۔  \n\nآیت کی گہری حکمت * ولیہ * (خدائی سرپرستی) سے اس کے تعلق میں ہے۔ اہل بیت (ع) نے سکھایا کہ امام کے روحانی اتھارٹی کو تسلیم کرنے سے تخلیق کی خدمت کے تقدس کو تسلیم کرنے کی ضرورت ہے۔ لیڈی فاطمہ (ع) نے اس کی اپنی غربت کے باوجود ، اس نے اپنی غربت کے باوجود ، اسے مسلسل تین دن بھوکے کو مشہور طور پر کھانا عطیہ کرکے اس کا مجسمہ کیا۔ اس کی قربانی یہ واضح کرتی ہے کہ غریبوں کو کھانا کھلانا محض صدقہ نہیں ہے بلکہ اللہ کے انصاف کے ساتھ وفاداری کا امتحان ہے۔  \n\nروحانی طور پر ، دوسروں کو کھانا کھلانے کے لئے حوصلہ افزائی کرنا امامہ کی روشنی کے خلاف سخت دل کی عکاسی کرتا ہے۔ 6 ویں امام (ع) نے متنبہ کیا ، * \"ایک روح جو اپنے بھائی کی بھوک پر کانپتی نہیں ہے وہ ہم سے دور ایک روح ہے\" * (بہار الانور)۔ عملی رہنمائی روزانہ بیداری کاشت کرنے میں ہے: ضرورت مندوں کے لئے دولت کا ایک حصہ مختص کریں ، کمزوروں کی نظامی مدد کے لئے وکالت کریں ، اور ہر محروم شخص میں امام کا چہرہ دیکھ کر ارادوں کو پاک کریں۔ سچے عقیدے ، جیسا کہ اہل بیت (ع) نے سکھایا ہے ، مطالبہ کرتا ہے کہ عبادت اور معاشرتی انصاف ایک ہی جسم کے عقیدت کے لازم و ملزوم اعضاء ہوں۔",
    "layer5": "The interpretation of Surah Al-Maa'un (107:3), which criticizes those who neglect encouraging the feeding of the poor, reveals both convergences and nuanced divergences between Shia and Sunni scholarly traditions. Classical exegetes from both schools broadly agree on the verse’s moral imperative, emphasizing that true faith necessitates active compassion and social responsibility. Al-Tabari (Sunni) and Al-Tabrisi (Shia) concur that the verse condemns spiritual hypocrisy, linking neglect of charity to a rejection of religious accountability (Jami al-Bayan; Majma al-Bayan). Similarly, Ibn Kathir (Sunni) and Al-Tusi (Shia) stress that mere ritual observance without ethical action voids one’s devotion, reflecting a shared emphasis on sincerity (Tafsir Ibn Kathir; Al-Tibyan).  \n\nKey differences emerge in theological framing. Sunni commentators like Al-Qurtubi tie the verse to individual moral failure, interpreting “encouraging” as a communal obligation (fard kifayah) fulfilled through personal initiative (Al-Jami li-Ahkam). In contrast, Shia exegetes such as Al-Tabatabai (Al-Mizan) and Al-Qummi (Tafsir al-Qummi) contextualize the injunction within the framework of Imamah, viewing societal welfare as inseparable from divinely guided leadership. This reflects the Shia emphasis on the Ahlul Bayt’s role in modeling and enforcing social justice.  \n\nHistorically, these divergences stem from distinct approaches to religious authority post-Prophet Muhammad. Sunni interpretations often prioritize individual and collective responsibility as inherited from the Rashidun Caliphs, while Shia readings integrate the Imams’ teachings into ethical governance. Practically, both traditions reinforce charity as a pillar of faith, but Shia jurisprudence may emphasize institutionalized welfare under clerical guidance, whereas Sunni practice frequently highlights community-led initiatives.  \n\nDespite these nuances, the verse’s core message—linking faith to social equity—remains a unifying ethical principle across both traditions, underscoring Islam’s universal call to uplift the marginalized.",
    "layer5_urdu": "سوراہ المعون (107: 3) کی تشریح ، جو غریبوں کو کھانا کھلانے کی حوصلہ افزائی کرنے میں نظرانداز کرنے والوں پر تنقید کرتی ہے ، شیعہ اور سنی علمی روایات کے مابین ہم آہنگی اور متنازعہ دونوں فرق کو ظاہر کرتی ہے۔ دونوں اسکولوں کی کلاسیکی استثنیٰ آیت کی اخلاقی لازمی پر وسیع پیمانے پر متفق ہیں ، اس بات پر زور دیتے ہوئے کہ حقیقی عقیدے کو فعال شفقت اور معاشرتی ذمہ داری کی ضرورت ہے۔ التباری (سنی) اور الاتبریسی (شیعہ) نے اتفاق کیا ہے کہ آیت روحانی منافقت کی مذمت کرتی ہے ، اور خیرات کو نظرانداز کرتے ہوئے مذہبی احتساب کو مسترد کرنے سے جوڑتی ہے (جامی البیان ؛ مجسہ البیان)۔ اسی طرح ، ابن کتھیر (سنی) اور التوسی (شیعہ) نے اس بات پر زور دیا ہے کہ اخلاقی عمل کے بغیر محض رسمی طور پر مشاہدہ کسی کی عقیدت کو ختم کرتا ہے ، جو اخلاص پر مشترکہ زور کی عکاسی کرتا ہے (طافسیر ابن کتھیر ؛ التبیان)۔  \n\nمذہبی ڈھانچے میں کلیدی اختلافات سامنے آتے ہیں۔ الکوروبی جیسے سنی مبصرین اس آیت کو انفرادی اخلاقی ناکامی سے جوڑتے ہیں ، اور \"حوصلہ افزا\" کی ترجمانی کرتے ہوئے فرقہ وارانہ ذمہ داری (فارڈ کیفیاہ) کی تشریح کرتے ہیں جو ذاتی اقدام (الجامی لی-احکم) کے ذریعے پورا ہوا ہے۔ اس کے برعکس ، شیعہ استثنیٰ جیسے الاتعباتابائی (المزان) اور القومی (طافسیر القومی) امامہ کے فریم ورک کے اندر حکم کو سیاق و سباق سے دوچار کرتے ہیں ، اور معاشرتی فلاح و بہبود کو الہامی رہنمائی کی قیادت سے لازم و ملزوم کے طور پر دیکھتے ہیں۔ اس سے معاشرتی انصاف کے ماڈلنگ اور ان کے نفاذ میں اہل بیت کے کردار پر شیعہ زور کی عکاسی ہوتی ہے۔  \n\nتاریخی طور پر ، یہ تغیرات مذہبی اتھارٹی کے بعد کے حامی محمد کے مختلف نقطہ نظر سے پیدا ہوتے ہیں۔ سنی تشریحات اکثر انفرادی اور اجتماعی ذمہ داری کو ترجیح دیتی ہیں جیسا کہ راشدون خلیفہ سے وراثت میں ملا ہے ، جبکہ شیعہ ریڈنگز نے اماموں کی تعلیمات کو اخلاقی حکمرانی میں ضم کیا ہے۔ عملی طور پر ، دونوں روایات عقیدے کے ایک ستون کے طور پر خیراتی ادارے کو تقویت دیتی ہیں ، لیکن شیعہ فقہی علمی رہنمائی کے تحت ادارہ جاتی فلاح و بہبود پر زور دے سکتی ہے ، جبکہ سنی پریکٹس اکثر کمیونٹی کے زیرقیادت اقدامات کو اجاگر کرتی ہے۔  \n\nان باریکیوں کے باوجود ، آیت کا بنیادی پیغام - جو معاشرتی مساوات سے عقیدہ کو جوڑتا ہے ، دونوں روایات میں یکجہتی اخلاقی اصول کو قبول کرتا ہے ، اور اس نے پسماندہ کو ترقی دینے کے لئے اسلام کی آفاقی کال کی نشاندہی کی ہے۔",
    "layer2short": "In classical Shia exegesis, Surah al-Maa’un verse 3, which condemns those who “do not encourage the feeding of the poor,” is interpreted as a profound indictment of spiritual hypocrisy and societal neglect. Both Tabrisi in *Majma al-Bayan* and Tabatabai in *Al-Mizan* emphasize that this verse transcends mere condemnation of withholding charity; it critiques the failure to actively promote collective responsibility toward the marginalized. Tabrisi notes that the verse targets those whose faith lacks tangible social expression, arguing that true belief necessitates advocating for justice and compassion. This aligns with the Shia theological principle that *iman* (faith) is inseparable from *amal* (righteous action), a theme recurrent in the teachings of the Ahlul Bayt.",
    "layer2short_urdu": "کلاسیکی شیعہ کی توثیق میں ، سورہ المعون آیت 3 ، جو ان لوگوں کی مذمت کرتی ہے جو \"غریبوں کو کھانا کھلانے کی حوصلہ افزائی نہیں کرتے ہیں\" ، روحانی منافقت اور معاشرتی نظرانداز کے گہرے فرد جرم کے طور پر تشریح کی جاتی ہے۔ * الجزان * میں * ماجما البیان * اور تبتابائی میں تبریسی دونوں نے اس بات پر زور دیا ہے کہ یہ آیت صرف روکنے والے خیراتی ادارے کی مذمت سے ماورا ہے۔ یہ پسماندہ افراد کی طرف اجتماعی ذمہ داری کو فعال طور پر فروغ دینے میں ناکامی پر تنقید کرتا ہے۔ تبریسی نے نوٹ کیا ہے کہ اس آیت میں ان لوگوں کو نشانہ بنایا جاتا ہے جن کے عقیدے میں ٹھوس معاشرتی اظہار کا فقدان ہے ، اور یہ استدلال کیا گیا ہے کہ حقیقی عقیدے کو انصاف اور ہمدردی کی وکالت کرنے کی ضرورت ہے۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ * ایمان * (ایمان) * امل * (نیک عمل) سے لازم و ملزوم ہے ، جو اہل بائٹ کی تعلیمات میں ایک موضوع بار بار ہوتا ہے۔"
  },
  "4": {
    "layer1": "In Surah Al-Maa’un, verse 4 delivers a striking warning: *“Fa-waylun lil-musalleen”* (So woe to those who pray). At first glance, this seems paradoxical—why would Allah condemn those engaged in prayer? Classical Shia tafsir, including insights from scholars like Allama Tabatabai in *Al-Mizan*, clarifies that this verse targets hypocrites who perform *salah* ritualistically while neglecting its spiritual and ethical essence. The term *“wayl”* signifies a severe punishment, reserved here for those whose prayers lack sincerity and fail to inspire compassion or social responsibility.  \n\nHistorically, this verse is linked to individuals in early Islam who maintained outward religious practices but oppressed the vulnerable—mocking orphans, refusing charity (*maa’un*), and disregarding the needy (themes highlighted in adjacent verses). The word *“musalleen”* (those who pray) is deliberately contrasted with true believers, emphasizing that mere physical acts of worship hold no value without inward humility and outward justice.  \n\nIn contemporary life, this verse urges Muslims to examine the integrity of their worship. Are our prayers fostering humility, empathy, and action? Do we prioritize ritual precision while ignoring poverty, injustice, or neglect of community welfare? The Ahlul Bayt, as narrated in Shia sources, taught that *salah* must be a transformative act, aligning the heart with Allah and the hands with service. Imam Ali emphasized that true prayer “restrains from shameful deeds” (Quran 29:45)—a reminder that faith without moral accountability is hollow. Today, this verse challenges us to bridge the gap between devotion and duty, ensuring our worship fuels both spiritual growth and tangible kindness.",
    "layer2": "In Surah al-Maa’un, verse 4, the declaration *\"woe to those who pray\"* presents a profound theological paradox, as prayer (salat) is a pillar of Islam. Classical Shia exegetes resolve this tension by emphasizing the conditions and intentions that validate worship. Both Tabatabai in *Al-Mizan* and Tabrisi in *Majma al-Bayan* clarify that the verse targets those whose prayers are devoid of sincerity (ikhlas) and ethical substance, rendering their acts spiritually void despite outward observance. Tabrisi notes that the verse condemns *\"the performers of prayer who are heedless of its essence\"*—those who pray to be seen by others (riya’) or who neglect the social obligations integral to faith, as highlighted in subsequent verses (e.g., denying sustenance to orphans and the poor).\n\nTabatabai expands this through the lens of *tawhid*, arguing that prayer disconnected from consciousness of God (taqwa) and communal responsibility becomes a hollow ritual, antithetical to the Quranic definition of *\"establishing prayer\"* (iqamat al-salat). The *woe* (wayl) here signifies divine chastisement reserved for those who sever worship from its moral and social dimensions—a recurring theme in the teachings of the Ahlul Bayt. Imam Jafar al-Sadiq, as cited in Shia hadith collections, taught that *\"prayer accepted by God must deter one from arrogance and neglect of others’ rights,\"* aligning with the surah’s condemnation of performative religiosity.\n\nThis verse thus underscores a core Shia theological principle: acts of worship are inseparable from ethical conduct and social justice. Jurisprudentially, it reinforces the Shia emphasis on *niyyah* (intention) as the foundation of valid worship and the necessity of aligning ritual obligations with the broader Quranic mandate of compassion and equity. The condemnation serves as a timeless warning against reducing faith to mechanical rites divorced from spiritual and societal transformation.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Maa’un 107:4 is interpreted as a profound critique of performative religiosity divorced from social ethics. Ayatollah Naser Makarem Shirazi, in his *Tafsir Nemuneh*, emphasizes that the verse condemns those who reduce prayer to ritualistic motions while neglecting its moral imperatives—particularly care for the marginalized (the \"maa’un,\" or small kindnesses mentioned in later verses). This aligns with Imam Ali’s teaching in *Nahj al-Balagha* that \"prayer without action is like a bow without a string\"—a hollow gesture.  \n\nModern scholars like Dr. Liyakat Takim (McMaster University) contextualize this verse within today’s \"spiritual materialism,\" where religious identity is commodified or weaponized for social validation rather than fostering justice. Neuroscientific studies on ritual behavior (e.g., Andrew Newberg’s work on prayer and brain function) reveal that repetitive acts can create a false sense of moral accomplishment, mirroring the Quranic warning against self-deceptive worship.  \n\nGlobally, this verse challenges communities to confront hypocrisy in addressing crises like climate injustice, refugee rights, or wealth inequality. For instance, Muslim-majority nations with high mosque attendance but systemic corruption or environmental neglect are urged to realign ritual with responsibility. Interfaith parallels emerge in Pope Francis’ critique of \"empty ritualism\" in *Laudato Si’*, calling all faiths to unite in ethical praxis.  \n\nUltimately, the verse is a timeless call to integrate worship with *insan* (humanity)—a theme amplified in Shia theology through the lens of Imam Hussein’s stand at Karbala, where spiritual conviction demanded tangible sacrifice for justice. As scholar Amina Inloes notes, \"Prayer is the compass, but compassion is the journey.",
    "layer4": "The verse \"So woe to those who pray\" (107:4) pierces the heart with divine admonition, calling believers to transcend hollow ritualism. The Ahlul Bayt (as) teach that this verse does not condemn prayer itself—the pillar of faith—but exposes the hypocrisy of those who perform salat while neglecting its spiritual essence and social obligations. Imam Ali (as) warns, *\"Many a prayer is but a burden on the one performing it, for its rights are not fulfilled.\"* The \"woe\" here strikes those who mechanically move their limbs in worship but abandon the soul of devotion: sincerity, humility, and connection to Allah through the light of Wilayah.\n\nImam Jafar al-Sadiq (as) explains this verse by linking prayer to social responsibility: *\"They are the ones who pray but withhold even the smallest acts of kindness [al-maa'un] from people. Their prayer does not prevent them from oppressing others.\"* The Ahlul Bayt (as) emphasize that true prayer transforms the soul and actions. Lady Fatimah (as) embodied this by making her nightly prayers a springboard for serving the poor, stating, *\"I pray to draw nearer to Allah, then rise to feed the hungry and clothe the needy.\"*  \n\nFor Shia spirituality, salat is inseparable from recognizing the Imamah—the divine leadership that guides believers toward Allah. Prayers devoid of love for the Ahlul Bayt (as) and commitment to justice are empty shells. Imam Zayn al-Abidin (as) teaches in *Sahifa Sajjadiyya*: *\"Let my prayer be a shield against evil, not a veil over my sins.\"*  \n\nPractical guidance: Let every prostration ignite self-accountability. Does your prayer soften your heart? Does it drive you to feed orphans, speak truthfully, and uphold the rights of the Imam of our time (aj)? Merge the rhythm of salat with the rhythm of service, and let Wilayah be the compass directing your worship beyond formality into transformative light.",
    "layer1_urdu": "سورہ المعون میں ، آیت 4 نے ایک حیرت انگیز انتباہ پیش کیا: * \"ایف اے وےلون لِل مسالین\" * (اتنا افسوس ہے کہ ان لوگوں کو جو دعا کرتے ہیں)۔ پہلی نظر میں ، یہ متضاد معلوم ہوتا ہے - اللہ علیہ السلام دعا میں مصروف افراد کی مذمت کیوں کرے گا؟ کلاسیکی شیعہ طافسر ، بشمول *المزان *میں علامہ تبتابائی جیسے اسکالرز کی بصیرت سمیت ، واضح کرتی ہے کہ یہ آیت منافقوں کو نشانہ بناتی ہے جو اپنے روحانی اور اخلاقی جوہر کو نظرانداز کرتے ہوئے *صلاح *رسمی طور پر انجام دیتے ہیں۔ اصطلاح * \"وائل\" * ایک سخت سزا کی نشاندہی کرتی ہے ، یہاں ان لوگوں کے لئے مختص ہے جن کی دعاؤں میں خلوص کا فقدان ہے اور ہمدردی یا معاشرتی ذمہ داری کو متاثر کرنے میں ناکام رہتے ہیں۔  \n\nتاریخی طور پر ، یہ آیت ابتدائی اسلام کے ان افراد سے جڑی ہوئی ہے جنہوں نے ظاہری مذہبی طریقوں کو برقرار رکھا لیکن کمزوروں پر ظلم کیا - یتیموں کو مذاق اڑایا ، صدقہ سے انکار (*ماون*) ، اور ضرورت مندوں (ملحقہ آیات میں روشنی ڈالی گئی موضوعات) کو نظرانداز کیا۔ لفظ * \"مسالین\" * (جو لوگ دعا کرتے ہیں) جان بوجھ کر سچے مومنین کے ساتھ متصادم ہیں ، اس بات پر زور دیتے ہوئے کہ محض جسمانی عبادتوں کو اندرونی عاجزی اور ظاہری انصاف کے بغیر کوئی اہمیت نہیں ہے۔  \n\nعصری زندگی میں ، یہ آیت مسلمانوں سے ان کی عبادت کی سالمیت کا جائزہ لینے کی تاکید کرتی ہے۔ کیا ہماری دعائیں عاجزی ، ہمدردی اور عمل کو فروغ دے رہی ہیں؟ کیا ہم غربت ، ناانصافی ، یا معاشرتی فلاح و بہبود سے نظرانداز کرتے ہوئے رسمی صحت سے متعلق ترجیح دیتے ہیں؟ جیسا کہ شیعہ ذرائع میں بیان کیا گیا ہے ، اہل بیت نے سکھایا کہ * صلاح * کو ایک تبدیلی کا عمل ہونا چاہئے ، جس سے دل کو اللہ اور ہاتھوں سے خدمت کے ساتھ ہم آہنگ کیا جائے۔ امام علی نے اس بات پر زور دیا کہ سچی دعا \"شرمناک اعمال سے روکتی ہے\" (قرآن 29:45) - ایک یاد دہانی کہ اخلاقی احتساب کے بغیر ایمان کھوکھلا ہے۔ آج ، یہ آیت ہمیں چیلنج کرتی ہے کہ ہم عقیدت اور فرائض کے مابین پائے جانے والے فرق کو ختم کردیں ، اور ہماری عبادت کو یقینی بناتے ہوئے روحانی نشوونما اور ٹھوس شفقت دونوں کو ایندھن دیتا ہے۔",
    "layer2_urdu": "سورہ المعون ، آیت 4 میں ، اعلامیہ * \"ان لوگوں کے لئے افسوس ہے جو دعا کرتے ہیں\" * ایک گہرا مذہبی تضاد پیش کرتا ہے ، کیونکہ دعا (صلام) اسلام کا ایک ستون ہے۔ کلاسیکی شیعہ استثنیٰ اس تناؤ کو ان حالات اور ارادوں پر زور دے کر حل کریں جو عبادت کی توثیق کرتے ہیں۔ * العزان * اور تبریسی دونوں تبتابائی * میں * مجس البیان * میں یہ واضح کرتے ہیں کہ یہ آیت ان لوگوں کو نشانہ بناتی ہے جن کی دعائیں اخلاص (اخلا) اور اخلاقی مادے سے عاری ہیں ، ظاہری طور پر منانے کے باوجود ان کے اعمال کو روحانی طور پر باطل قرار دیتے ہیں۔ تبریسی نے نوٹ کیا ہے کہ آیت کی مذمت کی گئی ہے *\"نماز کے اداکار جو اس کے جوہر سے غفلت رکھتے ہیں\" * - وہ لوگ جو دوسروں (ریا ’) کو دیکھنے کی دعا کرتے ہیں یا جو معاشرتی ذمہ داریوں کو عقیدے سے لازمی طور پر نظرانداز کرتے ہیں ، جیسا کہ بعد کی آیات میں روشنی ڈالی گئی ہے (جیسے ، یتیموں اور غریبوں سے رزق کی تردید کرنا)۔\n\nتبتابائی نے اس کو *طواد *کے عینک سے بڑھایا ہے ، اور یہ استدلال کیا ہے کہ خدا کے شعور (تقوا) اور فرقہ وارانہ ذمہ داری سے منقطع نماز ایک کھوکھلی رسم بن جاتی ہے ، جو *\"دعا کے قیام\" *کی قرآنی تعریف کے متضاد ہے۔ یہاں * واو * (وایل) الہی عذاب کی نشاندہی کرتا ہے جو ان لوگوں کے لئے مخصوص ہیں جو اس کی اخلاقی اور معاشرتی جہتوں سے عبادت کو منقطع کرتے ہیں۔ امام جعفر السادق ، جیسا کہ شیعہ حدیث کے مجموعوں میں حوالہ دیا گیا ہے ، نے سکھایا کہ * \"خدا کی طرف سے قبول کی جانے والی دعا کو دوسروں کے حقوق کو تکبر اور نظرانداز کرنے سے باز رکھنا چاہئے ،\" * سورہ کی پرفارمنس مذہبی مذہب کی مذمت کے ساتھ صف بندی کرتے ہوئے۔\n\nاس طرح یہ آیت ایک بنیادی شیعہ مذہبی اصول کی نشاندہی کرتی ہے: عبادت کے اعمال اخلاقی طرز عمل اور معاشرتی انصاف سے الگ نہیں ہیں۔ فقہی طور پر ، یہ * نیہہ * (ارادے) پر درست عبادت کی بنیاد اور ہمدردی اور مساوات کے وسیع تر قرآنی مینڈیٹ کے ساتھ رسمی ذمہ داریوں کو سیدھ میں کرنے کی ضرورت کے طور پر شیعہ پر زور دینے کو تقویت دیتا ہے۔ یہ مذمت روحانی اور معاشرتی تبدیلی سے طلاق شدہ مکینیکل رسومات پر ایمان کو کم کرنے کے خلاف ایک لازوال انتباہ کا کام کرتی ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ المعون 107: 4 کو معاشرتی اخلاقیات سے طلاق دینے والے پرفارمنس مذہبیت کے گہرے نقاد کے طور پر تشریح کی گئی ہے۔ آیت اللہ نصر مکارم شیرازی نے اپنے *طافسیر نمونیہ *میں اس بات پر زور دیا ہے کہ اس آیت میں ان لوگوں کی مذمت کی گئی ہے جو رسمی حرکات کے لئے دعا کو کم کرتے ہیں جبکہ اس کے اخلاقی طور پر نظرانداز کرتے ہیں۔ یہ * ناہج البالاگھا * میں امام علی کی تعلیم کے ساتھ صف بندی کرتا ہے کہ \"بغیر کسی عمل کے دعا ایک تار کے دخش کی طرح ہے\"-ایک کھوکھلی اشارے۔  \n\nڈاکٹر لییاکات تکیم (میک ماسٹر یونیورسٹی) جیسے جدید اسکالرز آج کی \"روحانی مادیت\" کے اندر اس آیت کو سیاق و سباق دیتے ہیں ، جہاں انصاف کو فروغ دینے کے بجائے معاشرتی توثیق کے لئے مذہبی شناخت کو اجناس یا اسلحہ بنایا جاتا ہے۔ رسمی طرز عمل سے متعلق نیورو سائنسٹی مطالعات (جیسے ، اینڈریو نیوبرگ کا نماز اور دماغی فنکشن پر کام) سے پتہ چلتا ہے کہ بار بار ہونے والی حرکتیں اخلاقی کامیابی کا جھوٹا احساس پیدا کرسکتی ہیں ، اور خود کو بد نظمی کی عبادت کے خلاف قرآنی انتباہ کا آئینہ دار بناتی ہیں۔  \n\nعالمی سطح پر ، یہ آیت برادریوں کو چیلنج کرتی ہے کہ وہ آب و ہوا کے ناانصافی ، مہاجرین کے حقوق ، یا دولت کی عدم مساوات جیسے بحرانوں سے نمٹنے میں منافقت کا مقابلہ کریں۔ مثال کے طور پر ، مسلم اکثریتی ممالک میں مسجد کی اعلی حاضری ہے لیکن نظامی بدعنوانی یا ماحولیاتی نظرانداز پر زور دیا گیا ہے کہ وہ رسم کو ذمہ داری کے ساتھ تسلیم کریں۔ پوپ فرانسس میں انٹرفیتھ کے متوازی سامنے آتے ہیں۔  \n\nبالآخر ، آیت ایک لازوال کال ہے جس میں عبادت کو * انسان * (انسانیت) کے ساتھ مربوط کیا جائے - ایک تھیم کو شیعہ الہیات میں کاربالہ میں امام حسین کے موقف کے لینس کے ذریعہ بڑھایا گیا ، جہاں روحانی یقین نے انصاف کے لئے ٹھوس قربانی کا مطالبہ کیا۔ جیسا کہ اسکالر آمنہ نے نوٹ کیا ہے ، \"دعا کمپاس ہے ، لیکن ہمدردی سفر ہے۔",
    "layer4_urdu": "آیت \"ان لوگوں کے لئے بہت افسوس ہے جو دعا کرتے ہیں\" (107: 4) دل کو خدائی نصیحت کے ساتھ چھیدتا ہے ، اور مومنوں کو کھوکھلی رسم پسندی سے بالاتر قرار دیتا ہے۔ اہل بیت (ع) کو یہ سکھاتا ہے کہ یہ آیت خود نماز کی مذمت نہیں کرتی ہے - عقیدے کا ستون - لیکن ان لوگوں کی منافقت کو بے نقاب کرتا ہے جو اس کے روحانی جوہر اور معاشرتی ذمہ داریوں کو نظرانداز کرتے ہوئے صلاح انجام دیتے ہیں۔ امام علی (ع) نے خبردار کیا ، * \"بہت ساری دعا اس پر انجام دینے والے پر ایک بوجھ ہے ، کیونکہ اس کے حقوق کو پورا نہیں کیا جاتا ہے۔\n\nامام جعفر السادق (ع) اس آیت کو نماز کو معاشرتی ذمہ داری سے جوڑ کر بیان کرتے ہیں: * \"وہی لوگ ہیں جو دعا کرتے ہیں لیکن لوگوں سے بھی نرمی کی چھوٹی چھوٹی حرکتوں کو روکتے ہیں۔ ان کی دعا ان کو دوسروں پر ظلم کرنے سے نہیں روکتی ہے۔\" لیڈی فاطمہ (ع) نے اپنی رات کی دعاوں کو غریبوں کی خدمت کے لئے ایک اسپرنگ بورڈ بنا کر ، یہ بیان کرتے ہوئے کہا ، \"میں دعا کرتا ہوں کہ اللہ کی طرف قریب آجائے ، پھر بھوکے لوگوں کو کھانا کھلانا اور ضرورت مندوں کو پہنائے۔\"  \n\nشیعہ روحانیت کے ل Sal ، صلات امامہ کو پہچاننے سے لازم و ملزوم ہیں۔ یہ خدائی قیادت ہے جو مومنین کو اللہ کی طرف رہنمائی کرتی ہے۔ احلول بیت (ع) کے لئے محبت سے عاری دعائیں اور انصاف سے وابستگی خالی گولے ہیں۔ امام زین الیبدین (ع) *ساہفا سججدیہ میں پڑھاتے ہیں *: *\"میری دعا کو برائی کے خلاف ڈھال بننے دو ، میرے گناہوں پر پردہ نہیں۔\"  \n\nعملی رہنمائی: ہر سجدے میں خود حساب کتاب کو بھڑکانے دیں۔ کیا آپ کی دعا آپ کے دل کو نرم کرتی ہے؟ کیا یہ آپ کو یتیموں کو کھانا کھلانے ، سچ بولنے اور ہمارے وقت (AJ) کے امام کے حقوق کو برقرار رکھنے پر مجبور کرتا ہے؟ خدمت کی تال کے ساتھ صلام کی تال کو ضم کریں ، اور ولیہ کو کمپاس بننے دیں جو آپ کی عبادت کو رسمی طور پر تغیراتی روشنی میں لے جانے کی ہدایت کرتے ہیں۔",
    "layer5": "The verse \"So woe to those who pray\" (Q 107:4) has drawn nuanced interpretations across Islamic traditions. Both Shia and Sunni scholars converge on its core critique of insincere worshipers who neglect social responsibilities. Al-Tabari (Sunni) and Al-Tabrisi (Shia) contextualize the verse within Meccan society’s moral decay, where ritual prayer coexisted with oppression of orphans and refusal to feed the poor (Majma al-Bayan; Jami al-Bayan). Ibn Kathir and Al-Tusi similarly emphasize that mere performance of prayer without compassion or justice renders worship void, aligning with Al-Qummi’s view that true prayer necessitates \"awareness of the Divine and care for creation\" (Tafsir al-Qummi; At-Tibyan).\n\nDivergences emerge in theological emphasis. Sunni exegetes like Al-Qurtubi and Al-Razi focus on outward negligence of zakat and charity as the verse’s primary target, framing it as a warning against abandoning communal obligations (Al-Jami li-Ahkam; Mafatih al-Ghayb). Shia commentaries, particularly Al-Tabatabai’s Al-Mizan, extend the critique to include deficient inner states—prayers offered without presence of heart or recognition of the Imams’ spiritual authority. This reflects the Shia theological principle linking valid worship to both correct action and adherence to the Ahl al-Bayt’s guidance.\n\nHistorically, these differences stem from distinct epistemological frameworks: Sunni tafsir often prioritizes the verse’s immediate socio-ethical implications, while Shia interpretations integrate it with broader teachings on walaya (allegiance to divinely appointed leadership). Both traditions, however, reinforce the inseparable connection between ritual observance and social justice—a principle shaping Muslim practices of charity and communal accountability. The verse thus remains a unifying ethical admonition, even as interpretive lenses reflect each tradition’s theological priorities.",
    "layer5_urdu": "آیت \"ان لوگوں کے لئے بہت افسوس ہے جو دعا کرتے ہیں\" (Q 107: 4) نے اسلامی روایات میں متنازعہ تشریحات کھینچی ہیں۔ شیعہ اور سنی اسکالر دونوں ہی غیر سنجیدہ نمازیوں کے اس کے بنیادی نقاد کو تبدیل کرتے ہیں جو معاشرتی ذمہ داریوں کو نظرانداز کرتے ہیں۔ التباری (سنی) اور الاتبریسی (شیعہ) میکن سوسائٹی کے اخلاقی زوال کے اندر اس آیت کو سیاق و سباق میں لاتے ہیں ، جہاں رسمی نماز یتیموں کے ظلم و ستم اور غریبوں کو کھانا کھلانے سے انکار کرتی ہے (ماجما البیان ؛ جمی البیان)۔ ابن کتھیر اور التوسی اسی طرح اس بات پر زور دیتے ہیں کہ ہمدردی یا انصاف کے بغیر نماز کی صرف کارکردگی باطل کی پوجا کرتی ہے ، اور الکوومی کے نظریہ کے ساتھ صف بندی کرتی ہے کہ حقیقی دعا کو \"الہی کے بارے میں شعور اور تخلیق کی دیکھ بھال\" کی ضرورت ہوتی ہے (طافسیر القومی ؛ ات-تبیان)۔\n\nمذہبی زور سے تغیرات ابھرتے ہیں۔ سنی استثنیٰ جیسے القورووبی اور الراجی زکو at اور چیریٹی کی ظاہری غفلت پر توجہ مرکوز کرتے ہیں اور اس کو آیت کا بنیادی ہدف قرار دیا گیا ہے ، اور اسے فرقہ وارانہ ذمہ داریوں کو ترک کرنے کے خلاف انتباہ کے طور پر تیار کیا گیا ہے (الجامی لی احکام ؛ مافاتیہ الغیب)۔ شیعہ کی تفسیر ، خاص طور پر الاتاباتابائی کے المزان ، ناقص اندرونی ریاستوں کو شامل کرنے کے لئے تنقید کو بڑھا دیتے ہیں۔ اس سے شیعہ مذہبی اصول کی عکاسی ہوتی ہے جو درست عبادت کو صحیح عمل اور اے ایچ ایل ال بیت کی رہنمائی پر عمل پیرا ہونے سے جوڑتا ہے۔\n\nتاریخی طور پر ، یہ اختلافات الگ الگ علمی فریم ورک سے پیدا ہوتے ہیں: سنی طافسر اکثر آیت کے فوری سماجی و اخلاقی مضمرات کو ترجیح دیتے ہیں ، جبکہ شیعہ تشریحات اسے والیا (الہٰی مقرر کردہ قیادت کی وفاداری) پر وسیع تر تعلیمات کے ساتھ مربوط کرتی ہیں۔ تاہم ، دونوں روایات ، رسمی طور پر مشاہدہ اور معاشرتی انصاف کے مابین لازم و ملزوم رابطے کو تقویت دیتی ہیں۔ یہ ایک اصول ہے جو صدقہ اور فرقہ وارانہ احتساب کے مسلم طریقوں کی تشکیل کرتا ہے۔ اس طرح آیت ایک یکجہتی اخلاقی نصیحت بنی ہوئی ہے ، یہاں تک کہ تشریحی عینک ہر روایت کی مذہبی ترجیحات کی عکاسی کرتے ہیں۔",
    "layer2short": "In Surah al-Maa’un, verse 4, the declaration *\"woe to those who pray\"* presents a profound theological paradox, as prayer (salat) is a pillar of Islam. Classical Shia exegetes resolve this tension by emphasizing the conditions and intentions that validate worship. Both Tabatabai in *Al-Mizan* and Tabrisi in *Majma al-Bayan* clarify that the verse targets those whose prayers are devoid of sincerity (ikhlas) and ethical substance, rendering their acts spiritually void despite outward observance. Tabrisi notes that the verse condemns *\"the performers of prayer who are heedless of its essence\"*—those who pray to be seen by others (riya’) or who neglect the social obligations integral to faith, as highlighted in subsequent verses (e.g., denying sustenance to orphans and the poor).",
    "layer2short_urdu": "سورہ المعون ، آیت 4 میں ، اعلامیہ * \"ان لوگوں کے لئے افسوس ہے جو دعا کرتے ہیں\" * ایک گہرا مذہبی تضاد پیش کرتا ہے ، کیونکہ دعا (صلام) اسلام کا ایک ستون ہے۔ کلاسیکی شیعہ استثنیٰ اس تناؤ کو ان حالات اور ارادوں پر زور دے کر حل کریں جو عبادت کی توثیق کرتے ہیں۔ * العزان * اور تبریسی دونوں تبتابائی * میں * مجس البیان * میں یہ واضح کرتے ہیں کہ یہ آیت ان لوگوں کو نشانہ بناتی ہے جن کی دعائیں اخلاص (اخلا) اور اخلاقی مادے سے عاری ہیں ، ظاہری طور پر منانے کے باوجود ان کے اعمال کو روحانی طور پر باطل قرار دیتے ہیں۔ تبریسی نے نوٹ کیا ہے کہ آیت کی مذمت کی گئی ہے *\"نماز کے اداکار جو اس کے جوہر سے غفلت رکھتے ہیں\" * - وہ لوگ جو دوسروں (ریا ’) کو دیکھنے کی دعا کرتے ہیں یا جو معاشرتی ذمہ داریوں کو عقیدے سے لازمی طور پر نظرانداز کرتے ہیں ، جیسا کہ بعد کی آیات میں روشنی ڈالی گئی ہے (جیسے ، یتیموں اور غریبوں سے رزق کی تردید کرنا)۔"
  },
  "5": {
    "layer1": "In Surah Al-Maa’un (107:5), Allah describes a grave spiritual flaw among those who neglect their prayer: *“alladhīna hum ‘an salātihim sāhūn”* – “who are heedless of their prayer.” This verse, revealed in Makkah, targets individuals who perform ritual acts of worship mechanically while lacking mindfulness and sincerity. The surah as a whole condemns hypocrisy, linking neglect of prayer with cruelty toward orphans and the needy, exposing how empty ritualism contradicts true faith.  \n\nThe key term *sāhūn* derives from *sahw* (forgetfulness or negligence), but in this context, it signifies a deliberate spiritual apathy – not mere forgetfulness. Classical Shia commentators like Allamah Tabatabai in *Tafsir al-Mizan* explain that this heedlessness manifests in two ways: **delaying prayers** beyond their prescribed times (a major concern in Shia fiqh) and **lacking presence of heart** during prayer. The Ahlul Bayt emphasized that salah is a meeting with Allah; Imam Ali called it “the ascension of the believer,” requiring both physical discipline and inner awakening.  \n\nHistorically, this verse criticized the Quraysh’s hypocrites who performed prayers ostentatiously but oppressed the vulnerable. Today, it warns against reducing salah to a rushed habit, checking boxes without reflection. Modern distractions – phones, worries, or preoccupation with worldly matters – make *sahw* a widespread challenge. The verse calls Muslims to protect prayer’s sanctity by observing its timings (avoiding delays emphasized in Shia jurisprudence), minimizing distractions, and cultivating *khushu* (humility and focus).  \n\nPractically, this means preparing mentally before prayer, understanding its words, and letting it reshape our conduct. As Imam Sadiq taught, “The one whose prayer doesn’t restrain them from evil gains nothing from Allah but distance.” Surah Al-Maa’un reminds us that true prayer nurtures both personal piety and social conscience – it’s meaningless if we pray yet ignore others’ suffering. By guarding our salah from heedlessness, we align our hearts with the justice and mercy Islam demands.",
    "layer2": "In Surah al-Maa’un (107:5), the phrase *\"those who are heedless of their prayer\"* (alladhīna hum ‘an ṣalātihim sāhūn) is interpreted by classical Shia exegetes as a condemnation of those who neglect the spiritual and practical obligations of ṣalāt. Both theological and jurisprudential dimensions are emphasized in Shia commentaries, reflecting the integral role of prayer in sustaining faith and social responsibility.  \n\nAl-Tabrisi in *Majma al-Bayan* explains that *sāhūn* (heedless) denotes negligence in multiple forms: delaying prayers beyond their prescribed times, performing them without proper attention (*khushu'*), or abandoning their inner essence while maintaining outward form. He cites narrations from Imam Jafar al-Sadiq emphasizing that true prayer requires the heart’s presence alongside physical submission, as mechanical repetition devoid of consciousness of God fails to fulfill its purpose. This aligns with the Shia theological principle that acts of worship are invalid without sincere intention (*niyya*) and spiritual awareness (*tawajjuh*), as underscored in the Hadith literature of the Ahl al-Bayt.  \n\nAl-Tabtabai in *Al-Mizan* expands this critique to a broader ethical framework, linking neglect of prayer to moral hypocrisy. He argues that those \"heedless\" in prayer are often the same individuals who deny accountability (vv. 1-4), highlighting the Quranic theme that outward acts of worship must align with inward conviction and social justice. The verse thus serves as a rebuke against compartmentalizing ritual and ethics—a cornerstone of Shia spirituality, which views prayer as a transformative act that necessitates compassion for the marginalized (exemplified in the subsequent verses on withholding charity).  \n\nClassical Shia jurisprudence further contextualizes this verse through rulings on *ada* (timely prayer) and *qada* (makeup prayers), stressing that deliberate delay without valid excuse is spiritually perilous. The integration of legal rigor and spiritual intentionality in Shia exegesis underscores the holistic vision of Islam as both doctrine and praxis, rooted in the teachings of the Imams.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Maa’un 107:5—criticizing those “heedless of their prayer”—is interpreted not merely as a critique of ritual negligence but as a profound warning against disconnecting worship from social ethics. Ayatollah Naser Makarem Shirazi, in his *Tafsir-e Namune*, emphasizes that *salah* (prayer) is a spiritual anchor meant to cultivate mindfulness (*muraqaba*) and social responsibility. Neglecting its essence—by rushing through motions or divorcing it from moral action—renders prayer hollow, aligning with the verse’s condemnation. Modern scholars like Sayyid Kamal al-Haydari extend this, framing “heedlessness” as a symptom of today’s hyper-distracted world, where digital overload and performative religiosity dilute sincere devotion.\n\nNeuroscientific research on mindfulness, such as studies by Dr. Amishi Jha on attention training, parallels classical Islamic concepts of *khushu* (humility in prayer). These findings suggest that distracted prayer fails to activate the prefrontal cortex’s focus centers, diminishing its psychological benefits. Socially, the verse resonates with critiques of individualism; as scholar Dr. Liyakat Takim notes, prayer divorced from empathy fuels societal neglect, echoing the surah’s subsequent condemnation of denying “small kindnesses” (107:3). In an era of global inequality and climate crisis, heedless worship reflects a broader moral apathy—praying without advocating for justice or aiding the vulnerable.\n\nInterfaith dialogues, such as those led by the Al-Khoei Foundation, highlight shared concerns: Buddhist teachings on “mindful action” and Jewish *kavanah* (intentionality) in prayer mirror Islam’s call for conscious worship. This verse thus becomes a universal plea: transcend ritual automatism to nurture a spiritually attuned, socially engaged humanity.",
    "layer4": "In Surah Al-Maa'un, verse 5 condemns those who are \"heedless of their prayer\"—a spiritual malady the Ahlul Bayt (peace be upon them) diagnose as a symptom of a deeper disconnect from divine consciousness. Imam Ali (as) taught that \"prayer is the pillar of your religion; whoever neglects it demolishes the pillars of their faith\" (*Bihar al-Anwar*). The \"heedlessness\" here is not merely physical distraction but a failure to recognize prayer as a direct communion with Allah, facilitated by the luminous guidance of the Imams (as), who are the gateways to divine knowledge.  \n\nThe Sixth Imam, Ja'far al-Sadiq (as), explained that true prayer requires *khushu'* (humility) and *hudur al-qalb* (presence of heart), stating: \"When you stand for prayer, let your heart stand in awe of Allah, for He says, *'Successful are the believers who are humble in their prayers'* (23:1-2). The one whose prayer does not restrain them from evil will only increase in distance from Allah\" (*Al-Kafi*). This heedlessness, the Imams warn, stems from prioritizing worldly attachments over the remembrance of the Divine, a betrayal of the covenant of *Wilayah*—the spiritual guardianship of the Ahlul Bayt, which roots faith in both inward purity and outward justice.  \n\nLady Fatimah (as) emphasized that prayer is a \"light for the heart\" and a means to \"purify the soul from arrogance\" (*Bihar al-Anwar*). To cure heedlessness, the Imams taught believers to prepare for prayer by reflecting on Allah’s greatness, reciting supplications like *Du'a Kumayl* to seek protection from negligence, and consciously linking each movement in prayer to the recognition of Imamah—the living guidance of the Imams. Practically, this demands cultivating mindfulness through daily *muraqaba* (self-vigilance), studying the meanings of prayer’s verses, and embodying the social justice ethos of Surah Al-Maa'un by caring for the marginalized—for neglecting others’ rights is itself a form of heedlessness toward the Divine.",
    "layer1_urdu": "سورہ المحون (107: 5) میں ، اللہ ان لوگوں میں ایک سنگین روحانی خامی کو بیان کرتا ہے جو اپنی دعا کو نظرانداز کرتے ہیں: * \"اللادھانا ہم‘ ایک سالٹیہیم سحن \" *-\" جو ان کی دعا سے پرہیز نہیں ہیں۔ \" یہ آیت ، مکہ مکرمہ میں انکشاف کی گئی ہے ، جو ان افراد کو نشانہ بناتی ہے جو ذہنیت اور اخلاص کی کمی کے ساتھ میکانکی طور پر رسمی عمل انجام دیتے ہیں۔ سورتھ مجموعی طور پر منافقت کی مذمت کرتا ہے ، اور یتیموں اور مسکینوں کے خلاف ظلم کے ساتھ نماز کی نظرانداز کو جوڑتا ہے ، اور اس بات کو بے نقاب کرتا ہے کہ خالی رسومیت کس طرح حقیقی عقیدے سے متصادم ہے۔  \n\nکلیدی اصطلاح * سہن * * ساہو * (فراموشی یا غفلت) سے ماخوذ ہے ، لیکن اس تناظر میں ، یہ جان بوجھ کر روحانی بے حسی کی نشاندہی کرتا ہے - محض فراموشی نہیں۔ کلاسیکی شیعہ مبصرین جیسے الامہ تبتابائی*ٹافسیر ال میزان*میں وضاحت کرتے ہیں کہ یہ غفلت دو طریقوں سے ظاہر ہوتی ہے: ** نماز میں تاخیر ** ان کے مقررہ اوقات سے بالاتر (شیعہ فیقہ میں ایک بڑی تشویش) اور ** دل کی موجودگی کا فقدان **۔ اہل بیت نے اس بات پر زور دیا کہ صلاح اللہ کے ساتھ ایک ملاقات ہے۔ امام علی نے اسے \"مومن کا عروج\" کہا ، جس میں جسمانی نظم و ضبط اور اندرونی بیداری دونوں کی ضرورت ہوتی ہے۔  \n\nتاریخی طور پر ، اس آیت نے قریش کے منافقوں کو تنقید کا نشانہ بنایا جنہوں نے نماز پڑھائی اور کمزوروں پر ظلم کیا۔ آج ، اس نے صلاح کو جلدی عادت میں کم کرنے ، بغیر کسی عکاسی کے خانوں کی جانچ پڑتال کے خلاف متنبہ کیا ہے۔ جدید خلفشار - فون ، پریشانیوں ، یا دنیاوی معاملات میں مشغولیت - * SAHW * کو ایک وسیع چیلنج بنائیں۔ آیت میں مسلمانوں کو اپنے اوقات کا مشاہدہ کرکے نماز کے تقدس کو بچانے کے لئے کہا گیا ہے (شیعہ فقہ میں تاخیر سے پرہیز کرنا) ، خلفشار کو کم سے کم کرنا ، اور * خوشو * (عاجزی اور توجہ) کاشت کرنا۔  \n\nعملی طور پر ، اس کا مطلب یہ ہے کہ نماز سے پہلے ذہنی طور پر تیاری کریں ، اس کے الفاظ کو سمجھیں ، اور اس کو ہمارے طرز عمل کو نئی شکل دینے دیں۔ جیسا کہ امام صادق نے سکھایا ، \"جس کی دعا ان کو برائی سے روکتی نہیں ہے اس سے اللہ سے فاصلے کے سوا کچھ نہیں ملتا ہے۔\" سوراہ المعون ہمیں یاد دلاتی ہے کہ حقیقی دعا ذاتی تقویٰ اور معاشرتی ضمیر دونوں کی پرورش کرتی ہے-اگر ہم دعا کرتے ہیں تو یہ بے معنی ہے۔ اپنے صلاح کو لاپرواہی سے بچانے کے بعد ، ہم اپنے دلوں کو انصاف اور رحمت اسلام کے مطالبات کے مطابق بناتے ہیں۔",
    "layer2_urdu": "سور Surah المحون (107: 5) میں ، یہ جملہ * \"جو لوگ اپنی دعا سے لاپرواہی ہیں\" * (اللادھانا ہم ‘ایک التیہیم سحن) کو کلاسیکی شیعہ نے ان لوگوں کی مذمت کے طور پر تشریح کیا ہے جو الات کی روحانی اور عملی ذمہ داریوں کو نظرانداز کرتے ہیں۔ مذہبی اور فقہ دونوں جہتوں پر شیعہ تبصرے میں زور دیا جاتا ہے ، جو ایمان اور معاشرتی ذمہ داری کو برقرار رکھنے میں نماز کے لازمی کردار کی عکاسی کرتے ہیں۔  \n\n*ماجما البیان*میں الاتبریسی نے وضاحت کی ہے کہ*سہین*(لاپرواہ) متعدد شکلوں میں غفلت کی نشاندہی کرتا ہے: ان کے مقررہ اوقات سے آگے دعاوں میں تاخیر ، ان کو مناسب توجہ کے بغیر انجام دینا (*خوشو '*) ، یا ظاہری شکل کو برقرار رکھتے ہوئے ان کے اندرونی جوہر کو ترک کرنا۔ انہوں نے امام جعفر السادق کی روایات کا حوالہ دیتے ہوئے اس بات پر زور دیا ہے کہ حقیقی دعا کے ساتھ جسمانی تحویل کے ساتھ ساتھ دل کی موجودگی کی بھی ضرورت ہوتی ہے ، کیونکہ مکینیکل تکرار خدا کے شعور سے خالی ہے اس کے مقصد کو پورا کرنے میں ناکام ہے۔ یہ شیعہ مذہبی اصول کے ساتھ منسلک ہے کہ عبادت کے کام مخلص ارادے (*نیایا*) اور روحانی آگاہی (*تاواججوہ*) کے بغیر غلط ہیں ، جیسا کہ اہل البیٹ کے حدیث ادب میں اس کی نشاندہی کی گئی ہے۔  \n\n* المزان * میں الاتبٹابائی نے اس تنقید کو ایک وسیع تر اخلاقی فریم ورک کی طرف بڑھایا ، اور نماز کی نظرانداز کو اخلاقی منافقت سے جوڑ دیا۔ ان کا استدلال ہے کہ نماز میں وہ \"لاپرواہ\" اکثر وہی افراد ہوتے ہیں جو احتساب کی تردید کرتے ہیں (vv. 1-4) ، قرآنی موضوع کو اجاگر کرتے ہیں کہ ظاہری عبادتوں کو اندرونی اعتراف اور معاشرتی انصاف کے ساتھ ہم آہنگ ہونا چاہئے۔ اس طرح یہ آیت رسم اور اخلاقیات کو کمپارٹمنٹلائز کرنے کے خلاف سرزنش کا کام کرتی ہے۔ یہ شیعہ روحانیت کا ایک سنگ بنیاد ہے ، جو نماز کو ایک تغیراتی عمل کے طور پر دیکھتا ہے جو پسماندہ افراد کے لئے ہمدردی کی ضرورت ہے (اس کے نتیجے میں ہونے والی آیات میں اس کی مثال کے بعد)  \n\nکلاسیکی شیعہ فقہ اس آیت کو * اڈا * (بروقت دعا) اور * قادا * (میک اپ کی نماز) کے فیصلوں کے ذریعے مزید سیاق و سباق سے دوچار کرتی ہے ، اس بات پر زور دیتے ہوئے کہ جان بوجھ کر تاخیر کے بغیر کسی عذر کے تاخیر روحانی طور پر خطرناک ہے۔ شیعہ میں قانونی سختی اور روحانی ارادے کا انضمام اسلام کے جامع وژن کو نظریے اور پراکسیوں کی حیثیت سے واضح کرتا ہے ، جو اماموں کی تعلیمات میں شامل ہے۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سورہ المعون 107: 5-ان لوگوں کو \"ان کی دعا سے لاپرواہ\" قرار دینا-جس کی ترجمانی محض رسمی غفلت کے نقاد کے طور پر نہیں بلکہ معاشرتی اخلاقیات سے منقطع عبادت کے خلاف ایک گہری انتباہ کے طور پر کی گئی ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے*طافسیر نامون*میں ، اس بات پر زور دیا ہے کہ*صلاح*(دعا) ایک روحانی اینکر ہے جس کا مقصد ذہن سازی (*مرقابا*) اور معاشرتی ذمہ داری کو فروغ دینا ہے۔ اس کے جوہر کو نظرانداز کرنا - حرکات کے ذریعے جلدی کرنے یا اخلاقی کارروائی سے طلاق لینے کے بعد - دعا کے کھوکھلے کو روکتا ہے ، آیت کی مذمت کے ساتھ منسلک ہوتا ہے۔ سید کمال الحیداری جیسے جدید اسکالرز اس میں توسیع کرتے ہیں ، جو آج کی انتہائی مستعمل دنیا کی علامت کے طور پر \"غفلت\" کو تیار کرتے ہیں ، جہاں ڈیجیٹل اوورلوڈ اور پرفارمنس مذہبی مذہبی مخلصانہ عقیدت کو کم کرتے ہیں۔\n\nذہنیت کے بارے میں اعصابی تحقیق ، جیسے ڈاکٹر امیشی جھا کی توجہ کی تربیت پر مطالعے ، * خوشو * (دعا میں عاجزی) کے کلاسیکی اسلامی تصورات کے متوازی ہیں۔ ان نتائج سے پتہ چلتا ہے کہ مشغول دعا اس کے نفسیاتی فوائد کو کم کرتے ہوئے پریفرنٹل پرانتستا کے فوکس مراکز کو چالو کرنے میں ناکام ہوجاتی ہے۔ معاشرتی طور پر ، آیت انفرادیت کے نقادوں کے ساتھ گونجتی ہے۔ جیسا کہ اسکالر ڈاکٹر لیاکات تکیم نوٹ کرتے ہیں ، ہمدردی سے نمٹنے سے طلاق سوسائٹی کو نظرانداز کرتی ہے ، اور اس کے نتیجے میں \"چھوٹی چھوٹی مہربانیوں\" سے انکار کرنے کی سورت کی مذمت کی بازگشت ہوتی ہے (107: 3)۔ عالمی عدم مساوات اور آب و ہوا کے بحران کے ایک دور میں ، لاپرواہ عبادت ایک وسیع تر اخلاقی بے حسی کی عکاسی کرتی ہے۔\n\nبین المذاہب مکالمے ، جیسے الخوئی فاؤنڈیشن کی سربراہی میں ، مشترکہ خدشات کو اجاگر کرتے ہیں: \"ذہن سازی کی کارروائی\" اور یہودی * کاوانا * (ارادے) پر بدھ مت کی تعلیمات برائے نماز آئینہ میں اسلام کی شعوری عبادت کے لئے مطالبہ۔ اس طرح یہ آیت ایک عالمگیر التجا بن جاتی ہے: روحانی طور پر منسلک ، معاشرتی طور پر مصروف انسانیت کی پرورش کے لئے رسمی آٹومیٹزم کو عبور کریں۔",
    "layer4_urdu": "سورہ المعون میں ، آیت 5 ان لوگوں کی مذمت کرتی ہے جو \"ان کی دعا سے لاپرواہ\" ہیں۔ امام علی (ع) نے سکھایا کہ \"دعا آپ کے مذہب کا ستون ہے۔ جو شخص اسے نظرانداز کرتا ہے وہ ان کے عقیدے کے ستونوں کو مسمار کرتا ہے\" (*بہار الانور*)۔ یہاں \"غم و غصہ\" محض جسمانی خلفشار نہیں ہے بلکہ اللہ کے ساتھ براہ راست میل جول کے طور پر نماز کو تسلیم کرنے میں ناکامی ہے ، جو اماموں (ع) کی برائٹ رہنمائی کے ذریعہ سہولت فراہم کرتی ہے ، جو خدائی علم کے دروازے ہیں۔  \n\nچھٹے امام ، جافر السادق (ع) ، نے وضاحت کی کہ سچی دعا کے لئے * خوشی ' * (عاجزی) اور * ہدور القلب * (دل کی موجودگی) کی ضرورت ہوتی ہے ، اور کہا: \"جب آپ دعا کے لئے کھڑے نہیں ہوتے ہیں تو ، آپ کے دل سے اللہ تعالی کے ساتھ حیرت کا سامنا کرنا پڑتا ہے ، کیونکہ وہ کہتے ہیں کہ ان کی نماز میں ہی ان کی دعا میں ہمبھٹی ہیں۔ اللہ سے فاصلے میں اضافہ \"(*الکفی*)۔ یہ غفلت ، اماموں نے انتباہ کیا ہے کہ وہ خدائی یادوں پر دنیاوی منسلکات کو ترجیح دینے سے پیدا ہوتا ہے ، جو *ویلیح *کے عہد نامے کا دھوکہ ہے - جو اہل بیت کی روحانی سرپرستی ہے ، جو اندرونی پاکیزگی اور ظاہری انصاف دونوں پر اعتماد کرتی ہے۔  \n\nلیڈی فاطمہ (ع) نے اس بات پر زور دیا کہ دعا \"دل کے لئے روشنی\" ہے اور \"روح کو تکبر سے پاک کرنے\" کا ایک ذریعہ ہے (*بہار الانور*)۔ غفلت کا علاج کرنے کے لئے ، اماموں نے مومنوں کو اللہ کی عظمت پر غور کرتے ہوئے ، * ڈو کمائل * جیسی التجا کی تیاری کرنے کی تعلیم دی تھی تاکہ وہ غفلت سے تحفظ حاصل کریں ، اور اماموں کی زندہ رہنمائی - امامہ کی پہچان کے ساتھ نماز میں ہر تحریک کو شعوری طور پر جوڑیں۔ عملی طور پر ، اس کا مطالبہ ہے کہ وہ روزانہ * مرقابا * (خود نظرانداز) کے ذریعہ ذہنیت کو فروغ دینے کا مطالبہ کرتا ہے ، نماز کی آیات کے معنی کا مطالعہ کرتا ہے ، اور مشترکہ طور پر دوسروں کے حقوق کو نظرانداز کرنے کے لئے سروہ المحون کے معاشرتی انصاف کے اخلاق کو مجسم بناتا ہے۔",
    "layer5": "In interpreting Surah Al-Maa’un 107:5, both Shia and Sunni scholars converge on the verse’s condemnation of negligence in prayer, understood as a grave spiritual failing. Classical exegetes across traditions, including Sunni authorities like Tabari and Shia scholars such as Tusi, agree that the phrase “heedless of their prayer” broadly denotes neglect of prayer’s prescribed form or timing. Ibn Kathir and Qurtubi emphasize the outward dimension of this negligence, linking it to delaying prayers beyond their appointed times (Qurtubi) or performing them without proper reverence (Ibn Kathir), reflecting Sunni jurisprudence’s focus on adherence to ritual structure. Similarly, Shia sources like Tabrisi’s *Majma al-Bayan* and Tabatabai’s *Al-Mizan* stress the obligation to observe prayer timings and physical postures, underscoring a shared emphasis on ritual fidelity.\n\nDivergences emerge in theological nuance. Sunni commentators such as Razi frame negligence as hypocrisy (*nifaq*), interpreting the verse as censuring those who pray publicly but abandon prayer privately (Qurtubi), aligning with Sunni theological concerns about insincerity. Shia exegesis, particularly in *Tafsir al-Qummi* and Tabatabai’s works, extends the critique to a lack of inner presence (*khushu’*), emphasizing the heart’s engagement as integral to prayer’s validity—a reflection of the Shia emphasis on the Imam’s teachings as guides to spiritual depth. This distinction arises from differing theological priorities: Sunni legalism often prioritizes outward compliance with textual and juridical norms, while Shia thought, influenced by the Imams’ esoteric teachings, intertwines ritual with spiritual intentionality.\n\nHistorically, these interpretations reflect distinct scholarly trajectories. Sunni exegesis developed within frameworks of legal schools (*madhhabs*) prioritizing communal practice, whereas Shia tafsir integrated the Imams’ hermeneutics, enriching ritual with metaphysical dimensions. Both traditions, however, unite in viewing the verse as a moral exhortation to uphold prayer’s physical and spiritual integrity.",
    "layer5_urdu": "سوراہ المعون 107: 5 کی ترجمانی کرتے ہوئے ، شیعہ اور سنی اسکالرز دونوں ہی اس آیت کی نماز میں غفلت کی مذمت کرتے ہیں ، جسے ایک سنگین روحانی ناکامی سمجھا جاتا ہے۔ روایات میں کلاسیکی استثنیٰ ، بشمول تبرری اور شیعہ اسکالرز جیسے توسی جیسے سنی حکام ، اس بات سے اتفاق کرتے ہیں کہ \"ان کی دعا سے غفلت\" کے فقرے میں نماز کی مقررہ شکل یا وقت کی نظرانداز کی نشاندہی کی گئی ہے۔ ابن کتھیر اور قرچوبی اس غفلت کی ظاہری جہت پر زور دیتے ہیں ، اور اسے اپنے مقررہ اوقات (قربانی) سے آگے دعاوں میں تاخیر سے منسلک کرتے ہیں یا ان کو مناسب عقیدت کے بغیر انجام دیتے ہیں (ابن کتھیر) ، جو رسمی ڈھانچے پر عمل پیرا ہونے پر سنی فقہ کی توجہ کی عکاسی کرتے ہیں۔ اسی طرح ، شیعہ ذرائع جیسے تبریسی کے * ماجما البیان * اور تبتابائی کے * المزان * جیسے نماز کے اوقات اور جسمانی کرنسیوں کا مشاہدہ کرنے کی ذمہ داری پر زور دیتے ہیں ، اور رسمی وفاداری پر مشترکہ زور دیتے ہیں۔\n\nمذہبی نوادرات میں تفریق پیدا ہوتی ہے۔ سنی مبصرین جیسے ریزی فریم غفلت کے طور پر غفلت (*نیفیک*) ، اس آیت کی ترجمانی کرتے ہیں کہ جو عوامی طور پر دعا کرتے ہیں لیکن نجی طور پر نماز پڑھتے ہیں (قربانی) ، غیر سنجیدگی کے بارے میں سنی مذہبی خدشات کے ساتھ صف بندی کرتے ہیں۔ شیعہ ایکجیسیس ، خاص طور پر*طافسیر القمی*اور تبتابائی کے کاموں میں ، تنقید کو اندرونی موجودگی (*خوشو ’*) کی کمی کی طرف بڑھاتا ہے ، جس میں دل کی شمولیت کو نماز کی صداقت کے لئے لازمی قرار دیتے ہیں۔ یہ امتیاز مختلف مذہبی ترجیحات سے پیدا ہوتا ہے: سنی قانونی حیثیت اکثر متنی اور فقہی اصولوں کے ساتھ ظاہری تعمیل کو ترجیح دیتی ہے ، جبکہ شیعہ کے خیال میں ، جو اماموں کی باطنی تعلیمات سے متاثر ہوتا ہے ، روحانی ارادے کے ساتھ رسم کو جوڑتا ہے۔\n\nتاریخی طور پر ، یہ تشریحات الگ الگ علمی چالوں کی عکاسی کرتی ہیں۔ سنی ایکسیجیسیس نے قانونی اسکولوں کے فریم ورک (*مدھبس*) کے فرقوں کو فرقہ وارانہ عمل کو ترجیح دیتے ہوئے تیار کیا ، جبکہ شیعہ طافس نے استعاریاتی طول و عرض سے رسم کو افزودہ کرتے ہوئے ، اماموں کے ’ہرمینیٹکس کو مربوط کیا۔ تاہم ، دونوں روایات آیت کو نماز کی جسمانی اور روحانی سالمیت کو برقرار رکھنے کی اخلاقی نصیحت کے طور پر دیکھنے میں متحد ہوجاتی ہیں۔",
    "layer2short": "In Surah al-Maa’un (107:5), the phrase *\"those who are heedless of their prayer\"* (alladhīna hum ‘an ṣalātihim sāhūn) is interpreted by classical Shia exegetes as a condemnation of those who neglect the spiritual and practical obligations of ṣalāt. Both theological and jurisprudential dimensions are emphasized in Shia commentaries, reflecting the integral role of prayer in sustaining faith and social responsibility.  ",
    "layer2short_urdu": "سور Surah المحون (107: 5) میں ، یہ جملہ * \"جو لوگ اپنی دعا سے لاپرواہی ہیں\" * (اللادھانا ہم ‘ایک التیہیم سحن) کو کلاسیکی شیعہ نے ان لوگوں کی مذمت کے طور پر تشریح کیا ہے جو الات کی روحانی اور عملی ذمہ داریوں کو نظرانداز کرتے ہیں۔ مذہبی اور فقہ دونوں جہتوں پر شیعہ تبصرے میں زور دیا جاتا ہے ، جو ایمان اور معاشرتی ذمہ داری کو برقرار رکھنے میں نماز کے لازمی کردار کی عکاسی کرتے ہیں۔  "
  },
  "6": {
    "layer1": "In Surah Al-Maa’un, verse 6 condemns those who perform acts of worship or charity solely for public recognition, using the term *yura’un* (يُرَاءُونَ), derived from the root *r-ā-’* (راءى), meaning “to show off” or “to seek visibility.” This verse targets *riya* (رِيَاء), the sin of insincere devotion done to gain praise or social standing rather than divine pleasure. Classical Shia tafsir, such as Allama Tabatabai’s *Al-Mizan*, explains that this verse critiques the hypocrites of early Islamic society—specifically those in Mecca and Medina who performed rituals like prayer (*salah*) ostentatiously to appear righteous while neglecting the essence of faith, such as compassion and social justice. The verse connects to the broader themes of the surah, which contrasts hollow religiosity with genuine faith expressed through caring for orphans, feeding the needy, and upholding communal welfare.\n\nThe term *yura’un* implies a deliberate effort to craft a pious image, reducing worship to a transactional act for social validation. Shia teachings, particularly narrations from Imam Ali and Imam Sadiq, stress that *riya* invalidates good deeds, as Allah judges actions by their *niyyah* (intention). For contemporary Muslims, this verse is a timeless warning against performative religiosity, whether in public prayers, social media posts showcasing charity, or ritual acts divorced from moral integrity. It calls believers to purify their intentions (*ikhlas*), ensuring acts of worship and kindness stem solely from devotion to God. Practically, this means reflecting inwardly before acts of service: *Why am I doing this?* In an age of curated online personas, the verse urges humility and sincerity, reminding us that true faith thrives in quiet consistency, not applause. As Imam Ali taught, “The worth of deeds is measured by the intentions behind them”—a principle anchoring spiritual authenticity in every era.",
    "layer2": "In Surah al-Maa'un verse 6, Allah condemns \"those who make show [of their deeds]\" (alladhīna hum yurā'ūn), a condemnation rooted in the corruption of intention (niyyah) central to Shia ethical theology. Classical Shia exegetes emphasize that this verse exposes the spiritual peril of *riyā'* (ostentation) – performing acts of worship or charity not for divine pleasure but for worldly validation. \n\nAl-Tabrisi in *Majma al-Bayan* explains that *riyā'* invalidates the essence of worship, as acts become \"empty shells\" devoid of sincerity (ikhlas). He cites Imam Jafar al-Sadiq’s teaching that \"a small deed with sincerity is greater than a great deed with vanity,\" underscoring the Shia emphasis on the heart’s orientation over mere outward compliance. Al-Tabrisi further distinguishes between major *riyā'* (conscious performative acts) and subtle *riyā'* (hidden self-satisfaction), both of which corrode spiritual integrity.\n\nIn *Al-Mizan*, Allama Tabatabai situates this verse within the Surah’s broader critique of hypocritical religiosity. He argues that *riyā'* reflects a fundamental disconnection from the *ma'rifah* (divine recognition) required for valid worship, as it prioritizes creation over the Creator. This aligns with the Shia theological principle that deeds are judged by their alignment with the *maqam al-wilayah* (station of devotion to the Ahl al-Bayt), which necessitates purity of intent. \n\nShia jurisprudence, as articulated in works like *Sharh al-Lum'a*, treats *riyā'* as a nullifier of acts like prayer and charity if intention is corrupted. The verse thus serves as a moral-legal axis: true worship must harmonize outward action with inward sincerity, reflecting the Prophetic and Imamic teachings that \"actions are but by intentions\" (Hadith al-Niyyah). The condemnation of *riyā'* here ultimately reinforces the Shia vision of faith as an integrated reality of belief, ethics, and social responsibility.",
    "layer3": "In Surah Al-Maa’un (107:6), the Quran condemns those who perform acts of worship or charity “to be seen” (yura’un), a concept known as *riya* (ostentation). Contemporary Shia scholars, such as Ayatollah Naser Makarem Shirazi, emphasize that this verse critiques the erosion of sincerity in human conduct—a timeless concern amplified in today’s hyper-connected, image-driven world. Scholar Sayed Mohammed Al-Musawi notes that *riya* isn’t limited to ritual acts; it extends to performative activism, social media virtue-signaling, and even political posturing, where actions are tailored for public validation rather than divine or ethical purpose.  \n\nModern psychology offers insights here: studies on “impression management” (Leary, 1995) reveal how social media platforms incentivize curated self-presentation, creating a culture where worth is measured in likes and shares. This aligns with Imam Ali’s warning in *Nahj al-Balagha*: “The one who acts for other than God becomes a slave to what he seeks.” The verse thus speaks to the commodification of morality in an age of influencers and “clicktivism,” where causes are reduced to trends.  \n\nGlobally, this resonates with critiques of “greenwashing” by corporations or nations that tout sustainability efforts while perpetuating ecological harm. Interfaith parallels exist too: Buddhist teachings on “right intention” and Jesus’ rebuke of hypocritical piety (Matthew 6:1-4) echo the Quran’s call for authenticity.  \n\nIn multicultural societies, the verse challenges individuals and institutions to align actions with deeper values—whether in combating poverty (the Surah’s broader theme) or fostering justice. As Shia theologian Dr. Liyakat Takim argues, resisting *riya* requires grounding deeds in *ikhlas* (sincerity), transforming superficial gestures into sustained, systemic change. The verse becomes a mirror for our times: Are we serving humanity, or our own image?",
    "layer4": "In Surah Al-Maa'un, verse 6 condemns those who perform acts of worship *\"who make show [of their deeds]\"* (yurawuna), exposing the spiritual disease of *riya* (ostentation). The Ahlul Bayt (peace be upon them) taught that riya is a hidden shirk, a poison that nullifies the soul’s connection to Allah. Imam Ali (as) warned, *\"The deeds of a person who shows off are like a mirage – the thirsty one assumes it to be water, but when he reaches it, he finds nothing\"* (Ghurar al-Hikam). This metaphor reveals the emptiness of worship divorced from sincerity (ikhlas), which the Imams identified as the soul of all devotion.  \n\nLady Fatimah (as) emphasized that true worship must be rooted in *wilayah* – divine love and allegiance to Allah’s chosen guides. In her famed sermon, she declared, *\"Allah made faith the purification from polytheism,\"* teaching that riya is defeated by anchoring deeds in the recognition of Imamah. Imam Sadiq (as) explained that even minor acts done for Allah’s pleasure, like *\"a handful of water given to a dog,\"* surpass grand gestures tainted by hypocrisy (Al-Kafi).  \n\nThe Imams taught that riya stems from weakness in *tawhid* – forgetting that Allah alone witnesses the heart. To cure this, they advised daily self-accounting (muhasaba) and reciting *\"Ikhlas an-niyyah\"* (purify my intention) 10 times after prayers, as taught by Imam Zain al-Abidin (as) in Sahifa Sajjadiyya. True worship, they stressed, is to *\"act as if you see Allah, for if you do not see Him, He sees you\"* (Hadith of Ihsan). By aligning with the luminous guidance of the Ahlul Bayt, believers transform ritual into rapture, ensuring their deeds ascend beyond the prison of ego into the embrace of the Divine.",
    "layer1_urdu": "سوراہ المعون میں ، آیت 6 ان لوگوں کی مذمت کرتی ہے جو عام طور پر عوامی پہچان کے لئے عبادت یا خیرات کے عمل انجام دیتے ہیں ، اس کی جڑ * r-ā-’ * (راؤ) سے ماخوذ ہے ، جس کا مطلب ہے\" دکھائیں \"یا\" زمانے کی تلاش \"۔ اس آیت میں * ریا * (رِسیلیٰا) کو نشانہ بنایا گیا ہے ، جو الہی خوشی کے بجائے تعریف یا معاشرتی موقف کو حاصل کرنے کے لئے غیر سنجیدہ عقیدت کا گناہ ہے۔ کلاسیکی شیعہ طافسر ، جیسے علامہ تبتابائی کے*المزان*، نے وضاحت کی ہے کہ یہ آیت ابتدائی اسلامی معاشرے کے منافقوں پر تنقید کرتی ہے-خاص طور پر مکہ اور مدینہ میں جو لوگ نماز (*صلاح*) جیسے رسومات کو انجام دیتے ہیں ، جس میں عقیدے اور معاشرتی سوال کو نظرانداز کرتے ہوئے ظاہر ہوتا ہے ، جیسے ہم جنس اور معاشرتی سوال کو نظرانداز کرتے ہوئے۔ یہ آیت سورہ کے وسیع تر موضوعات سے منسلک ہے ، جو یتیموں کی دیکھ بھال ، ضرورت مندوں کو کھانا کھلانے اور فرقہ وارانہ فلاح و بہبود کو برقرار رکھنے کے ذریعے حقیقی عقیدے کے ساتھ کھوکھلی مذہب کا متضاد ہے۔\n\nاصطلاح * یوراون * ایک متقی شبیہہ تیار کرنے کی دانستہ کوشش کا مطلب ہے ، جس سے عبادت کو معاشرتی توثیق کے ل transaction ٹرانزیکشنل ایکٹ میں کم کیا جاسکتا ہے۔ شیعہ تعلیمات ، خاص طور پر امام علی اور امام صادق کی روایات ، اس بات پر زور دیتے ہیں کہ * ریا * اچھ deeds ے کاموں کو غلط بناتا ہے ، کیونکہ اللہ ان کے * نیہہ * (نیت) کے ذریعہ کام کرتا ہے۔ عصری مسلمانوں کے لئے ، یہ آیت پرفارمنس مذہبییت کے خلاف ایک لازوال انتباہ ہے ، چاہے عوامی دعاؤں میں ، سوشل میڈیا پوسٹوں میں صدقہ کی نمائش کی جائے ، یا اخلاقی سالمیت سے طلاق شدہ رسم کی کارروائیوں۔ اس میں مومنین کو اپنے ارادوں (*آئخلاس*) کو پاک کرنے کا مطالبہ کیا گیا ہے ، اور یہ یقینی بناتا ہے کہ عبادت اور مہربانی کے عمل کو یقینی بنائے۔ عملی طور پر ، اس کا مطلب خدمت کے عمل سے پہلے اندرونی طور پر عکاسی کرنا ہے: * میں یہ کیوں کر رہا ہوں؟ جیسا کہ امام علی نے سکھایا ، \"ان کے پیچھے کے ارادوں سے اعمال کی قدر کی جاتی ہے\" - یہ ایک اصول ہر دور میں روحانی صداقت کو لنگر انداز کرتا ہے۔",
    "layer2_urdu": "سورہ المحون آیت 6 میں ، اللہ تعالی نے \"ان لوگوں کو جو اپنے اعمال کو ظاہر کرتے ہیں\" کی مذمت کرتے ہیں (اللادھنہ ہم یوری ū ū) ، جو شیعہ اخلاقی الہیات کے مرکزی ارادے (نیہ) کی بدعنوانی (نیہہ) کی بدعنوانی میں جکڑی ہوئی مذمت کی گئی ہے۔ کلاسیکی شیعہ استثنیٰ اس بات پر زور دیتے ہیں کہ یہ آیت * ریائی ' * (اوسٹینٹیشن) کے روحانی خطرے کو بے نقاب کرتی ہے - عبادت یا خیرات کے کام انجام دے رہی ہے جو خدائی خوشی کے لئے نہیں بلکہ دنیاوی توثیق کے لئے ہے۔ \n\n* ماجما البیان * میں الاتبریسی نے وضاحت کی ہے کہ * ریا ā ' * عبادت کے جوہر کو باطل کرتا ہے ، کیونکہ کام \"خالی گولے\" اخلاص سے خالی ہوجاتے ہیں (اخلاس)۔ انہوں نے امام جعفر السادق کی اس تعلیم کا حوالہ دیا ہے کہ \"اخلاص کے ساتھ ایک چھوٹا سا عمل باطل کے ساتھ ایک عظیم عمل سے زیادہ ہے ،\" محض ظاہری تعمیل پر دل کے رجحان پر شیعہ پر زور دینے پر زور دیتا ہے۔ الاتبریسی نے میجر * ریا ā ' * (شعوری کارکردگی کا مظاہرہ کرنے والی کارروائیوں) اور لطیف * ریا ā' * (پوشیدہ خود اطمینان) کے درمیان مزید فرق کیا ہے ، یہ دونوں ہی روحانی سالمیت کو کور کرتے ہیں۔\n\n*المزان *میں ، علامہ تبتابائی اس آیت کو منافقانہ مذہب کے منافقت کے وسیع تر نقاد کے اندر اس آیت میں پیش کرتا ہے۔ ان کا استدلال ہے کہ * ریا ā ' * درست عبادت کے ل required مطلوبہ * ماورفاہ * (خدائی پہچان) سے بنیادی منقطع ہونے کی عکاسی کرتا ہے ، کیونکہ یہ تخلیق کار پر تخلیق کو ترجیح دیتا ہے۔ یہ شیعہ مذہبی اصول کے ساتھ صف بندی کرتا ہے کہ اعمال ان کی * کومم الویلیح * (اے ایچ ایل ال بیت کے لئے عقیدت کا اسٹیشن) کے ساتھ ان کی سیدھ سے اندازہ لگایا جاتا ہے ، جس میں ارادے کی پاکیزگی کی ضرورت ہوتی ہے۔ \n\nشیعہ فقہ ، جیسا کہ *شارح ال لوم'ا *جیسے کاموں میں بیان کیا گیا ہے ، *ریائی ' *کو نماز اور خیرات جیسی حرکتوں کا ایک نالی کے طور پر پیش کرتا ہے اگر ارادے میں بدعنوانی ہو۔ اس طرح یہ آیت اخلاقی قانونی محور کے طور پر کام کرتی ہے: حقیقی عبادت کو بیرونی عمل کو باطنی اخلاص کے ساتھ ہم آہنگ کرنا چاہئے ، جس سے پیشن گوئی اور امامک تعلیمات کی عکاسی ہوتی ہے کہ \"اعمال صرف ارادے سے ہیں\" (حدیث النیہ)۔ یہاں * ریا ā ' * کی مذمت بالآخر عقیدے کے شیعہ وژن کو عقیدے ، اخلاقیات اور معاشرتی ذمہ داری کی مربوط حقیقت کے طور پر تقویت دیتی ہے۔",
    "layer3_urdu": "سورہ المحون (107: 6) میں ، قرآن نے ان لوگوں کی مذمت کی ہے جو \"دیکھے جانے والے\" (یوراون) کی عبادت یا خیراتی کام انجام دیتے ہیں ، جو * ریاض * (اوسٹینٹیشن) کے نام سے جانا جاتا ہے۔ عصر حاضر کے شیعہ اسکالرز ، جیسے آیت اللہ ناصر مکریم شیرازی ، اس بات پر زور دیتے ہیں کہ اس آیت میں انسانی طرز عمل میں اخلاص کے کٹاؤ پر تنقید کی گئی ہے۔ اسکالر سید محمد الموسوی نے نوٹ کیا ہے کہ * ریا * رسمی کارروائیوں تک ہی محدود نہیں ہے۔ اس میں پرفارمنس سرگرمی ، سوشل میڈیا کی خوبی سگنلنگ ، اور یہاں تک کہ سیاسی پوسٹنگ تک پھیلا ہوا ہے ، جہاں اعمال خدائی یا اخلاقی مقصد کے بجائے عوامی توثیق کے لئے تیار کیے جاتے ہیں۔  \n\nجدید نفسیات یہاں بصیرت کی پیش کش کرتی ہے: \"تاثرات کے نظم و نسق\" (لیری ، 1995) کے مطالعے سے پتہ چلتا ہے کہ کس طرح سوشل میڈیا پلیٹ فارم کیوریٹڈ سیلف پریزنٹیشن کی حوصلہ افزائی کرتے ہیں ، جس سے ایسی ثقافت پیدا ہوتی ہے جہاں پسند اور حصص میں قدر کی پیمائش کی جاتی ہے۔ یہ *ناہج البالاگھا *میں امام علی کی انتباہ کے ساتھ صف بندی کرتا ہے: \"خدا کے لئے جو کام کرتا ہے وہ اس کی تلاش میں غلام بن جاتا ہے۔\" اس طرح یہ آیت اثر و رسوخ اور \"کلک ٹائیوزم\" کے دور میں اخلاقیات کی اجناس کی بات کرتی ہے ، جہاں وجوہات کو رجحانات میں کم کردیا جاتا ہے۔  \n\nعالمی سطح پر ، یہ کارپوریشنوں یا ممالک کے ذریعہ \"گرین واشنگ\" کے نقادوں سے گونجتا ہے جو ماحولیاتی نقصان کو برقرار رکھتے ہوئے استحکام کی کوششوں کو ختم کرتے ہیں۔ انٹرفیتھ کے متوازی بھی موجود ہیں: \"صحیح ارادے\" پر بدھ مت کی تعلیمات اور یسوع کی منافقت تقویٰ کی سرزنش (متی 6: 1-4) قرآن مجید کی صداقت کے مطالبے کی بازگشت ہے۔  \n\nکثیر الثقافتی معاشروں میں ، آیت افراد اور اداروں کو چیلنج کرتی ہے کہ وہ گہری اقدار کے ساتھ کاموں کو سیدھ میں لائیں - چاہے غربت (سورہ کا وسیع تر موضوع) کا مقابلہ کرنے میں یا انصاف کو فروغ دینے میں۔ جیسا کہ شیعہ مذہبی ماہر ڈاکٹر لییاکات تکیم نے استدلال کیا ، * ریا * کے خلاف مزاحمت کرنے کے لئے * آئخلاس * (اخلاص) میں گراؤنڈنگ ڈیڈز کی ضرورت ہے ، جس سے سطحی اشاروں کو مستقل ، نظامی تبدیلی میں تبدیل کیا جائے۔ آیت ہمارے زمانے کے لئے آئینہ بن جاتی ہے: کیا ہم انسانیت کی خدمت کر رہے ہیں ، یا اپنی ہی شبیہہ؟",
    "layer4_urdu": "سورہ المعون میں ، آیت 6 میں ان لوگوں کی مذمت کی گئی ہے جو عبادت کے اعمال انجام دیتے ہیں * \"جو [اپنے اعمال] کو ظاہر کرتے ہیں۔ اہل بیت (ان پر امن) نے سکھایا کہ ریا ایک پوشیدہ شرک ہے ، ایک زہر جو روح کے اللہ سے تعلق کو کالعدم قرار دیتا ہے۔ امام علی (ع) نے متنبہ کیا ، * \"ایک ایسے شخص کے اعمال جو دکھاتے ہیں وہ ایک سراب کی طرح ہوتے ہیں-پیاسا اسے پانی کا فرض کرتا ہے ، لیکن جب وہ اس تک پہنچ جاتا ہے تو اسے کچھ بھی نہیں ملتا ہے\" * (گھورار الحکام)۔ یہ استعارہ خلوص (اخلاس) سے طلاق یافتہ عبادت کے خالی پن کو ظاہر کرتا ہے ، جسے اماموں نے تمام عقیدت کی روح کے طور پر شناخت کیا۔  \n\nلیڈی فاطمہ (ع) نے اس بات پر زور دیا کہ حقیقی عبادت کو * ولیہ * میں جڑا ہونا چاہئے - اللہ کے منتخب کردہ رہنماؤں سے الہی محبت اور بیعت۔ اپنے مشہور خطبہ میں ، اس نے اعلان کیا ، * \"اللہ نے مذہب سے پاکیزگی سے بھر پور اعتماد کیا ،\" * یہ تعلیم دیتے ہوئے کہ ریا نے امامہ کی پہچان میں اینکرنگ کے اعمال سے شکست کھائی ہے۔ امام صادق (ع) نے وضاحت کی کہ یہاں تک کہ اللہ کی خوشنودی کے لئے بھی معمولی حرکتیں ، جیسے * \"کتے کو دیئے گئے ایک مٹھی بھر پانی ،\"  \n\nاماموں نے سکھایا کہ ریا * تاؤہد * میں کمزوری کا شکار ہے - یہ بھول کر کہ اللہ ہی دل کی گواہی دیتا ہے۔ اس کا علاج کرنے کے ل they ، انہوں نے روزانہ خود حساب کتاب (محسابا) اور * \"اخلاس ان نیہہ\" * کی تلاوت کرنے کا مشورہ دیا۔ انہوں نے زور دیا ، سچی عبادت ، * \"اس طرح عمل کرنا ہے جیسے آپ اللہ کو دیکھتے ہو ، کیونکہ اگر آپ اسے نہیں دیکھتے ہیں تو ، وہ آپ کو دیکھتا ہے\" * (احسن کی حدیث)۔ اہل بیت کی برائٹ رہنمائی کے ساتھ سیدھ میں کرکے ، مومنین رسم کو بے خودی میں تبدیل کرتے ہیں ، اور ان کے اعمال کو انا کی جیل سے باہر الہی کو گلے لگانے میں یقینی بناتے ہیں۔",
    "layer5": "):  \nThe condemnation of *riya* (ostentation) in 107:6 is addressed uniformly across Islamic traditions as a grave spiritual malady. Both Shia and Sunni exegetes concur that the verse rebukes those who perform acts of worship—particularly prayer and charity—to gain social admiration rather than divine pleasure. Tabatabai (Al-Mizan) and Ibn Kathir similarly emphasize that sincerity (*ikhlas*) is the cornerstone of valid worship, citing Prophet Muhammad’s warnings against hidden polytheism (*shirk khafi*) through performative piety. Qurtubi and Tabrisi (Majma al-Bayan) both contextualize the verse within the Meccan society’s moral decline, where hypocritical displays of generosity were used to marginalize the vulnerable.  \n\nDivergences emerge in theological framing. Shia commentaries, particularly in Tusi’s At-Tibyan and Qummi’s Tafsir, often link *riya* to a broader rejection of *wilayah* (allegiance to divinely appointed leadership), interpreting insincere worship as symptomatic of resisting the Ahl al-Bayt’s guidance. Sunni scholars like Razi (Mafatih al-Ghayb) and Tabari focus on individual intention (*niyyah*), situating *riya* within debates on faith (*iman*) and its relationship to deeds, without explicit ties to leadership disputes.  \n\nThese differences reflect distinct historical developments. Shia interpretations evolved within discourses on legitimate authority post the Prophet, intertwining spiritual sincerity with loyalty to the Imams. Sunni exegesis, as seen in Ibn Kathir’s emphasis on the Companions’ consensus, prioritizes communal ethics and individual accountability.  \n\nPractically, both traditions stress self-scrutiny in worship. However, Shia spirituality often incorporates devotion to the Imams as a safeguard against hypocrisy, while Sunni ethical frameworks emphasize the Prophet’s *Sunnah* as the primary guide. These nuanced differences illustrate how shared Quranic principles are enriched by diverse hermeneutical traditions rooted in early Islamic theological priorities.",
    "layer5_urdu": "):  \n107: 6 میں * ریا * (اوسٹینٹیشن) کی مذمت کو اسلامی روایات میں یکساں طور پر ایک سنگین روحانی بیماری کے طور پر حل کیا گیا ہے۔ شیعہ اور سنی دونوں نے اس بات پر اتفاق کیا کہ یہ آیت ان لوگوں کو سرزنش کرتی ہے جو آسمانی خوشی کے بجائے معاشرتی تعریف حاصل کرنے کے لئے عبادت کے کاموں - خاص طور پر نماز اور خیراتی ادارے کو انجام دیتے ہیں۔ تبتابائی (العزان) اور ابن کتھیر نے اسی طرح اس بات پر زور دیا ہے کہ اخلاص (*اخلاس*) درست عبادت کا سنگ بنیاد ہے ، جس نے پرفارمیٹو تقویٰ کے ذریعہ چھپی ہوئی پولیتھیزم (*شرک خفی*) کے خلاف حضرت محمد کی انتباہ کا حوالہ دیا ہے۔ قربانی اور تبریسی (ماجما البیان) دونوں میکن سوسائٹی کے اخلاقی زوال کے اندر موجود آیت کو سیاق و سباق میں لاتے ہیں ، جہاں سخاوت کے منافقت کے ڈسپلے کو کمزوروں کو پسماندہ کرنے کے لئے استعمال کیا جاتا تھا۔  \n\nمذہبی ڈھانچے میں انحرافات ابھرتے ہیں۔ شیعہ کی تبصرے ، خاص طور پر توسی کے ایٹ تبیان اور قمی کے طافیر میں ، اکثر * ریا * کو * ولیاہ * (الہٰی مقرر کردہ قیادت سے بیعت) کے وسیع تر مسترد کرنے سے جوڑ دیتے ہیں ، اور اے ایچ ایل البیٹ کی رہنمائی کے خلاف مزاحمت کرنے کے علامتی عبادت کے طور پر غیر سنجیدہ عبادت کی ترجمانی کرتے ہیں۔ سنی اسکالرز جیسے رازی (مافاتیہ الغیب) اور تباری انفرادی ارادے (*نیہہ*) پر توجہ مرکوز کرتے ہیں ، جو عقیدے سے متعلق مباحثے (*ایمان*) اور اعمال سے متعلق تعلقات کے ساتھ*ریا*کی صورتحال رکھتے ہیں ، بغیر کسی قیادت کے تنازعات سے واضح تعلقات کے۔  \n\nیہ اختلافات الگ الگ تاریخی پیشرفت کی عکاسی کرتے ہیں۔ شیعہ تشریحات جائز اتھارٹی کے بارے میں تقریروں کے اندر نبی صلی اللہ علیہ وآلہ وسلم کے بعد ، اماموں کے ساتھ وفاداری کے ساتھ روحانی اخلاص کو جوڑتے ہوئے۔ سنی کی توثیق ، ​​جیسا کہ ابن کتھیر کے ساتھیوں کے اتفاق رائے پر زور دینے میں دیکھا گیا ہے ، فرقہ وارانہ اخلاقیات اور انفرادی احتساب کو ترجیح دیتا ہے۔  \n\nعملی طور پر ، دونوں روایات عبادت میں خود کی جانچ پر زور دیتے ہیں۔ تاہم ، شیعہ روحانیت اکثر اماموں کے لئے عقیدت کو منافقت کے خلاف حفاظت کے طور پر شامل کرتی ہے ، جبکہ سنی اخلاقی فریم ورک نبی am پر بنیادی رہنما کے طور پر نبی کے * سنت * پر زور دیتے ہیں۔ یہ متناسب اختلافات واضح کرتے ہیں کہ کس طرح مشترکہ قرآنی اصولوں کو متنوع ہرمینیٹیکل روایات سے افزودہ کیا جاتا ہے جو ابتدائی اسلامی مذہبی ترجیحات میں جڑے ہوئے ہیں۔",
    "layer2short": "In Surah al-Maa'un verse 6, Allah condemns \"those who make show [of their deeds]\" (alladhīna hum yurā'ūn), a condemnation rooted in the corruption of intention (niyyah) central to Shia ethical theology. Classical Shia exegetes emphasize that this verse exposes the spiritual peril of *riyā'* (ostentation) – performing acts of worship or charity not for divine pleasure but for worldly validation. ",
    "layer2short_urdu": "سورہ المحون آیت 6 میں ، اللہ تعالی نے \"ان لوگوں کو جو اپنے اعمال کو ظاہر کرتے ہیں\" کی مذمت کرتے ہیں (اللادھنہ ہم یوری ū ū) ، جو شیعہ اخلاقی الہیات کے مرکزی ارادے (نیہ) کی بدعنوانی (نیہہ) کی بدعنوانی میں جکڑی ہوئی مذمت کی گئی ہے۔ کلاسیکی شیعہ استثنیٰ اس بات پر زور دیتے ہیں کہ یہ آیت * ریائی ' * (اوسٹینٹیشن) کے روحانی خطرے کو بے نقاب کرتی ہے - عبادت یا خیرات کے کام انجام دے رہی ہے جو خدائی خوشی کے لئے نہیں بلکہ دنیاوی توثیق کے لئے ہے۔ "
  },
  "7": {
    "layer1": "In Surah Al-Maa’un, verse 7 condemns those who “withhold al-maa’un” (وَيَمْنَعُونَ ٱلْمَاعُونَ), a phrase that captures a profound ethical failure. The term *al-maa’un* derives from the root *ma’n*, meaning “small kindness” or “basic aid.” Classical Shia commentators like Allamah Tabatabai in *Al-Mizan* explain it as everyday acts of assistance—lending tools, sharing water, or offering minimal support to those in need. Historically, this verse targeted the hypocrites of Mecca who performed rituals like prayer (as mentioned in earlier verses) but neglected social duties, hoarding resources and refusing to help the vulnerable, including orphans and the poor (Tafsir al-Qummi). The Prophet Muhammad (pbuh) and the Ahlul Bayt, particularly Imam Ali, emphasized that faith without compassion is hollow; Imam Ali famously said, “God loves nothing more than generosity to the poor.”\n\nIn modern contexts, withholding *al-maa’un* translates to ignoring the small but vital acts of solidarity: refusing to lend a hand to a neighbor, withholding charity, or turning away from community needs. The verse challenges Muslims to integrate worship with social responsibility—prayer must inspire action. Today, this could mean supporting food banks, sharing skills, or advocating for equitable resource distribution. The verse’s timeless message is that faith thrives not in isolation but in nurturing collective welfare, reflecting the Shia principle that justice (*adl*) and compassion (*rahma*) are inseparable. By embracing *al-maa’un*, Muslims embody the spirit of the Ahlul Bayt, transforming ritual into lived ethics.",
    "layer2": "In Surah al-Maa’un (107:7), the phrase *\"وَيَمْنَعُونَ ٱلْمَاعُونَ\"* (\"And withhold [simple] assistance\") concludes a series of condemnations targeting those whose religious practice is marred by hypocrisy and social neglect. Classical Shia exegetes, drawing from the teachings of the Ahlul Bayt, emphasize that this verse transcends mere legalistic reproach, instead exposing a profound moral and spiritual failing rooted in the denial of communal responsibility.  \n\nAl-Tabrisi, in *Majma al-Bayan*, identifies *al-ma’un* as encompassing both material and non-material acts of assistance, including basic tools, household items, or even minor favors expected of neighbors. He notes that withholding such aid reflects a heart hardened against the rights (*huquq*) others hold in Islam, particularly the vulnerable. This aligns with the Shia theological principle that faith is inseparable from social ethics, as articulated in Imam Ali’s maxim: \"The best deed is satisfying the hungry or relieving a hardship\" (*Ghurar al-Hikam*).  \n\nAl-Tabtabai, in *Al-Mizan*, contextualizes this verse within the Qur’anic critique of ritualism devoid of compassion. He argues that withholding *al-ma’un* signifies a rejection of God’s blessings (*kufran al-ni’mah*), as all resources are divine trusts to be shared. This resonates with the Shia understanding of *tawhid* (divine unity), which obligates believers to mirror God’s mercy in their interactions. The verse thus condemns a transactional religiosity that prioritizes formal worship (e.g., prayer, mentioned in vv. 4–5) while neglecting the rights of creation—a duality the Imams consistently denounced as hypocrisy (*nifaq*).  \n\nJurisprudentially, classical scholars link this verse to the obligation of *ta’awun* (mutual cooperation) in Islamic law. While *al-ma’un* may not always constitute a strict legal obligation (*wajib*), its denial violates the *mustahabbat* (recommended acts) that cultivate communal harmony, a cornerstone of Shia social ethics. Imam Jafar al-Sadiq is reported to have said, \"The believer is the brother of the believer: his eyes and his guide; he does not betray him, oppress him, or withhold from him\" (*al-Kafi*), underscoring the integration of faith and social duty.  \n\nIn essence, this verse serves as a timeless admonition against spiritual complacency, urging believers to embody the mercy and justice intrinsic to the teachings of the Ahlul Bayt.",
    "layer3": "In contemporary Shia scholarship, Surah Al-Maa’un’s seventh verse—condemning those who “withhold simple assistance”—is widely interpreted as a call to dismantle systemic indifference toward societal welfare. Ayatollah Nasir Makarem Shirazi, in his *Tafsir-e Nemuneh*, emphasizes that *al-ma’un* (assistance) extends beyond material aid to include acts of social solidarity, such as sharing knowledge, time, or emotional support. This aligns with Imam Ali’s teaching in *Nahj al-Balagha*: “The best deed of a great man is to erase the tears of the helpless.”  \n\nModern scholars like Dr. Mohammad Ali Shomali connect this verse to today’s “empathy deficit” in hyper-individualistic societies. Neuroscientific studies on mirror neurons—which enable humans to intuitively sense others’ pain—underscore the Quranic view that withholding compassion contradicts innate human design. Philosophically, this verse critiques systems that prioritize profit over people, such as corporations hoarding patents for life-saving medicines or nations restricting aid to war-torn regions.  \n\nGlobally, the verse speaks to crises like climate injustice, where wealthy nations disproportionately withhold resources from vulnerable communities. Interfaith parallels abound: Pope Francis’s *Fratelli Tutti* similarly condemns indifference, while Buddhist teachings stress *dana* (generosity) as a moral imperative.  \n\nIn multicultural societies, the verse challenges us to reimagine citizenship—not as a transactional status but as a covenant of mutual care. As scholar Reza Shah-Kazemi notes, the Quran’s ethical vision transcends borders, urging believers to see the “stranger” as kin. In an age of polarization, this small but potent verse remains a manifesto for collective responsibility, demanding that faith be lived through acts of radical solidarity.",
    "layer4": "In the luminous teachings of the Ahlul Bayt (peace be upon them), the verse \"And withhold [simple] assistance\" (107:7) pierces the veil of superficial religiosity to expose diseases of the soul. Imam Ja'far al-Sadiq (as) taught that *\"al-Ma'un* refers not merely to material aid, but to the denial of even a drop of water from one's vessel to a thirsty believer.\" This withholding is framed as a spiritual bankruptcy stemming from rejection of *Wilayah* – the divine guardianship of the Prophet's Household. \n\nLady Fatimah Zahra (sa) declared in her historic sermon: *\"The believer's right upon the believer is to feed the hungry, clothe the naked, and relieve the distressed.\"* Here, withholding assistance becomes a violation of the sacred covenant between believers united through love for the Ahlul Bayt. The 6th Imam emphasized that *\"One who recognizes our rights but withholds kindness from his brother has not truly believed in our guardianship.\"* \n\nThis verse condemns the hypocrisy of performing ritual acts while neglecting the living reality of Imamah – for true submission manifests in serving creation as an extension of serving the Creator. The Imams taught that every act of assistance, however small, becomes a brick in the palace of divine proximity. To withhold the \"simple assistance\" is to block the flow of divine mercy through one's hands, a spiritual paralysis arising from attachment to worldly possessions. \n\nPractical guidance flows from Imam Ali's (as) counsel: *\"Make your wealth a bridge for others to reach Paradise.\"* Daily acts of sharing – a smile, a helpful hand, a loaned tool – become tests of our connection to the Imams. True faith demands that we see the face of the *Mawla* in every needy soul, for as the Prophet (pbuh) said: *\"The people are dependents of Allah – the most beloved to Allah are those most beneficial to His dependents.\"* Let us tear down the walls of our hearts, that the waters of generosity might flow freely from the springs of Muhammad's purified progeny.",
    "layer1_urdu": "سوراہ المعون میں ، آیت 7 ان لوگوں کی مذمت کرتی ہے جو \"المہون کو روکتے ہیں\" (وِلیہ یہودی \"(وِلیہ یہودی\" اصطلاح *الم maa ا *روٹ سے ماخوذ ہے *ماون *، جس کا مطلب ہے \"چھوٹی سی مہربانی\" یا \"بنیادی امداد\"۔ کلاسیکی شیعہ مبصرین جیسے * المزان * میں الامہ تبتابائی * اس کی وضاحت کے طور پر اس کی وضاحت کرتے ہیں۔ تاریخی طور پر ، اس آیت نے مکہ کے منافقوں کو نشانہ بنایا جنہوں نے نماز جیسے رسومات انجام دیئے (جیسا کہ سابقہ آیات میں ذکر کیا گیا ہے) لیکن معاشرتی فرائض کو نظرانداز کیا ، وسائل کو ذخیرہ کیا اور یتیموں اور غریبوں سمیت کمزوروں کی مدد کرنے سے انکار کردیا (طافسیر القومی)۔ حضرت محمد (صلی اللہ علیہ وآلہ وسلم) اور اہل بیت ، خاص طور پر امام علی نے اس بات پر زور دیا کہ ہمدردی کے بغیر ایمان کھوکھلا ہے۔ امام علی نے مشہور طور پر کہا ، \"خدا غریبوں کے لئے سخاوت کے علاوہ کچھ نہیں پسند کرتا ہے۔\"\n\nجدید سیاق و سباق میں ، * المحون * کو روکنے کا ترجمہ چھوٹی لیکن اہم یکجہتی کو نظرانداز کرنے کا ہے: کسی پڑوسی کو ہاتھ دینے سے انکار کرنا ، خیراتی ادارہ روکتا ہے ، یا معاشرتی ضروریات سے ہٹ جاتا ہے۔ آیت مسلمانوں کو معاشرتی ذمہ داری کے ساتھ عبادت کو مربوط کرنے کے لئے چیلنج کرتی ہے۔ آج ، اس کا مطلب فوڈ بینکوں کی مدد کرنا ، مہارت کا اشتراک کرنا ، یا وسائل کی مساوی تقسیم کی وکالت کرنا ہے۔ آیت کا لازوال پیغام یہ ہے کہ ایمان تنہائی میں نہیں بلکہ اجتماعی فلاح و بہبود کی پرورش میں پروان چڑھتا ہے ، جس سے شیعہ اصول کی عکاسی ہوتی ہے کہ انصاف (*ADL*) اور ہمدردی (*رہما*) لازم و ملزوم ہیں۔ *المحون *کو گلے لگا کر ، مسلمان اہل بیت کی روح کو مجسم بناتے ہیں ، اور رسم کو زندہ اخلاقیات میں تبدیل کرتے ہیں۔",
    "layer2_urdu": "سوراہ المعون (107: 7) میں ، یہ جملہ * \"وِلِیغن یہودی\" * (\"(\" اور روک تھام [سادہ] امداد \") نے مذمت کی ایک سیریز کا نتیجہ اخذ کیا ہے جن کی مذہبی رواج منابھ اور معاشرتی نظرانداز کی وجہ سے ہے۔ کلاسیکی شیعہ نے اہل بیت کی تعلیمات سے ڈرائنگ کرتے ہوئے اس بات پر زور دیا کہ یہ آیت محض قانونی طور پر ملامت سے بالاتر ہے ، بجائے اس کے کہ فرقہ وارانہ ذمہ داری کے انکار میں جڑیں ایک گہری اخلاقی اور روحانی ناکامی کو بے نقاب کریں۔  \n\nالاتبریسی ، *ماجما البیان *میں ، *المعون *کی نشاندہی کرتے ہیں جس میں امداد کی بنیادی اور غیر مادے کی کارروائیوں کو شامل کیا گیا ہے ، جس میں بنیادی اوزار ، گھریلو اشیاء ، یا یہاں تک کہ پڑوسیوں کی توقع کی گئی معمولی پسند بھی شامل ہیں۔ انہوں نے نوٹ کیا کہ اس طرح کی امداد کو روکنے سے حقوق (*ہکق*) کے خلاف سخت دل کی عکاسی ہوتی ہے جو دوسروں کو اسلام میں رکھتے ہیں ، خاص طور پر کمزور۔ یہ شیعہ مذہبی اصول کے مطابق ہے کہ ایمان معاشرتی اخلاقیات سے لازم و ملزوم ہے ، جیسا کہ امام علی کے میکسم میں بیان کیا گیا ہے: \"بہترین کام بھوکے کو مطمئن کر رہا ہے یا کسی مشکل کو دور کرنا ہے\" (*گھورار الحکام*)۔  \n\n*المزان *میں التبٹابائی ، اس آیت کو ہمدردی سے مبرا رسم و رواج کے قرآنی نقاد کے اندر سیاق و سباق سے دوچار کرتا ہے۔ اس کا استدلال ہے کہ*المعون*کو روکنا خدا کی برکتوں کو مسترد کرنے کی نشاندہی کرتا ہے (*کفران الن’مہ*) ، کیونکہ تمام وسائل مشترکہ طور پر الہی اعتماد ہیں۔ یہ * توہید * (الہی اتحاد) کی شیعہ تفہیم کے ساتھ گونجتا ہے ، جو مومنوں کو ان کی بات چیت میں خدا کی رحمت کا آئینہ دار کرنے کا پابند کرتا ہے۔ اس طرح یہ آیت ایک ایسے لین دین کی مذمت کرتی ہے جو باضابطہ عبادت کو ترجیح دیتی ہے (جیسے ، دعا ، جس کا ذکر VV. 4–5 میں کیا گیا ہے) جبکہ تخلیق کے حقوق کو نظرانداز کرتے ہوئے - ایک دوغلا پن کو اماموں کو مستقل طور پر منافقت (*nifaq*) کی مذمت کی جاتی ہے۔  \n\nفقہی طور پر ، کلاسیکی اسکالرز اس آیت کو اسلامی قانون میں * تاؤون * (باہمی تعاون) کی ذمہ داری سے جوڑتے ہیں۔ اگرچہ*المانون*ہمیشہ سخت قانونی ذمہ داری (*واجیب*) کی تشکیل نہیں کرسکتا ہے ، لیکن اس کے انکار نے*مصطوبت*(تجویز کردہ کارروائیوں) کی خلاف ورزی کی ہے جو فرقہ وارانہ ہم آہنگی کاشت کرتی ہے ، جو شیعہ معاشرتی اخلاقیات کا سنگ بنیاد ہے۔ امام جعفر السادق نے کہا ہے کہ ، \"مومن مومن کا بھائی ہے: اس کی آنکھیں اور اس کا رہنما۔ وہ اس سے غداری نہیں کرتا ، اس پر ظلم نہیں کرتا ہے ، یا اس سے روکتا نہیں ہے\" (*الکفی*) ، عقیدے اور معاشرتی فرائض کے انضمام کی نشاندہی کرتے ہوئے۔  \n\nخلاصہ یہ ہے کہ یہ آیت روحانی خوشنودی کے خلاف لازوال نصیحت کا کام کرتی ہے ، اور مومنوں پر زور دیتی ہے کہ وہ احل بائٹ کی تعلیمات سے متعلق رحمت اور انصاف کو مجسم بنائیں۔",
    "layer3_urdu": "عصری شیعہ اسکالرشپ میں ، سوراہ المعون کی ساتویں آیت-جو ان لوگوں کو \"سادہ مدد کو روکتی ہیں\" کے ساتھ مل رہی ہیں-جس کی وسیع پیمانے پر تشہیر کی جاتی ہے کہ وہ معاشرتی فلاح و بہبود کے بارے میں نظامی بے حسی کو ختم کرنے کی کال کے طور پر ہے۔ آیت اللہ ناصر مکارم شیرازی نے اپنے *طافسیر-ای نیمینہ *میں اس بات پر زور دیا ہے کہ *المعون *(امداد) معاشرتی یکجہتی کی کارروائیوں کو شامل کرنے کے لئے مادی امداد سے بالاتر ہے ، جیسے علم ، وقت ، یا جذباتی مدد۔ یہ *ناہج البالاگھا *میں امام علی کی تعلیم کے ساتھ صف بندی کرتا ہے: \"ایک عظیم آدمی کا بہترین کام بے بس کے آنسو کو مٹا دینا ہے۔\"  \n\nڈاکٹر محمد علی شومالی جیسے جدید اسکالرز اس آیت کو آج کے \"ہمدردی خسارے\" سے ہائپر انفرادی معاشروں میں جوڑتے ہیں۔ آئینے کے نیوران کے بارے میں نیورو سائنسی مطالعات - جو انسانوں کو دوسروں کے درد کو بدیہی طور پر سمجھنے کے قابل بناتے ہیں۔ فلسفیانہ طور پر ، یہ آیت ان نظاموں پر تنقید کرتی ہے جو لوگوں سے زیادہ منافع کو ترجیح دیتی ہے ، جیسے کارپوریشنوں نے زندگی بچانے والی دوائیوں یا ممالک کے لئے پیٹنٹ جمع کرنے کے لئے جنگ زدہ علاقوں میں امداد پر پابندی عائد کردی ہے۔  \n\nعالمی سطح پر ، آیت آب و ہوا کی ناانصافی جیسے بحرانوں کی بات کرتی ہے ، جہاں دولت مند ممالک غیر متناسب طور پر کمزور برادریوں کے وسائل کو روکتے ہیں۔ انٹرفیتھ کے متوازی بہت سارے ہیں: پوپ فرانسس کی * فریٹیلی توٹی * اسی طرح بے حسی کی مذمت کرتی ہے ، جبکہ بدھ مت کی تعلیمات اخلاقی لازمی قرار دیتے ہیں۔  \n\nکثیر الثقافتی معاشروں میں ، آیت ہمیں چیلنج کرتی ہے کہ وہ شہریت کا دوبارہ تصور کریں - جو لین دین کی حیثیت کے طور پر نہیں بلکہ باہمی نگہداشت کے عہد کے طور پر ہے۔ جیسا کہ اسکالر رضا شاہ کازیمی نوٹ کرتے ہیں ، قرآن مجید کا اخلاقی نقطہ نظر سرحدوں سے بالاتر ہے ، اور مومنوں کو \"اجنبی\" کو رشتہ دار کے طور پر دیکھنے کی تاکید کرتا ہے۔ پولرائزیشن کے دور میں ، یہ چھوٹی لیکن قوی آیت اجتماعی ذمہ داری کے لئے ایک منشور بنی ہوئی ہے ، جس کا مطالبہ ہے کہ عقیدہ بنیاد پرست یکجہتی کے عمل سے زندہ رہے۔",
    "layer4_urdu": "اہل بیت (ان پر امن) کی برائٹ تعلیمات میں ، آیت \"اور [سادہ] امداد کو روکتی ہے\" (107: 7) روح کی بیماریوں کو بے نقاب کرنے کے لئے سطحی مذہب کے پردے کو چھید دیتی ہے۔ امام جافر السادق (ع) نے سکھایا کہ * \"المون * محض مادی امداد سے نہیں بلکہ کسی کے برتن سے پیاسے مومن تک پانی کے ایک قطرہ سے انکار سے بھی انکار کرتا ہے۔\" اس روک تھام کو روحانی دیوالیہ پن قرار دیا گیا ہے جو * ولیہ * کے مسترد ہونے سے پیدا ہوتا ہے۔ \n\nلیڈی فاطمہ زہرا (ایس اے) نے اپنے تاریخی خطبہ میں اعلان کیا: * \"مومن کا مومن کا حق بھوکے کھانا کھلانا ، ننگے لباس پہننے اور پریشان ہونے کو دور کرنا ہے۔\" 6 ویں امام نے اس بات پر زور دیا کہ *\"جو ہمارے حقوق کو پہچانتا ہے لیکن اپنے بھائی سے احسان کو روکتا ہے۔ \n\nیہ آیت رسم کی کارروائیوں کے منافقت کی مذمت کرتی ہے جبکہ امامہ کی زندہ حقیقت کو نظرانداز کرتے ہوئے - تخلیق کار کی خدمت میں توسیع کے طور پر تخلیق کی خدمت میں حقیقی پیش کرنے کے لئے ظاہر ہے۔ اماموں نے یہ سکھایا کہ ہر امداد ، اگرچہ چھوٹا ہے ، خدائی قربت کے محل میں اینٹ بن جاتا ہے۔ \"سادہ مدد\" کو روکنے کے لئے یہ ہے کہ کسی کے ہاتھوں سے خدائی رحمت کے بہاؤ کو روکنا ہے ، یہ روحانی فالج دنیاوی املاک سے منسلک ہونے سے پیدا ہوتا ہے۔ \n\nعملی رہنمائی امام علی کے (ع) کے مشورے سے بہتی ہے: * \"اپنی دولت کو دوسروں کے لئے جنت تک پہنچنے کے لئے ایک پل بنائیں۔\" سچے عقیدے کا مطالبہ ہے کہ ہم ہر ضرورت مند روح میں * مولا * کا چہرہ دیکھیں ، کیوں کہ جیسا کہ نبی صلی اللہ علیہ وآلہ وسلم نے کہا: \"لوگ اللہ کے انحصار کرتے ہیں - اللہ کے سب سے پیارے وہ ہیں جو اس کے انحصار کے لئے سب سے زیادہ فائدہ مند ہیں۔\"",
    "layer5": "The phrase *“wa yamna‘ūna al-mā‘ūn”* (And withhold [simple] assistance) has drawn nuanced interpretations across Shia and Sunni exegetical traditions, reflecting shared ethical principles while diverging in theological emphasis. Both traditions broadly concur that the verse condemns miserliness in mundane acts of kindness, such as lending household items (e.g., pots, tools) or refusing basic charity—a moral failing linked to hypocrisy. Al-Tabari (Sunni) and Al-Tabrisi (Shia) both cite pre-Islamic Arab customs of withholding communal aid to underscore the verse’s critique of social callousness (*Majma al-Bayan*; *Jami al-Bayan*).  \n\nDivergences emerge in contextualizing *al-mā‘ūn*. Sunni commentators like Ibn Kathir and Al-Qurtubi emphasize individual ethics, interpreting it as a general rebuke of those who neglect zakat or neighborly obligations (*Tafsir Ibn Kathir*; *Al-Jami li-Ahkam*). Al-Razi’s *Mafatih al-Ghayb* extends this to psychological miserliness, framing it as a spiritual disease. In contrast, Shia exegetes like Al-Tabatabai (*Al-Mizan*) and Al-Qummi root the verse in the Qur’an’s broader socio-economic vision, linking it to the rights (*haqq*) of others—a theme central to the Ahlul Bayt’s teachings. Al-Tusi’s *At-Tibyan* explicitly ties withholding assistance to rejecting the Imams’ authority, reflecting Shia theological concerns about moral and spiritual leadership.  \n\nThese differences stem from distinct hermeneutical frameworks. Sunni tafsir often prioritizes literal and legal applications, whereas Shia works integrate the verse into a paradigm of divinely guided social justice. Historically, Shia emphasis on the Imams’ role as moral exemplars amplified the verse’s connection to communal responsibility, while Sunni interpretations evolved within contexts of legal codification and individual piety. Both traditions, however, reinforce the verse’s enduring relevance: a warning against ethical complacency in acts of everyday generosity.",
    "layer5_urdu": "جملے * \"وا یامنا’نا الم ā'ūن\" * (اور روک تھام [سادہ] امداد) نے شیعہ اور سنی کی مثال کی روایات میں متنازعہ تشریحات کھینچی ہیں ، جو مشترکہ اخلاقی اصولوں کی عکاسی کرتے ہیں جبکہ مذہبی زور میں مبتلا ہیں۔ دونوں روایات بڑے پیمانے پر اس بات پر متفق ہیں کہ آیت اس طرح کی بدکاری کی مذمت کرتی ہے ، جیسے گھریلو اشیاء (جیسے ، برتنوں ، اوزار) کو قرض دینے یا بنیادی خیراتی ادارے سے انکار - جو منافقت سے منسلک اخلاقی ناکام۔ التباری (سنی) اور الاتبریسی (شیعہ) دونوں نے اسلامی عرب رواج کو اجتماعی امداد کو روکنے کے لئے پیش کیا ہے تاکہ اس آیت کی معاشرتی صداقت پر تنقید کی نشاندہی کی جاسکے (*ماجما البیان*؛*جمی البیان*)۔  \n\nتغیرات کو سیاق و سباق میں *almā’ūn *میں ابھرتے ہیں۔ ابن کتھیر اور القورووبی جیسے سنی مبصرین انفرادی اخلاقیات پر زور دیتے ہیں ، اور ان لوگوں کی عام سرزنش کرتے ہیں جو زکوئت یا ہمسایہ ذمہ داریوں کو نظرانداز کرتے ہیں (*طافسیر ابن کتھیر*؛*الجامی لی احکم*)۔ العزانی کی * مافاتیہ الغیب * اس کو نفسیاتی بدگمانی تک بڑھا رہی ہے ، اور اسے روحانی بیماری کے طور پر تیار کرتی ہے۔ اس کے برعکس ، شیعہ التباطابائی (*المزان*) اور القومی کی طرح قرآن مجید کے وسیع تر سماجی و معاشی وژن کی آیت کو جڑ سے جوڑتا ہے ، اور اسے دوسروں کے حقوق (*حق*) سے جوڑتا ہے۔ التوسی کے * ایٹ تبیان * نے اخلاقی اور روحانی قیادت کے بارے میں شیعہ مذہبی خدشات کی عکاسی کرتے ہوئے ، اماموں کے اختیار کو مسترد کرنے کے لئے واضح طور پر مدد کو روکا ہے۔  \n\nیہ اختلافات الگ الگ ہرمینیٹیکل فریم ورک سے پیدا ہوتے ہیں۔ سنی طافسر اکثر لفظی اور قانونی درخواستوں کو ترجیح دیتے ہیں ، جبکہ شیعہ کام آیت کو خدائی ہدایت یافتہ معاشرتی انصاف کی مثال میں ضم کرتے ہیں۔ تاریخی طور پر ، شیعہ نے اخلاقی مثالوں کے طور پر اماموں کے کردار پر زور دینے سے آیت کے فرقہ وارانہ ذمہ داری سے تعلق کو بڑھاوا دیا ، جبکہ سنی کی تشریحات قانونی کوڈفیکیشن اور انفرادی تقویٰ کے سیاق و سباق میں تیار ہوئی ہیں۔ تاہم ، دونوں روایات آیت کی پائیدار مطابقت کو تقویت دیتی ہیں: روزمرہ کی سخاوت کے کاموں میں اخلاقی خوشنودی کے خلاف ایک انتباہ۔",
    "layer2short": "In Surah al-Maa’un (107:7), the phrase *\"وَيَمْنَعُونَ ٱلْمَاعُونَ\"* (\"And withhold [simple] assistance\") concludes a series of condemnations targeting those whose religious practice is marred by hypocrisy and social neglect. Classical Shia exegetes, drawing from the teachings of the Ahlul Bayt, emphasize that this verse transcends mere legalistic reproach, instead exposing a profound moral and spiritual failing rooted in the denial of communal responsibility.  ",
    "layer2short_urdu": "سوراہ المعون (107: 7) میں ، یہ جملہ * \"وِلِیغن یہودی\" * (\"(\" اور روک تھام [سادہ] امداد \") نے مذمت کی ایک سیریز کا نتیجہ اخذ کیا ہے جن کی مذہبی رواج منابھ اور معاشرتی نظرانداز کی وجہ سے ہے۔ کلاسیکی شیعہ نے اہل بیت کی تعلیمات سے ڈرائنگ کرتے ہوئے اس بات پر زور دیا کہ یہ آیت محض قانونی طور پر ملامت سے بالاتر ہے ، بجائے اس کے کہ فرقہ وارانہ ذمہ داری کے انکار میں جڑیں ایک گہری اخلاقی اور روحانی ناکامی کو بے نقاب کریں۔  "
  }
}